[
  {
    "title": "No hot water from boiler",
    "text": "Super fast turnaround. I called yesterday vvening to report we had no hot water. Steve answered our call immediately and came this morning to rectify the fault.",
    "postcode": "RH12",
    "date": "2023-07-01"
  },
  {
    "title": "Boiler service",
    "text": "Stephen serviced our gas boiler, he was very efficient and professional. Before carrying out the work, he explained what he was going to do. Additionally to the job, we asked his advice on a water pump and he went above and beyond explaining the system and providing his recommendations. We would highly recommend EVO.",
    "postcode": "RH5",
    "date": "2023-07-01"
  },
  {
    "title": "Emergency radiator leak fix",
    "text": "Very easy to get hold of for out of hours emergency. Quick to arrive and leak was repaired very swiftly. As well as the service being very good, we thought the price charge was also very good considering the service was same day and out of regular working hours.",
    "postcode": "RH20",
    "date": "2023-07-01"
  },
  {
    "title": "Clear drain blockage",
    "text": "Really grateful for the top class service we received from EVO drainage division. Drains were oveflowing every time water was run from inside. EVO responded quickly to our emergency, arriving within 2 hours. Problem was rectified very quickly, area was cleaned up, and we weren't charged an arm and a leg!",
    "postcode": "RH14",
    "date": "2023-07-01"
  },
  {
    "title": "Resolve upstairs water pressure issue",
    "text": "We hired EVO plumbing and heating to rectify our upstairs hot water pressure issue. Couldn’t be happier with the service we received, would not hesitate to recommend. Thanks again!",
    "postcode": "RH13",
    "date": "2023-07-01"
  },
  {
    "title": "Completion of required drainage pipe amendments",
    "text": "First class service completed with no disruption and at very good pricing",
    "postcode": "RH13",
    "date": "2023-07-01"
  },
  {
    "title": "New hot water cylinder",
    "text": "Delighted with the installation by Steve from EVO plumbing and heating. He was courteous and efficient .I feel they perfectly understthroughout the job and fitted the best water cylinder for me expertly and at a very good price. I highly recommend them.\"",
    "postcode": "RH13",
    "date": "2023-07-01"
  },
  {
    "title": "Reposition radiator pipework under floor",
    "text": "Very neat and tidy work Carried out by Steve. He always provides an reliable quality service",
    "postcode": "RH10",
    "date": "2023-07-01"
  },
  {
    "title": "Blocked basin",
    "text": "EVO plumbing arrived quickly and were able to clear the blockage without any problem. Very friendly staff and they were more than happy to check the other drainage runs for any potential problems. This company comes recommended",
    "postcode": "RH12",
    "date": "2023-07-01"
  },
  {
    "title": "Boiler service and system check",
    "text": "A thorough and careful job completed by Alan. Gave us very good and comprehensive advice on our system and future upgrades.",
    "postcode": "RH13",
    "date": "2023-07-01"
  },
  {
    "title": "Excellent",
    "text": "Arrived on time. Work carried out efficiently and was very pleasant.",
    "postcode": "BN1",
    "date": "2023-06-01"
  },
  {
    "title": "Fix Bathroom taps",
    "text": "Brilliant job undertaken by Steve. Only a small job but he was easy to get hold of, reliable, and he took great care with his work.",
    "postcode": "RH20",
    "date": "2023-06-01"
  },
  {
    "title": "Uckfield",
    "text": "Hugely impressed with the service provided by Evo. Friendly, professional and extremely efficient. Thank you Aaron.",
    "postcode": "TN22",
    "date": "2023-06-01"
  },
  {
    "title": "Install new radiators",
    "text": "Steven and Harvey were fantastic. It was a job that needed doing but we had been putting off because of what we perceived would be a major upheaval, but they took care of everything from ordering the radiators through to installation. The job was done neatly and quickly and all work areas were left spotless.",
    "postcode": "RH13",
    "date": "2023-06-01"
  },
  {
    "title": "Install new sink in utility room",
    "text": "Very pleased with the work Done. Would highly recommend to family and friends",
    "postcode": "RH12",
    "date": "2023-06-01"
  },
  {
    "title": "Leaking shower",
    "text": "Very prompt response, work completed satisfactorily. Courteous and professional throughout. Would definitely recommend.",
    "postcode": "RH12",
    "date": "2023-06-01"
  },
  {
    "title": "Out of hours leak fix",
    "text": "Would 100 per cent recommend Steve at EVO plumbing. Came late at night to fix leak through ceiling and took great care to ensure job was done properly despite being very late at night.",
    "postcode": "RH13",
    "date": "2023-05-01"
  },
  {
    "title": "Drain clearance, root removal, CCTV check",
    "text": "Excellent work from Jimmy. He was very enthusiastic in his work and had a lovely, friendly personality. He did a thorough and first rate job, and checked all he'd done before leaving.",
    "postcode": "RH16",
    "date": "2023-05-01"
  },
  {
    "title": "Leaking toilet cistern pipe",
    "text": "Excellent customer service. Quick, reliable, friendly and didn’t leave until he was satisfied the problem was solved. Even then he gave his mobile to ring in case of problems",
    "postcode": "RH14",
    "date": "2023-05-01"
  },
  {
    "title": "Install washing machine",
    "text": "Terrific work by Steve and team. Used his experience to provide a solution to install machine in area with no nearby water supply and drainage. Friendly workers providing quality service and producing first class results",
    "postcode": "RH12",
    "date": "2023-05-01"
  },
  {
    "title": "Repairing a boiler",
    "text": "Very friendly and efficient, couldnt have been more helpful. Id use them again if I needed to. Just a nice, knowledgeable, down to earth guy helping me fix my house.",
    "postcode": "RH12",
    "date": "2023-05-01"
  },
  {
    "title": "Boiler service and leak Fix",
    "text": "Steve is reliable, friendly and knowledgeable. I was kept informed and costs for work were fair and reasonable",
    "postcode": "RH12",
    "date": "2023-04-01"
  },
  {
    "title": "Leak repair",
    "text": "Great water supply pipe to the house repair job completed by Jaime. He is professional, polite and tidy. He replaced the stone path and repointed it all, looks better than it was before the repair.",
    "postcode": "RH12",
    "date": "2023-04-01"
  },
  {
    "title": "Extending an existing land drain system",
    "text": "Work completed to a high standard in dreadful conditions. The rain was pouring but they just got on with it. Really nice people.  They very effectively solved the problem I was seeking to address. I'm impressed.",
    "postcode": "GU6",
    "date": "2023-04-01"
  },
  {
    "title": "Install outside hot and cold water supply.",
    "text": "Steve was brilliant. We wanted to install an external hot and cold water supply so we could wash our dogs after muddy walks. He came up with a solution that was far better than we'd planned, and he sourced all parts too. Steve was reliable, friendly, and easy to deal with.",
    "postcode": "RH13",
    "date": "2023-04-01"
  },
  {
    "title": "Install chrome towell rail",
    "text": "Neat and tidy work. Steve purchased a very good quality item, and it was expertly installed. Very happy with the work done.",
    "postcode": "RH13",
    "date": "2023-03-01"
  },
  {
    "title": "Clear and repair collapsed drain",
    "text": "We used EVO to excavate, clear and repair a blocked drain. We were dreading having the work done because of the mess we thought it would cause, but the workers were brilliant. Clean, tidy repair and the work area was left spotless!",
    "postcode": "RH3",
    "date": "2023-03-01"
  },
  {
    "title": "They changed nearly all the radiators in my house, power flushed the system, and did all repairs",
    "text": "Steve and colleagues (Sorry, I forgot the name of the man but I can see his smiling face) are thorough, friendly and caring people. They ensure that all necessary jobs are done correctly. I trust them.",
    "postcode": "RH14",
    "date": "2023-03-01"
  },
  {
    "title": "Fix leak from pipe in loft",
    "text": "Steve provided an excellent service to remedy our leak problem. He was very rapid in arriving and fixed the problem very quickly. We shall be using his company's services again in the near future",
    "postcode": "RH12",
    "date": "2023-02-01"
  },
  {
    "title": "Install under sink water heater",
    "text": "EVO plumbing and heating were great with every aspect of this job. They responded to our request when other companies clearly weren't interested, kept us well informed, and did an excellent job. All workers were cheerful and friendly too",
    "postcode": "RH12",
    "date": "2023-01-01"
  },
  {
    "title": "Unblock Kitchen sink waste from pipe behind cupboard",
    "text": "Fantastic response time, friendly and tidy service. Could not fault their work at all.",
    "postcode": "RH10",
    "date": "2023-01-01"
  },
  {
    "title": "Unblock and fix overflowing kitchen drain",
    "text": "EVO were able to fix and repair a long standing drain issue very quickly. We had been putting up with this problem for quite some time as we had previously been put off by high prices from another local company. However, EVO were recommended to us and sorted the problem quickly and at very reasonable cost.",
    "postcode": "RH13",
    "date": "2023-01-01"
  },
  {
    "title": "Diagnose and fix central heating issue",
    "text": "Great response from EVO and Nathan was able to diagnose and fix the problem very quickly.",
    "postcode": "RH16",
    "date": "2023-01-01"
  },
  {
    "title": "Power flush heating system",
    "text": "Great service and great results. Very likeable personnel and the company goes the extra mile to ensure complete customer satisfaction",
    "postcode": "TN6",
    "date": "2022-12-01"
  },
  {
    "title": "Boiler installation",
    "text": "10/10 excellent service. Steve called and saved the day. His team arrived on time and when he said they would. The plumber was polite and knowledgable. The interaction was spot on and I was kept informed all through the day about the state of the works. The utility room was actually left cleaner than it was. If you need anything doing boiler or heating wise I would have no problem recommending Steve and his team.",
    "postcode": "KT17",
    "date": "2022-12-01"
  },
  {
    "title": "Install washing machine and unblock sink",
    "text": "Steven was helpful and accommodating and did and did a really great job sorting my plumbing and drainage.",
    "postcode": "RH13",
    "date": "2022-12-01"
  },
  {
    "title": "Bathroom tap replacement",
    "text": "EVO plumbing were accomodating, courteous, friendly and professional. We were very pleased with the work installing new bathroom taps and they really were a pleasure to deal with. Highly recommend their services.",
    "postcode": "RH11",
    "date": "2022-11-01"
  },
  {
    "title": "Boiler service and balance radiators",
    "text": "Terrific reliable and quality service. Definitely recommend and personally would use no other plumbing and heating company.",
    "postcode": "RH12",
    "date": "2022-10-01"
  },
  {
    "title": "Kitchen Sink drain blocked",
    "text": "Smart friendly and efficient service and reasonably priced. Jamie did an excellent job",
    "postcode": "RH13",
    "date": "2022-10-01"
  },
  {
    "title": "Replacing our boiler, fitting a smart home thermostat and power flushing our heating system.",
    "text": "Had a great experience with Evo. Their man came out to quote and quickly sent through a competitive price. It was a 4 day job and our installer was very friendly and accommodating. He kept us updated throughout each day as to what was going to happen, and what he'd be carrying out the next day. The work was all done to an excellent standard, with everything tidied up at the end of each day. Will definitely be using Evo again for any plumbing requirements.",
    "postcode": "GU14",
    "date": "2022-10-01"
  },
  {
    "title": "Fit new boiler",
    "text": "Excellent service and emergency response by Steve, who made safe our gas boiler. Within 2 days we had a new boiler delivered and fitted the following day. The engineer, Aaron, stayed late to get the job finished. Would highly recommend their efficient and kindly way of dealing with our emergency situation.",
    "postcode": "BN6",
    "date": "2022-10-01"
  },
  {
    "title": "Boiler and hot water cyclinder replacement, power flush",
    "text": "2nd time I have used Evo / Nathan. Exceptional service from assessment and recommendations to execution. High quality and considerate. Very good value, you pay for what you get here. I would recommend without reservation",
    "postcode": "GU24",
    "date": "2022-09-01"
  },
  {
    "title": "Drain gully installed",
    "text": "A very tidy job done in half a day. A little more costly than expected, but worth it.",
    "postcode": "GU6",
    "date": "2022-09-01"
  },
  {
    "title": "Clear blocked drain",
    "text": "Very quick, reliable and tidy service. Would definitely recommend to others",
    "postcode": "RH12",
    "date": "2022-08-01"
  },
  {
    "title": "Water run to American Style Fridge",
    "text": "We chose to go with EVO for this work as they were very approachable and provided the best solution for a complicated water run. Their quality of work was excellent.",
    "postcode": "RH13",
    "date": "2022-08-01"
  },
  {
    "title": "Emergency fix to a leak in inlet pipe in water tank in loft.",
    "text": "Excellent. Can't fault service. Needed same day fix for us without mains water. Steve was very knowledgeable and personable, highly recommend and would use again.",
    "postcode": "BN7",
    "date": "2022-08-01"
  },
  {
    "title": "Replacement of soil pipe, reconnection to toilet, relining drains broken by tree roots...",
    "text": "Great work by the team, replaced a old cast iron soil pipe, reconnected to the toilet, relined drains ruptured by roots, rejigged gutter pipes, removed redundant drain and made good. All very friendly, hard working and a really good quality job. Would highly recommend.",
    "postcode": "RH19",
    "date": "2022-08-01"
  },
  {
    "title": "Replace section of soil pipe",
    "text": "Very impressed with the work. Very neat and tidy. Great reliable service.",
    "postcode": "RH13",
    "date": "2022-08-01"
  },
  {
    "title": "Install new shower cubicle",
    "text": "Really happy with the work that was done. Steve and co. Were friendly and very compromising, and the finished installation looks amazing!",
    "postcode": "RH12",
    "date": "2022-08-01"
  },
  {
    "title": "We thought we had a bird trapped in the boiler. Turned out it was behind the washing machine.",
    "text": "Steven dropped everything to come to the rescue and went to a great deal of trouble to find this baby bird, moved the washing machine and coaxed it out before reuniting it with its anxious parents at the front door. He went the extra mile and was really kind and pleasant responding within 40 minutes. It took 90 minutes to resolve this unusual problem. We were so grateful (as were the Blackbirds parents). Highly recommended for his work ethic",
    "postcode": "RH15",
    "date": "2022-07-01"
  },
  {
    "title": "Clear blocked shower",
    "text": "Quick response, tidy work, , friendly workers and very reasonable pricing.",
    "postcode": "RH13",
    "date": "2022-07-01"
  },
  {
    "title": "Replacement Boiler",
    "text": "Have used Evo Home Services (both Steve and Harvey) since about 2013. Have always appreciated their honest advice and they have always been as flexible as possible to get the job done.  Existing boiler suddenly reached end of life (spare parts no longer supported) and Steve could not have been more accommodating to both secure a new boiler and schedule the work in at earliest opportunity to minimise disruption. All paperwork completed promptly to provide the 10yr guarantee.  Many thanks to Steve, Aaron and Harvey for their efforts and will continue to use their services in future.",
    "postcode": "RH10",
    "date": "2022-06-01"
  },
  {
    "title": "Replace three sewer drain sections, and two gullys",
    "text": "Steve and the team did a great job, they worked hard and had a good attention to detail. The work itself was a high quality and they made sure that the job was finished to a strong standard. Will use again.",
    "postcode": "PO22",
    "date": "2022-05-01"
  },
  {
    "title": "Boiler Service",
    "text": "Amazing service and will definitely use again when required. Quick, efficient and sorted everything that was needed with no fuss whatsoever.",
    "postcode": "RH10",
    "date": "2022-05-01"
  },
  {
    "title": "Water leaking from toilet",
    "text": "We called Evo this morning and Mark called this afternoon. He was very helpful and managed to sort out the problem. Very efficient, polite and a great job",
    "postcode": "RH13",
    "date": "2022-05-01"
  },
  {
    "title": "Relay foul drainage pipe",
    "text": "We are delighted with the work. Great care was taken lifting and relaying our block paving and the repair cannot be noticed.",
    "postcode": "RH12",
    "date": "2022-04-01"
  },
  {
    "title": "Replace broken ball valve and leaking stopcock",
    "text": "We had just moved into our new home, only to find out the stopcock was leaking and the ball valve in the water tank was broken. We rang Evo late on a Wed evening and they came out next day. Without any fuss both jobs were completed quickly and efficiently, with great customer service. Would highly recommend",
    "postcode": "RH13",
    "date": "2022-04-01"
  },
  {
    "title": "Serviced boiler, pressure water tank",
    "text": "Very good job and very courteous.",
    "postcode": "GU6",
    "date": "2022-03-01"
  },
  {
    "title": "Fix Tap Leaks",
    "text": "Job was completed quickly and with no fuss. Only a small job but great to find a company who answer the phone and respond quickly without messing around.",
    "postcode": "RH12",
    "date": "2022-03-01"
  },
  {
    "title": "Plumbing repairs.",
    "text": "I was very pleased as I had a problem, phoned them up, they came out the same day to diagnose the problem quickly and came out the next day to fix the problem. I would recommend them.",
    "postcode": "RH19",
    "date": "2022-03-01"
  },
  {
    "title": "Fit replacement shower valve",
    "text": "Mark fitted a replacement shower valve for us with minimum fuss and under an hour. Mark was tidy, polite and professional. What more could you ask for. I would certainly recommend this company.",
    "postcode": "RH13",
    "date": "2022-03-01"
  },
  {
    "title": "Boiler Fix",
    "text": "Steve was quick at replying to all messages and came out very promptly to check boiler as fault showing up. Part was ordered and replaced Saturday morning. Friendly reliable and very helpful. Would certainly recommend",
    "postcode": "RH13",
    "date": "2022-03-01"
  },
  {
    "title": "Rainwater soakaway",
    "text": "Excellent job carried out in difficult circumstances due to unusually stormy weather. But we are very pleased with the result, and every effort was made to leave the site in a clean and tidy condition. Good organisation and very courteous and regular communication that gave much reassurance throuthout the procedure.",
    "postcode": "RH13",
    "date": "2022-02-01"
  },
  {
    "title": "Repaired leak in kitchen.",
    "text": "Very efficient and very quick. I will be using again.",
    "postcode": "RH12",
    "date": "2022-02-01"
  },
  {
    "title": "Boiler service and fault repaired. New gas pressure valve fitted.",
    "text": "Very conscientious. He made sure everything was secure and safe.",
    "postcode": "RH13",
    "date": "2022-02-01"
  },
  {
    "title": "Identifying leak in boiler and replacement of seals in condensate trap",
    "text": "The work was carried out diligently, the source of the leak was found and the defective seals were replaced. The work involved travelling to wholesaler to obtain seals twice as wholesaler gave wrong part in the first instance. The price for the work was reasonable.",
    "postcode": "RH13",
    "date": "2022-01-01"
  },
  {
    "title": "Annual boiler service",
    "text": "Excellent service, Stephen was very efficient and friendly. Evo managed to squeeze us in last minute after previously being let down by British Gas. Would absolutely recommend and use again!",
    "postcode": "RH13",
    "date": "2022-01-01"
  },
  {
    "title": "Fit new kitchen tap, fix leaking toilet, boiler service",
    "text": "Steve was really friendly and knowledgeable. Explained everything he was doing thoroughly and was very easy to have around the house. Honest and reliable plumber, would highly recommend. Thanks",
    "postcode": "RH14",
    "date": "2022-01-01"
  },
  {
    "title": "Fix toilet that was not filling",
    "text": "Steve was great. We were worried that we would be left with no toilet over Christmas period, but Steve from EVO came out at short notice to resolve. Great service!",
    "postcode": "RH13",
    "date": "2021-12-01"
  },
  {
    "title": "Re-site radiator",
    "text": "Neat and tidy work. Very content with all that's been done",
    "postcode": "TN16",
    "date": "2021-12-01"
  },
  {
    "title": "Leak from under sink pipework.",
    "text": "Excellent. Steve was brilliant on his communication, on time and solved my problem promptly.  I would recommend him to anyone.",
    "postcode": "RH12",
    "date": "2021-11-01"
  },
  {
    "title": "Boiler Service",
    "text": "I found Stephen Morgan really friendly, honest and very helpful. I would definately recommend him to anyone.",
    "postcode": "BN9",
    "date": "2021-10-01"
  },
  {
    "title": "Clearing blockage on shower cold feed pipe",
    "text": "Arun did a great job fixing my shower. Really nice guy. Would definitely recommend. Cheers",
    "postcode": "RH13",
    "date": "2021-09-01"
  },
  {
    "title": "Large leak mains water supply o/s bungalow",
    "text": "Very reliable - always turned up when said so. Works to his own high standard and will not accept sub-standard work. Very impressed throughout.",
    "postcode": "BN44",
    "date": "2021-08-01"
  },
  {
    "title": "Fix water leak",
    "text": "We have used Evo Plumbing twice before and on each occasion they have responded quickly to our request for an appointment, have then arrived on time and sorted the problem efficiently with no fuss or mess. We can thoroughly recommend them and they will come out 24 hours for an emergency which is good to know!",
    "postcode": "RH13",
    "date": "2021-06-01"
  },
  {
    "title": "Plumbing amendment to pipes for dishwasher ready for replacement",
    "text": "Excellent service. Very friendly and helpful, kept the place very tidy afterward too!",
    "postcode": "RH16",
    "date": "2021-05-01"
  },
  {
    "title": "Problem with the flush on the toilet system",
    "text": "Colin sorted out a longstanding problem with the flush on our toilet! He identified the problem, supplied the parts and the result is we have a toilet in perfect working order! A very neat, tidy and professional job from Colin as always!",
    "postcode": "RH12",
    "date": "2021-05-01"
  },
  {
    "title": "Fixed leak in cupboard and new toilet handle",
    "text": "I couldn't of ask for anything better and will be using him again. I couldn't of been more pleased.",
    "postcode": "RH20",
    "date": "2021-05-01"
  },
  {
    "title": "Leak in the ceiling bedroom",
    "text": "I phoned them and explained what needed doing and they sent Mark out to do the job. I am so pleased with the work and have them coming back to do more work and wouldn't use anyone else.",
    "postcode": "RH20",
    "date": "2021-05-01"
  },
  {
    "title": "Replace broken central heating pump",
    "text": "Nathan from Evo was able to fit our repair in around another job in our local area, so it was fixed the same day we called. Polite, quick - would recommend.",
    "postcode": "RH19",
    "date": "2021-05-01"
  },
  {
    "title": "Gutter Cleaning",
    "text": "I contacted Colin to clean the guttering which over the winter had collected lots of debris and leaves! The job was completed no mess, no fuss and no need for ladders! The machine that was used hoovers everything from ground level. Thank you Colin.",
    "postcode": "RH12",
    "date": "2021-04-01"
  },
  {
    "title": "Disconnect gas cooker at old property and re connect at new property",
    "text": "Very friendly, professional and helpful when we had short notice to move house, Steve arrived on time and disconnected our gas cooker, checked the pressure and then came back a week later to our new home, I would recommend for your services. Thank you Steve",
    "postcode": "RH12",
    "date": "2021-04-01"
  },
  {
    "title": "Remove ruptured soil pipe and replace with new",
    "text": "I contacted Steve desperate for help, water had poured through my kitchen ceiling. Nathan arrived and located the ruptured soil pipe within minutes. Both Colin and Nathan worked solidly all day. The soil pipe was located behind a very delicate tile hung elevation, the tiles were carefully removed and when the new soil pipe had been replaced, the tiles were rehung perfectly. Everything was left very clean and tidy. I am very grateful to Evo and would highly recommend this company.",
    "postcode": "RH12",
    "date": "2021-04-01"
  },
  {
    "title": "New boiler installed",
    "text": "Nathan was excellent, very neat and today and explained everything we needed to know. Highly recommended, as are Evo generally, having recently used them for drain repairs too.",
    "postcode": "GU1",
    "date": "2021-04-01"
  },
  {
    "title": "Ongoing 2 month problem with pressure - ?Leak",
    "text": "Competent, thorough, advisory, polite and Nathan solved a 2 month very worrying problem. I would not hesitate to recommend this company",
    "postcode": "RH14",
    "date": "2021-02-01"
  },
  {
    "title": "Checking washing machine leak and repairing dishwasher pipe leak",
    "text": "An excellent job done by Mark with little fuss and great courtesy. We would highly recommend this firm for their speed of response, helpful advice and competent work carried out.",
    "postcode": "RH13",
    "date": "2021-02-01"
  },
  {
    "title": "Fit replacement bathroom pump.",
    "text": "Brilliant service from Colin to fit new pump to bathroom. Would recommend Evo everytime. Thanks.",
    "postcode": "RH6",
    "date": "2021-02-01"
  },
  {
    "title": "Fix Central Heating",
    "text": "Colin fixed it and no problems since",
    "postcode": "SW16",
    "date": "2021-01-01"
  },
  {
    "title": "Boiler Repair",
    "text": "I had an issue with my boiler which required urgent attention. Steve rearranged other appointments in order to come and take a look and identified the problem very quickly. I had a quote to repair the next day and we agreed a date to carry out the repairs. On the day of the repair, Steve arrived fully kitted out with PPE and cracked straight on with the job. He kept me well informed at all stages and the boiler was fixed by the end of the day. Steve went above and beyond to complete the job and me and my family are very grateful!",
    "postcode": "RH12",
    "date": "2021-01-01"
  },
  {
    "title": "Repaired leaking pipe in loft.",
    "text": "I would recommend Evo to anybody that has a problem with their plumbing and needing it fixed quickly.",
    "postcode": null,
    "date": "2020-12-01"
  },
  {
    "title": "Shower unit fitted",
    "text": "Work carried out efficiently and tidily very pleased.",
    "postcode": null,
    "date": "2020-10-01"
  },
  {
    "title": "A boiler service",
    "text": "Efficient, polite and professional.",
    "postcode": null,
    "date": "2020-10-01"
  },
  {
    "title": "New over Bath shower unit plumbed in.",
    "text": "All work completed to a high standard with good customer interaction for the detail.",
    "postcode": null,
    "date": "2020-10-01"
  },
  {
    "title": "New toilet installed",
    "text": "Once again Steve has done a superb job. Sourced the new toilet, removed the old one and installed the new one including making some pipework adjustments. Excellent workmanship, a very neat and professional job as always.",
    "postcode": null,
    "date": "2020-10-01"
  },
  {
    "title": "Removal and fitting of water tank elements in hot water tank",
    "text": "Steve attended as an emergency when my hot water had failed on Monday he came out on the same day, he reset the tank so hot water was running but said the element needed to be replaced. He wore PPE at all times,= quoted whilst on site, ordered the parts whilst still there and returned on Thursday to remove old element and fit new one. Steve was polite, punctual and ensured everything was back as was found before he left. Put me at ease as I was panicking due to having no hot water.",
    "postcode": null,
    "date": "2020-10-01"
  },
  {
    "title": "Fitted bath taps and shower attachment",
    "text": "Mark arrived from Evo Home Services, on time as promised. The work was carried out to a very high standard as usual and Mark safely observed Covid restrictions at all times. I would not hesitate to contact Evo in the future for any heating or plumbing work.",
    "postcode": null,
    "date": "2020-09-01"
  },
  {
    "title": "Boiler service and confirm and fix gas leak from hob",
    "text": "Steve was fantastic - from response time to our original enquiry (which was sent on a Thursday evening), to being able to visit the following day. He came for a boiler service but was surprised with a gas leak from the hob which he dealt with quickly, along with answering a barrage of questions about central heating and future options. Thoroughly professional and extremely helpful, we'll definitely be using them again!",
    "postcode": null,
    "date": "2020-09-01"
  },
  {
    "title": "Replacement parts for boiler and service",
    "text": "We found Steve to be reliable, courteous, knowledgable and efficient. He did a good job and we would recommend him.",
    "postcode": null,
    "date": "2020-09-01"
  },
  {
    "title": "Boiler service",
    "text": "First had Steve over for a boiler service 3 years ago and have stuck with him since then. Very trustworthy guy, based on hours of work to get an old boiler running as well as possible during the first service I had with them (charged no extra I should add!) He has since then replaced my boiler at a very good price and with excellent workmanship.  Was a bit late for today’s service, but contacted me to let me know. Can’t say fairer than that - I’m sure that first long service 3 years ago made him late for other people!",
    "postcode": null,
    "date": "2020-09-01"
  },
  {
    "title": "New flush on toilet system",
    "text": "A quick and professional job. Manner was professional. A very good job.",
    "postcode": null,
    "date": "2020-09-01"
  },
  {
    "title": "Kitchen tap dripping.",
    "text": "Replaced whole tap, bought new one and fitted it. Very good.",
    "postcode": null,
    "date": "2020-09-01"
  },
  {
    "title": "New stop cock.",
    "text": "Very satisfied with what they have done.",
    "postcode": null,
    "date": "2020-08-01"
  },
  {
    "title": "Steve dealt with the leak from our boiler very swiftly and efficiently",
    "text": "(As above) so would be happy to use him again.",
    "postcode": null,
    "date": "2020-08-01"
  },
  {
    "title": "Leaking pipe and diversion for washing machine pipe",
    "text": "We are extremely pleased with the work Steve did for us and would recommend his services.",
    "postcode": null,
    "date": "2020-08-01"
  },
  {
    "title": "Blocked pipe work removed and rerouted. System Power Flush",
    "text": "Steve did an excellent job of clearing the blocked pipes and changing the pipe work so the problem would not re-occur. The Power Flush definitely cleaned out the system and the radiators have never been hotter than these are now. A job well done.",
    "postcode": null,
    "date": "2020-08-01"
  },
  {
    "title": "Boiler Service",
    "text": "Rang afternoon of Monday and was done by Tuesday at 10:30. Really quick and efficient.",
    "postcode": null,
    "date": "2020-08-01"
  },
  {
    "title": "Faulty valve in boiler fixed (radiators were always on)",
    "text": "Steve came by to investigate the fault and he quoted for the work, which came through on a professional email automatically. He then came back on the date and time we agreed to complete the work. He was conscientious about health concerns (CV19) and was great with our small children, who were curious. He was professional and thorough, and tidied up after himself. He also gave the kids an impromptu lesson about plumbing, to their great interest!",
    "postcode": null,
    "date": "2020-08-01"
  },
  {
    "title": "Boiler Service and Overflow Fix",
    "text": "Steve was very quick, clean, pleasant and went above and beyond the work we were paying for. He gave us a lot of advice, and helped us with an overflow problem, without incurring any extra cost.",
    "postcode": null,
    "date": "2020-07-01"
  },
  {
    "title": "C/H boiler repaired and services",
    "text": "Steve was very courteous, arrived on time to service the boiler. A fault was found and repair agreed. Parts ordered and second date arranged, on time and repair quickly completed. Will use EVO again.",
    "postcode": null,
    "date": "2020-07-01"
  },
  {
    "title": "Not specified by customer.",
    "text": "No comments given.",
    "postcode": null,
    "date": "2020-07-01"
  },
  {
    "title": "Plumb in new outside tap and re position sink hot and cold supplies",
    "text": "A very neat and professional job. We would not hesitate to call Steve again.",
    "postcode": null,
    "date": "2020-07-01"
  },
  {
    "title": "Replacemnet of gas central heating boiler and power wash",
    "text": "A very thorough job. The power wash included both vibrating the radiators and using a magnetic machine to draw off the swarf from the system arising from the old cast iron boiler. Lots of additional work done to modernise the central heating and make the new boiler as efficient as possible. Overall very pleased.",
    "postcode": null,
    "date": "2020-06-01"
  },
  {
    "title": "Boiler service",
    "text": "Very friendly and professional. Work was done during the Covid lockdown. Arrived promptly, distance was kept, hands were washed and a face mask was worn. Highly recommended.",
    "postcode": null,
    "date": "2020-06-01"
  },
  {
    "title": "Renewed heating pump, zone valves thermostats etc, power flush etc glowworm boiler",
    "text": "Brilliant - went the further mile! Thanks to Steve Morgan.",
    "postcode": null,
    "date": "2020-06-01"
  },
  {
    "title": "Boiler service and new solenoid valve motor",
    "text": "Very thorough and prompt and efficient service. Service Report provided after work completed. Face mask and sanitisers and hand washing used/adopted by operative due to Covid 19.",
    "postcode": null,
    "date": "NaN-aN-aN"
  },
  {
    "title": "Clearing a blocked drain",
    "text": "The work took just over one hour. He efficiently dealt with the problem, cleaned and tidied up afterwards, and ensured that everything was working properly. I would highly recommend him to anyone with a blocked drain.",
    "postcode": null,
    "date": "NaN-aN-aN"
  },
  {
    "title": "Fitted a new shower",
    "text": "Steve came and fitted a new shower very courteous and maintained social distancing he also came wearing a mask and completed work efficiently . I would highly recommend him and Evo Home services I will use again should the need arrive.",
    "postcode": null,
    "date": "2020-04-01"
  },
  {
    "title": "Leak from the loft tank",
    "text": "Steve was amazing, came really quickly as I had emergency, really friendly and helpful. Due to corona virus time, he came wearing a mask and made sure social distancing was kept at all times. Highly recommended",
    "postcode": null,
    "date": "2020-04-01"
  },
  {
    "title": "Leak in utility room ceiling repaired",
    "text": "Steve answered an emergency call promptly and carried out the work needed immediately. He was particularly aware about coronavirus risks - I am currently shielded - and went to great lengths to make sure that I was safe while he was present. His clearing up was excellent and included sanitising all surfaces he had come into contact with. I was most impressed with the service given.",
    "postcode": null,
    "date": "2020-04-01"
  },
  {
    "title": "Boiler not working. Sorted it out very quickly",
    "text": "Arrived within a hour of calling . Explained what was wrong and fixed it. Very friendly. Also followed the guide lines for working through the Coronavirus pandemic. Felt safe with having someone working in the house I definitely use them again.",
    "postcode": null,
    "date": "2020-04-01"
  },
  {
    "title": "Leak from boiler pressure relief valve and a Boiler Service for two boilers.",
    "text": "A quick response and spare part obtained the next day and prompt fitting to cure leak. Courteous and respectful and good communication with prompt replies. Kept well informed of issues and explained problems well. I don't usually give full marks unless unusual circumstances arise which are dealt with well. In this case I was offered a cheaper alternative to a problem that was not in his financial interest. I would recommend Evo Home Services without hesitation.",
    "postcode": null,
    "date": "2020-04-01"
  },
  {
    "title": "Got boiler working again",
    "text": "I have cancer and therefore no immune system. My boiler went out during self-isolation which is really dangerous for me. Steve from Evo came with a mask, gloves and antiseptic spray. He sorted everything quickly and efficiently and cleaned everything down for my benefit. It was all SO appreciated!",
    "postcode": null,
    "date": "2020-04-01"
  },
  {
    "title": "Cleared a blocked gas valve",
    "text": "Steve was fantastic. He explained everything he was doing and found the problem very quickly. I would definitely use him again.",
    "postcode": null,
    "date": "2020-03-01"
  },
  {
    "title": "Repaired our Central Heating",
    "text": "On explaining our problem with our Central Heating, Steve was able to quickly diagnose the problem and fix it on the same day. Great job done as our heating is working as good as it’s ever. If you want a reliable plumber that will fix ur fault first time, then give Steve a call, I can highly recommend him.",
    "postcode": null,
    "date": "2019-12-01"
  },
  {
    "title": "Repressurise boiler",
    "text": "Incredibly efficient, accommodating and polite. Would definitely use again. An amazing service.",
    "postcode": null,
    "date": "2019-11-01"
  },
  {
    "title": "Fitted new taps to an existing sink",
    "text": "We called Steve with a very tricky problem, the set of taps we had bought for an existing sink, were proving very difficult to fit, due to the size of an original opening previously made! After discussions with Steve, Evo team member Scott managed to retain the original sink and fit the taps perfectly! Well done Scott, we are delighted.",
    "postcode": null,
    "date": "2019-10-01"
  },
  {
    "title": "Boiler Service",
    "text": "Knowledgeable, informative and extremely helpful suggesting I contact boiler H/O direct. Spotted something was not right and spoke to manufacturer on my behalf. Would definitely use again.",
    "postcode": null,
    "date": "2019-09-01"
  },
  {
    "title": "Connecting up a new towel heater to existing central heating pipes",
    "text": "EVO confirmed a date for the work to be done and carried out the work as planned. Clean tidy and reliable.",
    "postcode": null,
    "date": "2019-09-01"
  },
  {
    "title": "Boiler service.",
    "text": "No comments given.",
    "postcode": "Kent",
    "date": "2019-08-01"
  },
  {
    "title": "Radiors/Powerflush",
    "text": "Very good.",
    "postcode": null,
    "date": "2019-08-01"
  },
  {
    "title": "Boiler service and fixing problem with hot water",
    "text": "Thorough service of boiler carried out and problem with hot water resolved. Polite and helpful service. Would recommend.",
    "postcode": null,
    "date": "2019-07-01"
  },
  {
    "title": "Unblocked shower and sink",
    "text": "Job done swiftly and thoroughly. Very personable and professional. Knowledgeable and patiently answered all my questions!",
    "postcode": null,
    "date": "2019-05-01"
  },
  {
    "title": "Two new taps fitted in the kitchen and downstairs toilet.",
    "text": "Evo Plumbing have done several jobs for us over the years and I always feel confident, when either Steve, Harvey or Colin attend. On this occasion Colin arrived promptly and began work fitting the taps. Colin works quietly and very methodically, causing minimal disruption and in no time both taps were in place. As usual Colin's standard of work is high and I wouldn't hesitate to recommend this team of heating engineers.",
    "postcode": null,
    "date": "2019-04-01"
  },
  {
    "title": "Boiler replacement and Nest thermostat added.",
    "text": "Steve provides informative quotes by explaining what needs to be done, how and if there’s any initial observations that may cause problems so there’s no nasty surprises. Once working on the job he is very efficient, provides feedback on how the task is going and offers useful information at the end to ensure you know how best to maintain the work that he’s done. Would 100% recommend.",
    "postcode": null,
    "date": "2019-04-01"
  },
  {
    "title": "Toilet leak fixed.",
    "text": "Had a leaking toilet pipe. Plumber arrived on time, worked in a tidy manner without leaving anything behind. Very polite and friendly, would definitely use again. Recommended.",
    "postcode": null,
    "date": "2019-03-01"
  },
  {
    "title": "Boiler service, power flush and two new radiators.",
    "text": "Steve was very friendly and approachable. He was polite and kept me informed of progress and problems along the way.",
    "postcode": null,
    "date": "2019-01-01"
  },
  {
    "title": "New combi boiler.",
    "text": "An excellent job, on time and to price.",
    "postcode": null,
    "date": "2019-01-01"
  },
  {
    "title": "Water leak traced and repaired.",
    "text": "Steve did an excellent job finding a leak underneath the floor of our utility room. We initially thought it was under the floor of our shower room and Steve had to trace it to its source. He was reassuring throughout and provided top notch service and quality of work. Highly recommended.",
    "postcode": null,
    "date": "2019-01-01"
  },
  {
    "title": "Power Flush of Heating System and New Pump.",
    "text": "Worked Hard all day from 9.00am to 6.00pm. Radiator system 35 years old at least. Corgi Home Plan engineer was unable to get Boiler working despite 2 visits. Told Corgi would not cover system if blockage was the cause. Colin did the work at short notice and phoned 4 days later to ensure all was well.",
    "postcode": null,
    "date": "2018-12-01"
  },
  {
    "title": "Serivce of boiler",
    "text": "Came to me promptly, and told me the expansion vessal was faulty, told me to check warrenty, maker came out and fixed at no charge. Then Steve came back and did a proper service at no extra charge a few days later. So EVO Dorking crew saved me a lot of money! Will definately use them going forward. Thanks guys for all your help.",
    "postcode": null,
    "date": "2018-12-01"
  },
  {
    "title": "Replaced 3 port valve on hot water system.",
    "text": "I was totally impressed with how Steve works. He quickly located the fault on our boiler after a series of complicated checks. He is methodical in his work and totally dedicated to fault finding. I would not hesitate to recommend Steve and his team for any heating and plumbing work you may have, he is trustworthy and very reliable.",
    "postcode": null,
    "date": "2018-11-01"
  },
  {
    "title": "Previous plumber 2 years ago fitted new combi boiler but left us with terrible 'water hammering', call to sort it",
    "text": "2nd visit following annual boiler service to sort out severe water hammering that over 2 years previous plumber had not managed to sort out. Steve on first visit made temporary adjustment to stop noise until he returned with parts today to make full adjustment - ecstatic a quiet house.",
    "postcode": null,
    "date": "2018-10-01"
  },
  {
    "title": "Power flushing",
    "text": "Excellent service from Steve. Courteous, punctual and professional. Highly recommended.",
    "postcode": null,
    "date": "2018-10-01"
  },
  {
    "title": "Replace existing boiler.",
    "text": "Neat and tidy work in a difficult position with a number of complications. All problems were resolved and we are very satisfied with the new boiler.",
    "postcode": null,
    "date": "2018-09-01"
  },
  {
    "title": "Replaced 2 port valve on hot water system primary circuit from boiler to cylinder.",
    "text": "Was impressed with how quickly Steve picked up on how our rather complicated CH/HW system works, and homed in on the problem. Job completed same day as diagnostic visit. Quite expensive but no complaints - you pay for quality.",
    "postcode": null,
    "date": "2018-08-01"
  },
  {
    "title": "Fix kitchen tap flow problem.",
    "text": "Quick and clean work.",
    "postcode": null,
    "date": "2018-06-01"
  },
  {
    "title": "Fault finding and remedy of thermostatic files (sensing files) as hot water was scalding.",
    "text": "Steve was very methodical in his approach testing all variables to eliminate options in finding the root cause of the problem. Second time I have used EVO and certainly a trusted service provider in my local area based on experience to date.",
    "postcode": null,
    "date": "2018-06-01"
  },
  {
    "title": "Shower, shower tray and fixed glass and towel rails etc.",
    "text": "Could not be more pleasant young men, all work perfectly executed.",
    "postcode": null,
    "date": "2018-06-01"
  },
  {
    "title": "Shower leak - resealed the shower unit.",
    "text": "Steve came on same day of call out. Neat and tidy worker - even put on a new shower hose for me. Will use again.",
    "postcode": null,
    "date": "2018-05-01"
  },
  {
    "title": "Gas safety check and boiler service.",
    "text": "We have used Steve on numerous occasions, he has also helped out in a crisis and his work has always been satisfactory. We have recommended him to others. We have found Steve to be a very helpful person.",
    "postcode": null,
    "date": "2018-05-01"
  },
  {
    "title": "Replace pump, replace 3 way valve, power wash heating system.",
    "text": "Very pleased with the work carried out. Both Steve and Harvey were very polite and professional in their approach to the job.",
    "postcode": null,
    "date": "2018-04-01"
  },
  {
    "title": "Fitted new Central Heating Programmer",
    "text": "Steve has attended on several occasions to repair different jobs at our property. Yesterday was no exception, Steve arrived promptly, worked very efficiently and when the job was completed, left everything neat and tidy. We have also had Steve's colleagues attend, if Steve has been snowed under. I wouldn't hesitate to recommend, Steve, Harvey or Colin. Many thanks!",
    "postcode": null,
    "date": "2018-04-01"
  },
  {
    "title": "Defrost and unblock boiler condensation pipe and restore boiler to full working order.",
    "text": "Our usual boiler service company were not able to attend for 5 days. I rang Steve and he was able to come round that evening (1.5 hours notice) Steve was extremely helpful and polite and gave us full confidence that he would be able to help restore the boiler function. The job was completed quickly and efficiently with tips on how to avoid a future problem. We would definitely recommend Steve and would happily use him again in the future.",
    "postcode": null,
    "date": "2018-03-01"
  },
  {
    "title": "Fixed a toilet leak x 2 and broken bath sink.",
    "text": "No comments given.",
    "postcode": null,
    "date": "2018-02-01"
  },
  {
    "title": "Traced and repaired a leaking central heating pipe.",
    "text": "Evo were asked at short notice (emergency leak - water coming through roof) to fix a problem. They responded quickly and fixed the problem on that day. Alongside that they ensured that they made good as much as possible e.G re-laid the carpet as they had to take floor boards up, ensured that no air pockets in central heating etc. Even came back quickly the following day when we identified a minor problem with air trapped in bathroom pipe. Recommended if you are looking for a professional plumber.",
    "postcode": null,
    "date": "2018-01-01"
  },
  {
    "title": "New Boiler fitted.",
    "text": "Steve diagnosed the problem with my old boiler. We discussed the options and he recommended I contact the manufacturer of my old boiler to see if it was possible to repair it. The manufacturer did not give me any hope that it would be possible to economically repair the old boiler, so I followed Steve's recommendation to replace it. Steve responded quickly to get the work done during the cold weather. The new boiler is much better. An excellent job.",
    "postcode": null,
    "date": "2018-01-01"
  },
  {
    "title": "Unblock drain, toilet.",
    "text": "Excellent friendly service.",
    "postcode": null,
    "date": "2018-01-01"
  },
  {
    "title": "Power flush to central heating system.",
    "text": "Steve and Harvey arrived promptly to Power Flush the Central Heating System, which hadn't been cleaned for over 25 years! Copious amounts of black sludge poured out of the system for several hours and was replaced with clean water, special additives were also added to clean the system. When the Central Heating was switched back on, it immediately began operating much more efficiently! My husband and I found when Steve and Harvey had finished, the whole house was left clean and tidy! Many thanks and well done to both, I shall definitely be contacting Steve in the future for any work needed.",
    "postcode": null,
    "date": "2018-01-01"
  },
  {
    "title": "Disconnect bath.",
    "text": "Very satisfied with work and courtesy.",
    "postcode": null,
    "date": "2017-12-01"
  },
  {
    "title": "Replace a tap",
    "text": "Excellent timekeeping, clean job, many thanks.",
    "postcode": null,
    "date": "2017-12-01"
  },
  {
    "title": "Repair of Central Heating System.",
    "text": "We called Evo Home Services, to see if they could help with a long standing problem with our central heating. Steve arrived promptly and gave my husband and I excellent and trustworthy advice on how to solve our problem and what to do next. We found Steve to be friendly and a very competent and tidy worker. A job very well done! Thank you Steve.",
    "postcode": null,
    "date": "2017-12-01"
  },
  {
    "title": "Twin flue leak from the seals, remove ceiling duct to expose flue run supply and install.",
    "text": "No comments given.",
    "postcode": null,
    "date": "2017-11-01"
  },
  {
    "title": "Boiler checking/ fault findings.",
    "text": "I went with Steve based on his reviews. He is an absolutely lovely guy, and he clearly knows his stuff. From the very start he returned my call promptly, and provided a clear quote for the work. He turned up on time, and gave an honest assessment of my boiler. He fixed the problem in the short term and gave me some options for work that would be beneficial in the longer term.  There was no pressure to spend any extra money, and Steve was completely upfront about and honest with his assessment of the boiler and plumbing. Fantastic stuff.",
    "postcode": null,
    "date": "2017-11-01"
  },
  {
    "title": "Not specified by customer.",
    "text": "Good level, no mess and polite service.",
    "postcode": null,
    "date": "2017-11-01"
  },
  {
    "title": "Boiler serviced and flue replaced.",
    "text": "Steve was originally asked to come do a simple boiler service. However it soon turned into anything but simple when a leak was discovered. With his experience and knowledge we came up with a 3 step plan. We ended up doing the first 2 steps as there were numerous issues with flue sizes which Steve solved and got everything done and fixed. He was very open about what needed doing and what the worse case scenario could be. It was I'm sure a nightmare job for him as he had to keep coming back and forth but he did it all in his stride with good humor.",
    "postcode": null,
    "date": "2017-11-01"
  },
  {
    "title": "Fitted new stoplock to indoor water supply pipe.",
    "text": "Very good, came when agreed and did a very satisfactory job.",
    "postcode": null,
    "date": "2017-11-01"
  },
  {
    "title": "Take out tiles to find source of leak, renewed all parts in toilet. Came back as very big leak instead small one.",
    "text": "Excellent.",
    "postcode": null,
    "date": "2017-11-01"
  },
  {
    "title": "New boiler installation and thermostat.",
    "text": "We have used Steve and Evo for several years now and as always the service was professional, friendly, and completed to a very high standard and on time.",
    "postcode": null,
    "date": "2017-10-01"
  },
  {
    "title": "Emergency plumbing leak.",
    "text": "So impressed with the service I received. It was an emergency call out as my insurance company had let me down with getting a plumber here. I was very upset but when Steve turned up he completed the necessary works and so grateful that he turned out on a Sunday. Thank you so much from a very, very happy customer. Will recommend you to anyone who needs a excellent plumber.",
    "postcode": null,
    "date": "2017-10-01"
  },
  {
    "title": "Replaced daunt washer 2 valves.",
    "text": "Excellent communication, fast service. Work completed and explained.",
    "postcode": null,
    "date": "2017-10-01"
  },
  {
    "title": "Unblock toilet.",
    "text": "No comments given.",
    "postcode": null,
    "date": "2017-09-01"
  },
  {
    "title": "Toilet repair.",
    "text": "Reliable and completed quickly. Great work-thank you!",
    "postcode": null,
    "date": "2017-09-01"
  },
  {
    "title": "New boiler fitted initially with a power flush of all radiators, plus service, plus gas safety test of existing cooker/mains supply.",
    "text": "What a breath of fresh air this experience was!. We brought a new property but found out the hard way that the boiler was shot. We selected Evo plumbing, heating and drainage to give us some guidance and a quote. We were very happy with the competitive quote. The engineer arrived every day on time and each day he worked a full day while keeping his work area very clean. Our engineer Mr S Morgan was extremely polite, professional and listened to what we said and was happy to answer any questions we had. He also helped us to choose the right product for us and did an exceptional job.",
    "postcode": null,
    "date": "2017-09-01"
  },
  {
    "title": "Boiler service.",
    "text": "Friendly, helpful and provided advice beyond what I` d expect.",
    "postcode": null,
    "date": "2017-09-01"
  },
  {
    "title": "Gas safety certificate and boiler service.",
    "text": "Work carried out efficiently and professionally. Steve both friendly and helpful, fully recommend.",
    "postcode": null,
    "date": "2017-08-01"
  },
  {
    "title": "Changed washer on tap in bathroom.",
    "text": "Came quickly as promised and finished the job as requested.",
    "postcode": null,
    "date": "2017-08-01"
  },
  {
    "title": "Dripping tap, toilet repair, push plug replacement, overflow on water tank.",
    "text": "Friendly, efficient, punctual, helpful service. Colin was very helpful and tidied up. Thank you.",
    "postcode": null,
    "date": "2017-08-01"
  },
  {
    "title": "Install Emersion heater.",
    "text": "Happy and contented.",
    "postcode": null,
    "date": "2017-07-01"
  },
  {
    "title": "Clean drains CCTV drain runs.",
    "text": "Very professional, polite, well organised and informative. Arrived on time and completed the job.",
    "postcode": null,
    "date": "2017-07-01"
  },
  {
    "title": "Fixed smell and investigated leak from kitchen. Found source and fixed it.",
    "text": "No comments given.",
    "postcode": null,
    "date": "2017-07-01"
  },
  {
    "title": "Replace toilet fill valve.",
    "text": "Very good service.",
    "postcode": null,
    "date": "2017-07-01"
  },
  {
    "title": "Repair washing machine leak.",
    "text": "Very punctual, polite and helpful service. Diagnosed problem quickly.",
    "postcode": null,
    "date": "2017-07-01"
  },
  {
    "title": "Installed new tap.",
    "text": "No comments given.",
    "postcode": null,
    "date": "2017-07-01"
  },
  {
    "title": "Replace toilet fill valve.",
    "text": "Excellent service, most attentive, very polite, will certainly use your company in the future.",
    "postcode": null,
    "date": "2017-07-01"
  },
  {
    "title": "New combine boiler/ flu, new radiators and piping.",
    "text": "Very polite, professional company who did what they said they would do on and on line.",
    "postcode": null,
    "date": "2017-07-01"
  },
  {
    "title": "Plumbing-in of washing machine.",
    "text": "The work was completed well although it was certainly not cheap. Have not yet received an invoice for the work.",
    "postcode": null,
    "date": "2017-06-01"
  },
  {
    "title": "Boiler service and new parts fitters.",
    "text": "Happy with work done.",
    "postcode": null,
    "date": "2017-06-01"
  },
  {
    "title": "Plumb in dishwasher, replace kitchen tap.",
    "text": "Very good, efficient and friendly.",
    "postcode": null,
    "date": "2017-06-01"
  },
  {
    "title": "Detect toilet leak and resolve.",
    "text": "Excellent service highly recommended.",
    "postcode": null,
    "date": "2017-06-01"
  },
  {
    "title": "Removed old boiler, radiators and water tanks. Installed new combi boiler, new radiators and towel rails.",
    "text": "Fantastic! Steve and co did an excellent job. Very happy with the result. Clean, tidy, professional and totally trustworthy. Steve worked very hard and finished the job a day early than expected. He kept me informed of everything and answered all of my questions very patiently. Respected my home and cleaned up very well. Steve is a true gentleman, always polite and courteous and his very extensive knowledge and technical skills inspired my confidence in him.",
    "postcode": null,
    "date": "2017-06-01"
  },
  {
    "title": "Replacement of kitchen tap.",
    "text": "On time, early. Done quickly and efficiently.",
    "postcode": null,
    "date": "2017-05-01"
  },
  {
    "title": "Blockage and leak in bathroom.",
    "text": "Prompt, efficient and very friendly.",
    "postcode": null,
    "date": "2017-05-01"
  },
  {
    "title": "Repair magaflow.",
    "text": "No comments given.",
    "postcode": null,
    "date": "2017-05-01"
  },
  {
    "title": "Replace valve. Boiler breakdown.",
    "text": "Smashing, excellent, clean, tidy and good looking.",
    "postcode": null,
    "date": "2017-05-01"
  },
  {
    "title": "Boiler breakdown.",
    "text": "No comments given.",
    "postcode": null,
    "date": "2017-05-01"
  },
  {
    "title": "Unblock pipe leading to main stack, once diagnosed",
    "text": "Very helpful, polite and efficient. Great service",
    "postcode": null,
    "date": "2017-05-01"
  },
  {
    "title": "Replaced flush system",
    "text": "Colin was brilliant",
    "postcode": null,
    "date": "2017-04-01"
  },
  {
    "title": "Leaking toilet.",
    "text": "Work done satisfactory, Colin very helpful and pleasant person.",
    "postcode": null,
    "date": "2017-04-01"
  },
  {
    "title": "Replace toilet fill valve.",
    "text": "Very good efficient service to replace toilet valve.",
    "postcode": null,
    "date": "2017-04-01"
  },
  {
    "title": "Not specified by customer.",
    "text": "No comments given.",
    "postcode": null,
    "date": "2017-04-01"
  },
  {
    "title": "Repair leak on tap.",
    "text": "Good work.",
    "postcode": null,
    "date": "2017-04-01"
  },
  {
    "title": "Repair leak.",
    "text": "Quick and good.",
    "postcode": null,
    "date": "2017-04-01"
  },
  {
    "title": "Remove and relocate radiators.",
    "text": "All works completed as agreed, on time and to agreed price! Thank you.",
    "postcode": null,
    "date": "2017-04-01"
  },
  {
    "title": "Repair leak in loft.",
    "text": "Very happy with the quick response.",
    "postcode": null,
    "date": "2017-04-01"
  },
  {
    "title": "Install radiator",
    "text": "Great work",
    "postcode": null,
    "date": "2017-04-01"
  },
  {
    "title": "Score Breakdown",
    "text": "This is not a true reflection of the job. I was at the address for three hours and only charged two. The customer was constantly asking me to angle grind the machine in half to remove from the cupboard, not a common practise to carry out in someone's home, this carries certain risks upon myself to do this, sparks flying around and chemicals from burning rubber inside the machine in an enclosed area. He knew this and didn’t consider my safety, it is not the correct way of uninstalling a dishwasher. The dishwasher unit was Incorrectly installed in the first place which he knew. He was helping all the way, which was useful, but this was his way of removing the unit quicker to save money! This review is totally fabricated and contradicts the card he had written out praising my work. He paid immediately and said he was happy, if he wasn’t he should have let us know and given us the chance to rectify any issues he may have felt he had. We are proud of our workmanship and would ask that you look at our website to see our high scores and positive comments from happy customers",
    "postcode": null,
    "date": "2017-04-01"
  },
  {
    "title": "Install gas cooker.",
    "text": "No comments given.",
    "postcode": null,
    "date": "2017-04-01"
  },
  {
    "title": "Install kitchen taps",
    "text": "No comments given.",
    "postcode": null,
    "date": "2017-04-01"
  },
  {
    "title": "Replacement pipe for d/w leak to radiator re sealing bath.",
    "text": "Work carried out quickly, efficiently and tidily.",
    "postcode": null,
    "date": "2017-03-01"
  },
  {
    "title": "Emergency fix",
    "text": "No comments given.",
    "postcode": null,
    "date": "2017-03-01"
  },
  {
    "title": "Gas safety check",
    "text": "No comments given.",
    "postcode": null,
    "date": "2017-03-01"
  },
  {
    "title": "Not specified by customer.",
    "text": "Very good service and friendly chap.",
    "postcode": null,
    "date": "2017-03-01"
  },
  {
    "title": "Supply and install fan for boiler and heater",
    "text": "Very pleased with the speed of the service and competency of the work done",
    "postcode": null,
    "date": "2017-03-01"
  },
  {
    "title": "Not specified by customer.",
    "text": "Very good service - he is punctual and reliable and I find that is well worth the money",
    "postcode": null,
    "date": "2017-03-01"
  },
  {
    "title": "Unblock upstairs toilet.",
    "text": "Colin was very clean and tidy and kept me informed. Very happy to recommend to friends. Brilliant service.",
    "postcode": null,
    "date": "2017-03-01"
  },
  {
    "title": "Annual service on boiler",
    "text": "Thorough and very professional.",
    "postcode": null,
    "date": "2017-03-01"
  },
  {
    "title": "Leak from washing machine.",
    "text": "Colin was here very quickly after my phone call and could not have been more helpful.",
    "postcode": null,
    "date": "2017-03-01"
  },
  {
    "title": "Repair toilet flush.",
    "text": "Extremely good.",
    "postcode": null,
    "date": "2017-02-01"
  },
  {
    "title": "Fitted new kitchen waste",
    "text": "Arrived as agreed and was very polite and efficient, had some difficulty fitting overflow on old sink, we had a slight leak afterwards, came immediately hen notified and fixed, superb!",
    "postcode": null,
    "date": "2017-02-01"
  },
  {
    "title": "Emergency plumbing leaking boiler",
    "text": "Excellent service",
    "postcode": null,
    "date": "2017-02-01"
  },
  {
    "title": "Repairs to remedy leaks in bathroom.",
    "text": "Colin arrived on time and fixed a leaking radiator, a shower head and a leaking tap. They are now operating correctly. I have found this company to be highly reliable.",
    "postcode": null,
    "date": "2017-02-01"
  },
  {
    "title": "Problem with overflowing soakaway.",
    "text": "So pleased that we called out your company to do this job. Harvey found the fault almost immediately and cleared the blockage. Will definitely recommend you to our friends/family.",
    "postcode": null,
    "date": "2017-02-01"
  },
  {
    "title": "Annual boiler maintenance check.",
    "text": "Annual boiler maintenance visit. Explained clearly actions conducted and completed. Will use Steve again for future work.",
    "postcode": null,
    "date": "2017-02-01"
  },
  {
    "title": "Replaced heating pump.",
    "text": "Colin the best professional guy for heating and plumbing service and was very keen to complete the task without any problem to home owner.",
    "postcode": null,
    "date": "2017-02-01"
  },
  {
    "title": "Replace fill valve and descale flush valve",
    "text": "Professional and reliable service.",
    "postcode": null,
    "date": "2017-02-01"
  },
  {
    "title": "Pump fixed and emergency radiator maintenance.",
    "text": "The guy is a lifesaver, my radiator sprung a leak and he came straight out as well as checked my pump as there appeared to be something wrong, no idea what it was but it was fixed. I recommend EVO Plumbing to anyone and everyone.",
    "postcode": null,
    "date": "2017-02-01"
  },
  {
    "title": "Power flush.",
    "text": "Quality service with no hidden extras. I highly recommend EVO for all your plumbing needs.",
    "postcode": null,
    "date": "2017-02-01"
  },
  {
    "title": "Replace toilet flush valve and components.",
    "text": "First class, speedy, efficient in very difficult conditions.",
    "postcode": null,
    "date": "2017-02-01"
  },
  {
    "title": "Clear drain.",
    "text": "Good, reliable, friendly.... not a tough job but well done.",
    "postcode": null,
    "date": "2017-01-01"
  },
  {
    "title": "Assessed broken boiler. Fitted new fan. Cleaned boiler.",
    "text": "Steve was excellent! Very approachable. Very knowledgeable. Clean and tidy worker.",
    "postcode": null,
    "date": "2016-12-01"
  },
  {
    "title": "Remove, repair and reinstall bathroom suite after I was left with an unsafe installation by another tradesman.",
    "text": "Steve has literally come to my rescue after is been left with an unsafe bathroom installation by another company, who really shouldn't be allowed to trade! He had to remove the toilet completely and build it up to the right height to flow away into the waste and installed it properly. He had to secure the bath, cut the side panel and fix properly to the bath and cut out all the mastic before re applying properly. He then remade the boxing in which had been left in an appalling state. He is the cleanest, tidiest workman I've come across and would recommend his services happily.",
    "postcode": null,
    "date": "2016-12-01"
  },
  {
    "title": "Parts of boiler replaced.",
    "text": "Brilliant service, it was a challenging job but Steve worked very efficiently and I really felt like he went that extra mile to get the parts he didn't have and complete the work as thoroughly as possible in a minimal time. He kept me informed the whole way through and allowed me to understand the process as well as provided safety advice. Very pleased.",
    "postcode": null,
    "date": "2016-11-01"
  },
  {
    "title": "Leak on PRV regarage expansion vessel.",
    "text": "Called at 10.00 out by 16.00 same day to fix leak on hot water cylinder, excellent service very polite.",
    "postcode": null,
    "date": "2016-11-01"
  },
  {
    "title": "Shower cubicle, walls, fittings refit.",
    "text": "Steve and Colin did an excellent job of restoring our leaking shower cubicle, including replacing the bathroom walls which were badly damaged by damp, We have used Steve/Evo Plumbing, Heating and Drainage for all our plumbing and heating jobs in our home. And Steve is always a joy to deal with, reliable, punctual, tidy and professional. We would highly recommend Evo Plumbing, Heating and Drainage.",
    "postcode": null,
    "date": "2016-11-01"
  },
  {
    "title": "Boiler repair.",
    "text": "I have used Steve on many occasions now because he is reliable, contactable and will always call back if a message is left for him. His work is to a high standard and he is always there when it really counts.",
    "postcode": null,
    "date": "2016-10-01"
  },
  {
    "title": "Fitted new boiler and pipes",
    "text": "Very good service also clean and tidy",
    "postcode": null,
    "date": "2016-10-01"
  },
  {
    "title": "Pipe repair and boiler switch",
    "text": "Excellent quality of work. Friendly service and very informative. Steve was great at keeping us up to date with everything that was happening throughout the works.",
    "postcode": null,
    "date": "2016-10-01"
  },
  {
    "title": "Boiler and gas fire serviced.",
    "text": "Steve serviced our boiler and noted it needed a new part. He came back a week later and fitted the part and serviced our gas fire as we requested. The boiler needed a good clean and maintenance and Steve did this with patience and care. Many thanks.",
    "postcode": null,
    "date": "2016-09-01"
  },
  {
    "title": "Gas safety check.",
    "text": "Steve did gas safety check. All went well, very friendly.",
    "postcode": null,
    "date": "2016-09-01"
  },
  {
    "title": "Power flush, replace 3-port valve, fit new basin tap.",
    "text": "Steve and Colin arrived on time, immediately laid down dust sheets, were courteous throughout and kept us informed of progress. Went the extra mile to thoroughly flush our system which had built up sludge over many years, and carefully checked all aspects of their work and tidied up before departure. Also in passing found a problem with our cold water tank which they rectified at no extra cost. Based on my experience, I would recommend Evo Home Services without hesitation.",
    "postcode": null,
    "date": "2016-09-01"
  },
  {
    "title": "Boiler service",
    "text": "Good, reliable friendly service",
    "postcode": null,
    "date": "2016-08-01"
  },
  {
    "title": "New bath and radiator, power flush, boiler service and other maintenance work",
    "text": "I am very happy with the work done by Steve and team. It was not easy fiddling with the old bathroom, but they have done a good job and they charged me exactly as quoted even though it was more complicated than they anticipated. They were very polite and Steve also gave me valuable recommendations.  There was a small leak in one of the pipe joints after their work, but Steve responded very fast and fixed it within hours after I told him. I will surely go to Steve for future work as well.",
    "postcode": null,
    "date": "2016-08-01"
  },
  {
    "title": "New stainless steel sink put in plus new piping.",
    "text": "Excellent service, Steve was very friendly and explained what he was doing. Searched around Horsham for the correct size sink, as our previous one was over 20 years old and was in a not nice state, including the piping. Will definitely use him again.",
    "postcode": null,
    "date": "2016-08-01"
  },
  {
    "title": "Fixed a leak from the upstairs bathroom to downstairs ceiling.",
    "text": "Steve was brilliant and really helpful. Will definitely be keeping his number for any further plumbing issues and will be recommending to my friends and family.",
    "postcode": null,
    "date": "2016-08-01"
  },
  {
    "title": "Replaced honeywell three way valve.",
    "text": "Excellent in all aspects, would recommend.",
    "postcode": null,
    "date": "2016-08-01"
  },
  {
    "title": "Reconnected gas to boiler after another company disconnected supply in error.",
    "text": "Steve was brilliant! An inspection company wrongly determined that our flue was incorrectly installed and disconnected our gas to the boiler. Steve verified with the manufacturer that the install was as per regulation and reconnected us on the same day. Great, honest and good service.",
    "postcode": null,
    "date": "2016-07-01"
  },
  {
    "title": "Replaced the innards of my cloakroom cistern.",
    "text": "Contacted at short notice and was able to fit me in at short notice. Was delayed by a previous job but kept me informed throughout. When it became apparent that a further issue needed attention worked late until the job was completed. Very, very grateful as my wife runs a child minding business from home and a functional downstairs toilet is essential! Would recommend without hesitation.",
    "postcode": null,
    "date": "2016-07-01"
  },
  {
    "title": "New shower valve fitted and repair to water tank in loft.",
    "text": "Very pleased with Steve arrived on time and spent virtually all day working to solve our problem. Polite and efficient, good tidy work, highly recommended.",
    "postcode": null,
    "date": "2016-07-01"
  },
  {
    "title": "New toilet cistern installed.",
    "text": "Can highly recommend this tradesman for his patience, understanding, courtesy, excellent response time and pleasant manner. He was able to diagnose the problem by knowledgeable questioning and within five minutes of my call had arranged for his partner to attend the problem which was repaired within the hour.",
    "postcode": null,
    "date": "2016-07-01"
  },
  {
    "title": "New boiler.",
    "text": "Steve was polite and friendly. He was conscious of keeping the house as tidy as possible, and did a good job in doing so. He explained clearly the work which needed doing, and how much this would cost at the start. Really pleased with the new boiler. Would highly recommend.",
    "postcode": null,
    "date": "2016-06-01"
  },
  {
    "title": "Boiler and gas fire serviced.",
    "text": "Work was completed quickly and tidily. Steve was happy to discuss the state of our boiler and make recommendations for the future without any pressure for us to replace it, despite its age.",
    "postcode": null,
    "date": "2016-06-01"
  },
  {
    "title": "Changed fan in boiler.",
    "text": "Brilliant service responded very quickly and a very nice bloke I highly recommend.",
    "postcode": null,
    "date": "2016-06-01"
  },
  {
    "title": "Replaced a broken handle and valve.",
    "text": "Steve was great! He was always very polite and courteous even in his emails.  I ended up messing him around a bit when I thought I'd fixed the problem, only to have to phone him up again a couple of days later because it had broken again, and he was very nice about it, he didn't even bat an eyelid. He was friendly, very quick and very reasonably priced. Would definitely use again.",
    "postcode": null,
    "date": "2016-06-01"
  },
  {
    "title": "New shower pump and valve fitted.",
    "text": "Lovely guy. Very friendly and helpful. Kept me informed all through the processes. Price as quoted. Would definitely use again and recommend to others.",
    "postcode": null,
    "date": "2016-05-01"
  },
  {
    "title": "New boiler fitted",
    "text": "Needed a new boiler as quickly as possible as we had had no hot water or heating for 7 days and original plumber let us down big time. Spoke to Steve late Wednesday afternoon and he started the work 3 working days later. Very pleased with his timekeeping, efficiency ,knowledge and skill. He kept us informed throughout the 2 days as to what to expect. Finished the job at 7.30pm and he was happy to spend another 30 mins explaining and showing us how the boiler works. We have no hesitation in recommending him and will most certainly use him again in the future.",
    "postcode": null,
    "date": "2016-05-01"
  },
  {
    "title": "New pump fitted, gate valve and primary circuit board changed on boiler.",
    "text": "Steve has carried out a few jobs with out water and boiler system. Very professional; he helped explain the options for repair rather than pushing any sale. Would definitely call Steve again.",
    "postcode": null,
    "date": "2016-05-01"
  },
  {
    "title": "Power flush.",
    "text": "Steve arrived on time and was very respectful to take off his shoes to keep our house clean. He put dust sheets down and kept any unavoidable mess to a minimum. He went above and beyond his work to make sure we were completely happy. He was with us for nearly 10 hours in total and even stayed on to ensure all was working well before he left. The price was very reasonable and we are very happy with the service we received. Highly recommend and will not hesitate to use again.",
    "postcode": null,
    "date": "2016-05-01"
  },
  {
    "title": "Repaired the combi boiler.",
    "text": "Replied to my initial phone call quickly. Came out to see the boiler promptly. He explained what was needed and gave me a price. He completed the job quickly and got the boiler working. He was friendly, tidy and informative. A good find.",
    "postcode": null,
    "date": "2016-04-01"
  },
  {
    "title": "Clearance of drainage, investigation of macerator.",
    "text": "First Call Repair did exactly \"what it said on the tin\". We had a drainage problem specifically with the loo! We had phoned several plumbers and most didn't call back. A couple that did, once they heard the problem may involve the macerator, made no further contact.  These guys, Steve and Harvey, responded immediately. They came round asap, evaluated the problem and took immediate action. They kept us informed throughout via text-time/date/arrival etc. We would highly recommend them in future.",
    "postcode": null,
    "date": "2016-04-01"
  },
  {
    "title": "REPLACED BROKEN CISTERN WORKINGS - FLUSH NOT WORKING",
    "text": "Steve was the only plumber to return my call or email, he was unable to do straight away, though he answered my call straight away (hence 4 days from call to finish). He kept me promptly informed of timing and progress. The job wasn't straight forward due to difficulty with parts (two visits) but now finished my flush is better than it originally was, so very pleased.",
    "postcode": null,
    "date": "2016-04-01"
  },
  {
    "title": "Leak in ceiling from en suite toilet.",
    "text": "Steve was extremely helpful, even. Giving advise on other plumbing matters. Would thoroughly recommend and will call again with any other plumbing needs.",
    "postcode": null,
    "date": "2016-03-01"
  },
  {
    "title": "Repaired broken boiler.",
    "text": "Excellent work. Repaired the boiler and explained the problem in a clear and understandable way.",
    "postcode": null,
    "date": "2016-04-01"
  },
  {
    "title": "Leak behind system.",
    "text": "The service was efficient + polite.",
    "postcode": null,
    "date": "2016-03-01"
  },
  {
    "title": "Replace immersion heater and control box",
    "text": "I would recommend this company.",
    "postcode": null,
    "date": "2016-03-01"
  },
  {
    "title": "New boiler installed",
    "text": "Fantastic service, very friendly , recommend.",
    "postcode": null,
    "date": "2016-03-01"
  },
  {
    "title": "Valve fitted to hot water system.",
    "text": "Polite, timely, very pleasant manner. Excellent job done without any fuss or mess and price exactly as quoted, what else can you ask for?",
    "postcode": null,
    "date": "2016-03-01"
  },
  {
    "title": "Repair of boiler.",
    "text": "Quick and helpful. Cleaned up after themselves. Would use them again!",
    "postcode": null,
    "date": "2016-03-01"
  },
  {
    "title": "Replacement of leaking thermostat valve on radiator.",
    "text": "Absolutely delighted with efficiency and work done.",
    "postcode": null,
    "date": "2016-03-01"
  },
  {
    "title": "Boiler service (central heating) and fault identification.",
    "text": "A very helpful and knowledgeable boiler engineer. Service carried out quickly and efficiently. Possible fault identified.",
    "postcode": null,
    "date": "2016-03-01"
  },
  {
    "title": "Supply and install new combi boiler.",
    "text": "Excellent job, very polite, efficient, friendly. Quality of workmanship was first class, even provided us with added value by including a remote control thermostat. Thank you.",
    "postcode": null,
    "date": "2016-03-01"
  },
  {
    "title": "Repair to leak from valve on pipe in loft.",
    "text": "Very polite and efficient offered explanation on the work required.",
    "postcode": null,
    "date": "2016-03-01"
  },
  {
    "title": "Boiler service.",
    "text": "I am delighted to have found Steve. He was polite, helpful, efficient. Very reasonable charge for difficult service. I would recommend him to anyone.",
    "postcode": null,
    "date": "2016-02-01"
  },
  {
    "title": "Fitted washing machine.",
    "text": "First class tradesman, first class job.",
    "postcode": null,
    "date": "2016-02-01"
  },
  {
    "title": "Boiler service supplied and installed kitchen taps.",
    "text": "Always very pleased with the work Steve carries out for me. Prompt, reliable and very friendly. Would highly recommend them.",
    "postcode": null,
    "date": "2016-02-01"
  },
  {
    "title": "Leak repair.",
    "text": "Very good service.",
    "postcode": null,
    "date": "2016-02-01"
  },
  {
    "title": "Remove faulty toilet valve and put new valve in.",
    "text": "Responded to my phone call, made effort to keep time stated. Clean, efficient, friendly and courteous. Other plumbers I phoned didn't even respond.",
    "postcode": null,
    "date": "2016-02-01"
  },
  {
    "title": "New sink vanity unit fitted in down stairs cloak room.",
    "text": "Good workmanship, polite and helpful. Asked him to do work as pleased with previous job.",
    "postcode": null,
    "date": "2016-01-01"
  },
  {
    "title": "Run a new gas line into the house.",
    "text": "Excellent, quick service provided. Quick to come and assess, started the work an hour later. Very happy with 1st Call Repair Ltd.",
    "postcode": null,
    "date": "2016-01-01"
  },
  {
    "title": "Repair leaky toilet.",
    "text": "Had difficulty getting any plumber to come out so relieved to have such prompt service. Did a good job despite difficulties.",
    "postcode": null,
    "date": "2016-01-01"
  },
  {
    "title": "Hot water running cold.",
    "text": "Great customer service. Went above what was required of the job. Would definitely use again.",
    "postcode": null,
    "date": "2016-01-01"
  },
  {
    "title": "Replace taps.",
    "text": "Kept updates with progress and left bathrooms very clean.",
    "postcode": null,
    "date": "2016-01-01"
  },
  {
    "title": "Replaced our boiler 12 months ago and serviced the boiler this year.",
    "text": "We first called Steve over when we had a gas leak in a home we had just moved into. He came over promptly, checked the house thoroughly, found and fixed the leak. Our boiler then broke down about a month later and again Steve gave us good advice on our options and when we decided to get the new one installed he did a great job. A year later we have just had Steve round to service the boiler and all was well. I would be happy to recommend Steve to anyone on the basis of his service to us.",
    "postcode": null,
    "date": "2016-01-01"
  },
  {
    "title": "Boiler and gas fire. Annual service.",
    "text": "Prompt and courteous. As last year.",
    "postcode": null,
    "date": "2016-01-01"
  },
  {
    "title": "Repair to boiler and service.",
    "text": "Very good service, on time, polite and very professional, excellent results.",
    "postcode": null,
    "date": "2016-01-01"
  },
  {
    "title": "Replaced pump for central heating.",
    "text": "Very efficient, stuck to quoted price, and to top it all a great guy!",
    "postcode": null,
    "date": "2015-11-01"
  },
  {
    "title": "Boiler repair.",
    "text": "I am very happy with all aspects of the service and would happily recommend.",
    "postcode": null,
    "date": "2015-09-01"
  },
  {
    "title": "Installation of new gas cooker and removal of old one.",
    "text": "Very high recommendation, excellent work and service.",
    "postcode": null,
    "date": "2015-09-01"
  },
  {
    "title": "Fitted new top in office kitchen.",
    "text": "Steve responded quickly to my initial call, did the job and told plumber related joke. Good work.",
    "postcode": null,
    "date": "2015-09-01"
  },
  {
    "title": "Fitted new boiler.",
    "text": "We called out Steve to repair our boiler knowing it would need replacing soon. We were given a quotation for a new boiler and following a number of calls from Steve as he offered us a speedy replacement the work commenced when he said it would and was completed on time as well. Steve was careful to ensure that we knew what he was doing and were aware of his progress. The final bill match the quotation and Steve was careful to clear and clean everything and to ensure we understood on new installation.",
    "postcode": null,
    "date": "2015-08-01"
  },
  {
    "title": "New boiler fitted.",
    "text": "Highly recommend this company - all work was completed to an excellent standard, very thorough and a pleasure dealing with such a courteous professional company.",
    "postcode": null,
    "date": "2015-08-01"
  },
  {
    "title": "Re-positioned gas pipe.",
    "text": "No comments given.",
    "postcode": null,
    "date": "2015-08-01"
  },
  {
    "title": "Repair to bath seal which was leaking.",
    "text": "Fast response and efficient service to rectify fault to bath and radiator (leaking).",
    "postcode": null,
    "date": "2015-08-01"
  },
  {
    "title": "Fitted new boiler.",
    "text": "Did what it said on his tin, plus was kind and considerate to my elderly mother in whose house the work was being done.",
    "postcode": null,
    "date": "2015-08-01"
  },
  {
    "title": "Fixing hot water issue.",
    "text": "Steve was very efficient and kept us up-to-date with the work and costs. We would definitely recommend Steve to anyone.",
    "postcode": null,
    "date": "2015-08-01"
  },
  {
    "title": "Fixing a leak in the bathroom.",
    "text": "Excellent - very prompt response, service completed swiftly and with minimal cost. Very pleased.",
    "postcode": null,
    "date": "2015-08-01"
  },
  {
    "title": "New gas piping to hob.",
    "text": "Steve has completed the job as requested and at short notice so I was delighted with his service. A very pleasant and helpful guy to deal with.",
    "postcode": "Kent",
    "date": "2015-08-01"
  },
  {
    "title": "Fixed a leaking toilet",
    "text": "Prompt service.",
    "postcode": null,
    "date": "2015-08-01"
  },
  {
    "title": "Fixed a leaking toilet.",
    "text": "Prompt service.",
    "postcode": null,
    "date": "2015-08-01"
  },
  {
    "title": "Fixed leaking toilet.",
    "text": "Steve was very excellent from start to finish. Called him 8:30 Monday morning and the work was done by 16:00 Monday afternoon.",
    "postcode": null,
    "date": "2015-08-01"
  },
  {
    "title": "Replaced taps and toilet siphon.",
    "text": "Excellent service, which was completed quickly and efficiently.",
    "postcode": null,
    "date": "2015-08-01"
  },
  {
    "title": "Toilet leak fixed.",
    "text": "Arrived same day as called. Very helpful, problem fixed and issue clearly explained.",
    "postcode": null,
    "date": "2015-08-01"
  },
  {
    "title": "Gas cooker installation",
    "text": "Very friendly and tidy job. Checked everything thoroughly before he left! Very pleased would highly recommend.",
    "postcode": null,
    "date": "2015-07-01"
  },
  {
    "title": "Boxing of bathroom piping after doing trace/repair job",
    "text": "Steve did another great job after coming back to fix everything that was taken out to do the trace/repair of a particularly tough leak. In short, Steve managed to succeed where 2 other plumbers had failed! The boxed in area looks great, came in at the right price and was done professionally. Steve went absolutely above and beyond the call of duty (again!) and managed to complete the job beyond satisfaction; absolutely recommended for complete customer focus, utter reliability and top quality of work. Do not hesitate to give this man a call if you have an emergency!",
    "postcode": null,
    "date": "2015-07-01"
  },
  {
    "title": "Broken boiler and service.",
    "text": "Steve didn't waste anytime and got on with the job. He is reasonable and would use him again.",
    "postcode": null,
    "date": "2015-07-01"
  },
  {
    "title": "Tap.",
    "text": "Excellent, swift, polite, efficient and friendly.",
    "postcode": null,
    "date": "2015-07-01"
  },
  {
    "title": "Replace valve and new pipe work in airing cupboard.",
    "text": "Excellent service. I am very pleased with the finished work and the efficiency to which it was carried out.",
    "postcode": null,
    "date": "2015-07-01"
  },
  {
    "title": "Emergency call out to repair a damaged joint between toilet and cistern",
    "text": "He arrived just over an hour after our call. He quickly assessed the problem and looked to see if he could make a quick and easy repair. He quoted a price for the works necessary and this quote was not exceeded. He repaired the problem on the same day and he also used a wet vac to dry out the saturated carpet for which he made no additional charge. At all times he was professional, courteous and kept us informed as to what was going on. As the call was made to an elderly person who used a zimmer frame we were very impressed by his calm and caring approach.",
    "postcode": null,
    "date": "2015-07-01"
  },
  {
    "title": "Serviced boiler.",
    "text": "Very happy with the service. Good price friendly, tidy man. Will use him again.",
    "postcode": null,
    "date": "2015-06-01"
  },
  {
    "title": "Beret pipe",
    "text": "Happy with service.",
    "postcode": null,
    "date": "2015-06-01"
  },
  {
    "title": "Reconnect power shower to supply.",
    "text": "Perfect.",
    "postcode": null,
    "date": "2015-06-01"
  },
  {
    "title": "New gas main",
    "text": "Gas leak in the bungalow, new supply fitted. To all services. Boiler and heating survey done.",
    "postcode": null,
    "date": "2015-06-01"
  },
  {
    "title": "Re-connect cold mains.",
    "text": "Very informative and honest.",
    "postcode": null,
    "date": "2015-06-01"
  },
  {
    "title": "Hot water not working.",
    "text": "Came the same day and stayed late to finish fixing the problem. Kept informed exactly what needed to be done and was polite and conscientious. Highly recommended.",
    "postcode": null,
    "date": "2015-06-01"
  },
  {
    "title": "Emergency leak",
    "text": "Prompt service, job well completed, very happy.",
    "postcode": null,
    "date": "2015-06-01"
  },
  {
    "title": "Water heaters not working.",
    "text": "Excellent service. Would highly recommend and would certainly use again.",
    "postcode": null,
    "date": "2015-06-01"
  },
  {
    "title": "Faulty tap replaced.",
    "text": "Excellent service. Repair done avoiding complete replacement of tap mixer.",
    "postcode": null,
    "date": "2015-06-01"
  },
  {
    "title": "Fixing of leaking bath pipes, new taps and hand shower.",
    "text": "Extremely pleased with the work carried out. Steve is a super guy. I will definitely use him again and recommend him to others.",
    "postcode": null,
    "date": "2015-06-01"
  },
  {
    "title": "This guy was brilliant, he fixed my water cylinder.",
    "text": "Repair on my cylinder.",
    "postcode": null,
    "date": "2015-06-01"
  },
  {
    "title": "Put in new pump for hot water supply.",
    "text": "Really helpful and informative.",
    "postcode": null,
    "date": "2015-06-01"
  },
  {
    "title": "Boiler repair",
    "text": "Great service.",
    "postcode": null,
    "date": "2015-06-01"
  },
  {
    "title": "Bathroom leakage fixed washing machine trap replaced.",
    "text": "Excellent service, above and beyond the call of duty. Thanks for a job well done.",
    "postcode": null,
    "date": "2015-06-01"
  },
  {
    "title": "Work description not specified",
    "text": "Happy with the service. Prompt action.",
    "postcode": null,
    "date": "2015-06-01"
  },
  {
    "title": "Boiler serviced",
    "text": "Excellent.",
    "postcode": null,
    "date": "2015-06-01"
  },
  {
    "title": "Fitted new heating pump in airing cupboard.",
    "text": "Steve was able to attend quickly to our call and took no time at all in locating and fixing the problem.",
    "postcode": null,
    "date": "2015-06-01"
  },
  {
    "title": "Trace and repair electrical fault on boiler.",
    "text": "Having tried to get in touch with various other engineers for over a week - none of which bothered to return my calls, I finally tried Steve. He answered the phone immediately and told me he could attend the same day! He arrived punctually and resolved a boiler problem at my mothers property that same afternoon! He was totally clear about the price for his attendance and the price for repair work was advised and agreed before he started work. His communication, attitude and helpfulness was totally professional throughout. He will be top of my contact list in the future. Highly recommended.",
    "postcode": null,
    "date": "2015-06-01"
  },
  {
    "title": "Repaired leaking toilet cistern.",
    "text": "Steve was able to quickly ascertain what the problem was and fix it. He explained exactly what had happened and what he was doing about it.",
    "postcode": null,
    "date": "2015-03-01"
  },
  {
    "title": "System boiler restarted, walkthrough of heating system, checked radiators and performed service.",
    "text": "Very efficient, polite and took time to really explain the system with practical hints and tips for the future.",
    "postcode": null,
    "date": "2015-02-01"
  },
  {
    "title": "Installing a new programmer for the boiler.",
    "text": "Steve returned my call, he came out straight away, replaced the programming unit, and got my boiler working in next to no time. Really impressed with his fast, friendly and efficient manner, and the work done!",
    "postcode": null,
    "date": "2015-02-01"
  },
  {
    "title": "Soil pipe cleared after blockage",
    "text": "Prompt service, fair price. Would recommend 1st Call.",
    "postcode": null,
    "date": "2014-12-01"
  },
  {
    "title": "Supply and install boiler expansion vessel to new filling loop.",
    "text": "I would recommend this company.",
    "postcode": null,
    "date": "2014-12-01"
  },
  {
    "title": "Repaired leak on dishwasher connector.",
    "text": "Excellent. Steve identified the problem immediately, fixed it and explained how I could fix it myself in future. As he had finished so quickly, he gave our boiler the once over, gave some advice on it and checked our shower pump and he said if the problem re-ocurred, he sort it out at no additional cost.",
    "postcode": null,
    "date": "2014-12-01"
  },
  {
    "title": "Boiler repair.",
    "text": "Everything fantastic.",
    "postcode": null,
    "date": "2014-12-01"
  },
  {
    "title": "Water leak repair.",
    "text": "Efficient and timely.",
    "postcode": null,
    "date": "2014-12-01"
  },
  {
    "title": "Supply and install R F room stat.",
    "text": "From the first call he was very professional, he was very honest.",
    "postcode": null,
    "date": "2014-11-01"
  },
  {
    "title": "Call out for boiler breakdown.",
    "text": "Called Steve to look at a faulty boiler. There was on call out charge. I am happy to say but paid his minimum working charge and this was more than fair. After all he has to live.",
    "postcode": null,
    "date": "2014-11-01"
  },
  {
    "title": "Boiler breakdown.",
    "text": "I understood the price before Steve came out, he was more than fair. And to fix my boiler on the spot was nothing but outstanding.",
    "postcode": null,
    "date": "2014-11-01"
  },
  {
    "title": "Boiler repair.",
    "text": "Really helpful, nothing is too much trouble, had to return a few times to sort out a few teething problems with our boiler but persevered until it was up and running. Would highly recommend.",
    "postcode": null,
    "date": "2014-11-01"
  },
  {
    "title": "Service gas fire and check flu.",
    "text": "Steve called as arranged and went about his job in a very pleasant way.",
    "postcode": null,
    "date": "2014-11-01"
  },
  {
    "title": "Gas central heating boiler repair.",
    "text": "Steve Morgan did a great job - he's polite professional and cares about his work. There are a lot of plumbers around the Horsham area but I will stick with 1st Call Repair. Thank you Steve.",
    "postcode": null,
    "date": "2014-11-01"
  },
  {
    "title": "Call out for boiler breakdown",
    "text": "Called out Steve to look at faulty boiler. I explained that it was leaking water and had tripped the switch in the consumer unit. Steve said that he would visit within the next couple of hours and would not charge a call out fee but would charge a working charge to cover the time it will take him to find the fault. Steve took the front of the boiler off took one look at it and told me I needed a new one and then still charged me the working charge. Very disappointed!!! He did spend a few minutes to quote for new boiler but quotes tend to be completed free.",
    "postcode": null,
    "date": "2014-11-01"
  },
  {
    "title": "Repair toilet flush.",
    "text": "Efficient service, happy to recommend.",
    "postcode": null,
    "date": "2014-10-01"
  },
  {
    "title": "Fixed boiler.",
    "text": "Our boiler broke and we called several companies who were very unhelpful, not being able to help for weeks. Spoke to Steve and he came on the same day and fixed the boiler the following day. He was brilliant and honest. Would recommend him to anyone.",
    "postcode": null,
    "date": "2014-10-01"
  },
  {
    "title": "Repair to boiler.",
    "text": "This was a complicated task due to considerable building works going on around the house. Steve was up front from the start with regards costs and even though it ended up taking a lot longer than he had initially expected as it involved replacing more than one faulty component he did not charge us for the extra time. I would thoroughly recommend him and would certainly use him again.",
    "postcode": null,
    "date": "2014-10-01"
  },
  {
    "title": "New boiler and a new radiator fitted.",
    "text": "Steve was very professional, courteous and friendly. Took the trouble to explain what type of boiler was needed and why. Time keeping and tidiness was excellent. No hidden costs. Have no hesitation in recommending him.",
    "postcode": null,
    "date": "2014-09-01"
  },
  {
    "title": "Boiler repair.",
    "text": "I had a leak from my boiler outside Steve came round the same day and fixed the leak. He then returned to service my boiler and discovered my flue needed replacing. He ordered the part and returned the same week to fit it. Quick prompt service and kept me informed throughout the procedure.",
    "postcode": null,
    "date": "2014-07-01"
  },
  {
    "title": "2 parts on the combi boiler needed replacing.",
    "text": "Steve was very polite and gave good explanations of what he had done or needed to do. He was on time or phoned to say he would be a little lait.",
    "postcode": null,
    "date": "2014-06-01"
  },
  {
    "title": "Boiler replacement.",
    "text": "Excellent response to call. Excellent non social working, hours willingness. Excellent quality work.",
    "postcode": null,
    "date": "2014-03-01"
  },
  {
    "title": "Replaced boiler.",
    "text": "Great job done! Steve replaced our old boiler, did it thoroughly and kept it all tidy. He was also mindful of the fact that we have small children in the house. Would highly recommend him.",
    "postcode": null,
    "date": "2014-04-01"
  },
  {
    "title": "Annual boiler service.",
    "text": "Have used Steve's services before and as usual he was thorough, courteous and professional. Highly recommended.",
    "postcode": null,
    "date": "2014-03-01"
  },
  {
    "title": "Boiler service.",
    "text": "Steve completed a service on a boiler that he'd originally installed. As well as completing the standard emissions and operational checks he reviewed and cleaned a magnetic filter that we have installed. He also helped to review and provide feedback against a quotation we'd received for a replacement boiler in another property that we own; this was really helpful and outside of the remit of the work that we'd called on him to complete.",
    "postcode": null,
    "date": "2014-03-01"
  },
  {
    "title": "Boiler failure.",
    "text": "Steve was very reliable and courteous. Came on the day he said he would and fixed the problem quickly. I highly recommend him.",
    "postcode": null,
    "date": "2014-03-01"
  },
  {
    "title": "TPR replaced on megaflo and annual boiler service.",
    "text": "Steve was knowledgeable, professional and reliable. I would strongly recommend him.",
    "postcode": null,
    "date": "2014-02-01"
  },
  {
    "title": "Located a leak under a tiled bathroom floor.",
    "text": "Highly recommended. Turned up exactly when he said he would. Kept working until the job was complete (23.45). Very satisfied customer. Would definitely use again (but hope I don't have to!).",
    "postcode": null,
    "date": "2013-11-01"
  },
  {
    "title": "New Worcester boiler with pipework.",
    "text": "In the pursuit of excellence this young man is a rarity. Nothing is too much trouble to leave everything in order. Courteous and hardworking.",
    "postcode": null,
    "date": "2013-11-01"
  },
  {
    "title": "Boiler repair and service.",
    "text": "Woke up to the boiler not firing up last Saturday. Gave Steve a ring, as we'd used him before and been impressed with his work. He was able to come round that morning, asses the problem, source parts and fix (including servicing the boiler) before lunch! We have always found Steve to be very reliable, helpful and focused on doing a good job in a customer focused manner. Would thoroughly recommend.",
    "postcode": null,
    "date": "2013-11-01"
  },
  {
    "title": "Disconnect and remove gas hob. Refit and reconnect after kitchen refurbishment.",
    "text": "Every aspect of the work was carried out efficiently and professionally. Steve was always courteous and took time to explain what was happening and give advice as required. I would not hesitate to use this company again in the future.",
    "postcode": null,
    "date": "2013-11-01"
  },
  {
    "title": "Repair boiler.",
    "text": "Very happy with the work Steve did. He also checked that the heating was fully functional and safe before he left and also provided advice.",
    "postcode": null,
    "date": "2013-11-01"
  },
  {
    "title": "Supply two motorised valves, adjust pipework, replace fan, rewire and service boiler.",
    "text": "Steve very quickly came to a diagnosis of the problem and once the job was started worked extremely efficiently to completion without cutting any corners or taking short cuts. Was polite and cheerful throughout and the finished result was of a good quality standard. I would have no hesitation in recommending his services to others!",
    "postcode": null,
    "date": "2013-11-01"
  },
  {
    "title": "Called to check failed central heating.",
    "text": "Steve quickly identified the problem and replaced the faulty valve. He was very courteous and helpful. Made sure everything was working perfectly before he left. I have since had to call him for an unrelated repair and received the same excellent service. Will definitely use him again. Have no hesitation recommending him.",
    "postcode": null,
    "date": "2013-11-01"
  },
  {
    "title": "Replaced boiler gas valve.",
    "text": "Steve was very willing to work on my 25 year old boiler. He showed an excellent level of competence and was able to carry out the work in a timely fashion. I had obtained the obsolete part for him to fit. He carefully examined the item before fitting to ensure its worthiness for purpose.",
    "postcode": null,
    "date": "2013-10-01"
  },
  {
    "title": "Call out to inspect failed boiler.",
    "text": "Steve was very good! I came home to find boiler was broken, called Steve out to look to check. Turns out boiler was still in guarantee and Steve went above and beyond to get it sorted. Got the company to fix it but Steve could have just tried to take the job on himself. If I need anything else I am sure to use him again.",
    "postcode": null,
    "date": "2013-10-01"
  },
  {
    "title": "Power flushing.",
    "text": "Very conscientious and passionate about his work. Provides explanation as to what the issue is and how the work required reflects on cost. Ensures that work carried out is complete and well done even if it means coming back to make add' l adjustments. Great work. Would not hesitate to use Steve again.",
    "postcode": null,
    "date": "2013-06-01"
  },
  {
    "title": "Toilet cistern and overflow repair",
    "text": "I contacted Steve just before 5pm and he was at the property within 90 minutes as he had promised. The toilet was fixed very quickly and everything back to normal. Very courteous and prompt service will definitely use again.",
    "postcode": null,
    "date": "2013-06-01"
  },
  {
    "title": "Boiler repair and replacement fan.",
    "text": "Really efficient, came out on a bank holiday Monday to assess the situation, knew what was wrong immediately and returned central heating and hot water to me 2 days later! Very pleased with the service over bank holiday weekend (especially as British gas would take 7 days and power didn't come out at all!) thank you!",
    "postcode": null,
    "date": "2013-04-01"
  },
  {
    "title": "Central heating boiler locked out, locate cause and rectify if possible.",
    "text": "Boiler locked out Sunday morning. I started to contact heating engineers to try and arrange for the necessary work. Despite being Sunday, Steve Morgan agreed to visit later that day, after he had dealt with some other work already in hand. He arrived around 5 pm, as agreed and checked the various components of the boiler and central heating system. Almost immediately he decided that the problem was not sludge and examined various components, identifying the pump as the likely cause. By then, the previously agreed time and quoted cost had been reached, but Steve was determined to carry on and dismantle the pump, to confirm his diagnosis and attempt to restore the boiler to working condition. Having dismantled the pump, he did find that it was seized and managed to free it by lubricating the spindle. Having reinstalled the pump and restarted the boiler, all went well and the system is still running smoothly the following day. In identifying and rectifying the fault, Steve spent approximately twice the time originally allocated, without any additional charge. \"Above and beyond\" indeed. Thorough Steve remained professional and cheerful and was obviously determined to do his best rectify the problem and leave us with a fully functioning boiler and system. I have no hesitation in recommending Steve would be only to happy to re-employ him if the need arose.",
    "postcode": null,
    "date": "2013-04-01"
  },
  {
    "title": "Replaced leaking pipe, services gas appliances, advised on thermostat settings.",
    "text": "Pleasant attitude, very helpful, got the job done. Phoned to follow up that all was OK.",
    "postcode": null,
    "date": "2013-02-01"
  },
  {
    "title": "Replace central heating pump and get the system running.",
    "text": "Steve came at very short notice to replace the central heating pump which was situated in a very difficult position under the floor boards. The job took longer than expected but the job was willingly completed.",
    "postcode": null,
    "date": "2013-02-01"
  },
  {
    "title": "Diagnosis of boiler mate thermal store problem.",
    "text": "I called Steve late one evening after our boiler stopped working. Steve traced the problem to a faulty pump and circuit board. The parts were ordered and repairs made. I found Steve to be very knowledgeable about the thermal store which is a bit of a specialist area as these units are not very common.",
    "postcode": null,
    "date": "2013-02-01"
  },
  {
    "title": "Clear blocked soil pipe ( 50 meters).",
    "text": "Work done expertly and efficiently. Drains now in perfect order. Really pleased to have contacted this company. Previously I had an astronomical \"estimate\" for this work so I was pleased to have called in 1st call! Very satisfied customer! Will recommend 1st Call Repair Ltd to friends and family.",
    "postcode": null,
    "date": "2013-02-01"
  },
  {
    "title": "Gas leak, faulty fan and gas valve.",
    "text": "We moved into our new home last week with much excitement but found the boiler faulty. Bad luck! I called Steve Morgan of first call for having a look at our boiler. The temperature was around minus 1 degree centigrade. He is excellent in what he does, very focused, professional, dedicated, polite and considerate. He had to put extra effort than it was initially anticipated. We will be giving him a call to change our 20yr old boiler as soon as the winter finishes. It wouldn't be fair if I had not given him this feedback. Another important point is, safety comes first in his agenda. I am really grateful to him for the checks he had done on our boiler and shut it down when he found the gas leak. Thanks Steve.",
    "postcode": null,
    "date": "2013-02-01"
  },
  {
    "title": "Replaced water tank.",
    "text": "We called Steve out because water was gushing from the loft. Steve came out promptly and solved the problem. We later got him to replace the water tank. We were very happy with the service and found him to be very efficient, reliable and articulate when explaining the problem to us. I have no hesitation in recommending him to anyone looking for a good and friendly plumber.",
    "postcode": null,
    "date": "2013-02-01"
  },
  {
    "title": "Gas safety certificate for residential house.",
    "text": "1st Call Repair Ltd were very friendly, efficient and knowledgeable. They also managed to come around at short notice. I would certainly recommend them for gas safety certificates.",
    "postcode": null,
    "date": "2013-02-01"
  },
  {
    "title": "Fitted new circuit board and new pressure switch.",
    "text": "All work was done professionally and efficiently and was explained to me throughout. Steve was very honest, pleasant and courteous.",
    "postcode": null,
    "date": "2013-02-01"
  },
  {
    "title": "Boiler service.",
    "text": "Would recommend Steve to anyone. Work he has done for me is 10 out of 10! Clean, tidy and very honest.",
    "postcode": null,
    "date": "2013-02-01"
  },
  {
    "title": "Replaced boiler pump.",
    "text": "Called Sunday evening and got an immediate answer. Despite agreeing to work commencing next morning. Stephen called round that evening spending a few minutes for a temporary fix to our lack of heating. The next day he attended as scheduled and fixed the problem to cost and within estimated time frame. Excellent service.",
    "postcode": null,
    "date": "2013-01-01"
  },
  {
    "title": "Leak under bath repaired.",
    "text": "Throughout the work, the engineer clearly explained what he was doing and the reason for it. It was refreshing to have an engineer who was not rushing the work in order to get on to his next job. He double checked that the issue was resolved and that everything was left in full working order.",
    "postcode": null,
    "date": "2013-01-01"
  },
  {
    "title": "Boiler and gas fire service.",
    "text": "Steve called and updated me as he was running late but arrived soon afterwards. Great job on both boiler and gas fire. Very professional and no mess. I would use Steve again and would recommend him.",
    "postcode": null,
    "date": "2013-01-01"
  },
  {
    "title": "Serviced boiler and gas fire.",
    "text": "Very impressed with service and the work, very professional. Steve was unable to keep to the original time as he was running late but he did update me and was with me soon afterwards. Very reasonable price for the work done. I would call him again and would recommend him.",
    "postcode": null,
    "date": "2013-01-01"
  },
  {
    "title": "Plumbing work.",
    "text": "Worked up to 10pm, did well on a difficult task. Conscientious, responsible and determined.",
    "postcode": null,
    "date": "2013-01-01"
  },
  {
    "title": "Service of gas boiler and gas fire.",
    "text": "Steve returned calls promptly and arrived when he said he would. Carried out service work quickly and efficiently and was very pleasant. Will be using him again for the next annual service.",
    "postcode": null,
    "date": "2012-12-01"
  },
  {
    "title": "Boiler breakdown.",
    "text": "What can we say, Steve was fantastic. He came out late on the evening of the 23rd December to try and fix our broken boiler as the insurance cover company was closed, so much for 24hr service eh? Steve was very polite, kept us informed and although unable to fix the problem tonight was professional, articulate and happy to oblige. We wish more trades persons were as brilliant as Steve.",
    "postcode": null,
    "date": "2012-12-01"
  },
  {
    "title": "Repaired leaking heated towel rail and restored pressure in closed heating system.",
    "text": "I was extremely satisfied with the work done and the quick response I received to my call out. The engineer Ross who came out to me on a cold Sunday afternoon was very helpful and courteous and I very grateful to him for the work done.",
    "postcode": null,
    "date": "2012-12-01"
  },
  {
    "title": "Gas boiler had broken down.",
    "text": "Steve responded immediately to my telephone call and came out within a couple of hours to assess the problem. New parts were needed and Steve returned the following evening to fit the parts and ensure the house was warm as soon as possible. Really appreciated this kindness. Steve was friendly, efficient and very professional and was able to reassure that the boiler was good for a few more years. I would definitely use this company again. Highly recommend. A huge thank you!",
    "postcode": null,
    "date": "2012-11-01"
  },
  {
    "title": "Gas safety check.",
    "text": "Efficient professional!",
    "postcode": null,
    "date": "2012-11-01"
  },
  {
    "title": "Electric boiler repair.",
    "text": "Steve was very helpful and provided a top class service repairing my electrical boiler.",
    "postcode": null,
    "date": "2012-11-01"
  },
  {
    "title": "Fixed a non working boiler.",
    "text": "Steve managed to find a very unusual fault with my boiler that was very difficult to diagnose. He saved me having to get a new boiler. He also kept me updated when waiting for spare parts. Highly recommend!",
    "postcode": null,
    "date": "2012-11-01"
  },
  {
    "title": "New fan and full service on the gas boiler.",
    "text": "Compared to other tradesmen. We have called out for various repairs to our home. Cannot fault this company at all. Reliable, friendly, honest, professional and the a job well done! We would not hesitate to recommend.",
    "postcode": null,
    "date": "2012-11-01"
  },
  {
    "title": "Boiler service.",
    "text": "Fantastic and professional service!",
    "postcode": null,
    "date": "2012-11-01"
  },
  {
    "title": "Boiler replacement, general plumbing problems.",
    "text": "Having used 1st call repair on several occasions, we have found Steve to be knowledgeable, reliable and excellent at seeing the job through from start to finish. He is clearly experienced in what he does and works to a very high standard. Would recommend to anyone.",
    "postcode": null,
    "date": "2012-11-01"
  },
  {
    "title": "Emergency repair to boiler.",
    "text": "Excellent service.",
    "postcode": null,
    "date": "2012-11-01"
  },
  {
    "title": "New syphon in toilet.",
    "text": "I would recommend this company.",
    "postcode": null,
    "date": "2012-11-01"
  },
  {
    "title": "Removal of two live birds from behind gas fire.",
    "text": "I found Steve on the internet and he was most obliging. He was very courteous and handled the situation extremely well.",
    "postcode": null,
    "date": "2012-11-01"
  },
  {
    "title": "Replaced diverter valve and pump on central heating system.",
    "text": "Steve is a really friendly and genuine guy, helpful with his advise and quick to come out to quote and do the work. A pleasure to deal with, trustworthy and good at his job. Will be using him again for all my plumbing and heating problems. Thanks Steve!",
    "postcode": null,
    "date": "2012-10-01"
  },
  {
    "title": "Pre-purchase heating and gas evaluation.",
    "text": "Steve responded rapidly to our query to evaluate the heating and gas systems in a new house and came back with a detailed description the state of the system. We will be using him to fix the problems identified when we hopefully make the move shortly!",
    "postcode": null,
    "date": "2012-10-01"
  },
  {
    "title": "Emergency plumbing.",
    "text": "We called Steve out at 9.30 Saturday evening in dire straights! He was with us within 30 minutes. All we can say is, what a really nice guy. Extremely polite, got the job done without fuss and left us relieved and happy. Great emergency call out rate too, especially considering it was a Saturday night. Can't recommend him highly enough.",
    "postcode": null,
    "date": "2012-10-01"
  },
  {
    "title": "2 new parts for boiler ordered and fitted.",
    "text": "I would recommend this company.",
    "postcode": null,
    "date": "2012-10-01"
  },
  {
    "title": "New gas hob fitted, gas safety check",
    "text": "Steve was timely, efficient, explained everything. Would definitely have him back.",
    "postcode": null,
    "date": "2012-08-01"
  },
  {
    "title": "Hot water cylinder fitted.",
    "text": "I would recommend this company.",
    "postcode": null,
    "date": "2012-07-01"
  },
  {
    "title": "Boiler changed/installed",
    "text": "This company is faultless, not only completed work on time but was polite and courteous, very punctual I am satisfied.",
    "postcode": null,
    "date": "2012-05-01"
  },
  {
    "title": "Worcester service and towel rail attention.",
    "text": "Work was efficient and very helpful. Good work.",
    "postcode": null,
    "date": "2012-05-01"
  },
  {
    "title": "Complete Service",
    "text": "Service was completed with the minimum of fuss and with the maximum efficiency. Would recommend Steve to interested parties.",
    "postcode": null,
    "date": "2012-04-01"
  },
  {
    "title": "Replace boiler.",
    "text": "Very conscientious and worked hard to make the job a good one. I would recommend this company.",
    "postcode": null,
    "date": "2012-04-01"
  },
  {
    "title": "Boiler Service",
    "text": "Punctual, clean and tidy and courteous.",
    "postcode": null,
    "date": "2011-07-01"
  },
  {
    "title": "Boiler/water tank leak, Toilet Cistern leak.",
    "text": "Steve Identified the problems I was having straight away, explained the cause and what needed to be done simply for me and carried out the work smoothly and skillfully. I have had many experiences with plumbers over the years and will undoubtedly contact Steve above any other if I have any further problems in the future. In addition, I had several questions about other things that were causing me problems with my heating and hot water etc and was listened to helped without an issue. All in all a very personable, thorough and quality service...Thanks",
    "postcode": null,
    "date": "2011-06-01"
  },
  {
    "title": "Installed a new boiler",
    "text": "Fantastic, the company installer (Steve) was extremely capable, clean, tidy, professional, exact, nothing was any trouble, he explained exactly what he was going to do and he did it to the letter, any concerns I had were catered for and the solution explained in non technical terms. The quote he supplied was very competitive and he honored it. I would not hesitate to use this company again and also recommend this company to others.",
    "postcode": null,
    "date": "2011-05-01"
  },
  {
    "title": "Repair of central heating leak, re-plumbing and masonry repair.",
    "text": "Steve from 1st Call Repair is a true tradesman who shows skill and integrity - a rare find. Highly recommended.",
    "postcode": null,
    "date": "2011-04-01"
  },
  {
    "title": "Repair to leaking water pipe",
    "text": "The work was carried out in a professional manner, extremely pleasant gentleman. I was very pleased with the work and his reasonable charge.",
    "postcode": null,
    "date": "2011-04-01"
  },
  {
    "title": "New boiler installed",
    "text": "A diligent and trustworthy company, I will be using them again for servicing of the new boiler.",
    "postcode": null,
    "date": "2011-04-01"
  },
  {
    "title": "Boiler repair.",
    "text": "Very conscientious and determined to find fault with our boiler which he did!",
    "postcode": null,
    "date": "2011-04-01"
  },
  {
    "title": "New gas boiler and clean the system etc.",
    "text": "Very happy with workmanship, i.E workman courtesy etc.",
    "postcode": null,
    "date": "2011-04-01"
  },
  {
    "title": "General services.",
    "text": "We invited 1st Call Repair for a landlords gas safety certificate to be done. They fixed my boiler repair of the Myson Appollo boiler. They were recommended to me by friends and were brilliant.",
    "postcode": null,
    "date": "2011-04-01"
  },
  {
    "title": "Boiler repair.",
    "text": "They came round to my fix my boiler, it was fast and efficient. He is prompt and professional.",
    "postcode": null,
    "date": "2011-03-01"
  },
  {
    "title": "Boiler repair",
    "text": "Very polite, and hard working. Talked me through the whole thing and was honest and up front. I would not hesitate to recommend them.",
    "postcode": null,
    "date": "2011-03-01"
  },
  {
    "title": "Dealt with broken down boiler",
    "text": "Very fast response, excellent job and very helpful and courteous plumber.",
    "postcode": null,
    "date": "2011-01-01"
  },
  {
    "title": "Hot water not working - replaced battery.",
    "text": "Value for money only scored 6 as job was very simple but we still paid the hourly call out.",
    "postcode": null,
    "date": "2011-01-01"
  },
  {
    "title": "Mended boiler and serviced.",
    "text": "Very polite and helpful. Really trusted them to do a good reasonably priced job.",
    "postcode": null,
    "date": "2010-12-01"
  },
  {
    "title": "Central heating boiler replacement.",
    "text": "An excellent boiler replacement by a friendly capable engineer.",
    "postcode": null,
    "date": "2010-12-01"
  },
  {
    "title": "Boiler repair and service.",
    "text": "Steve was polite, honest and explained everything he was doing. I feel he went out of his was to finalise the job.",
    "postcode": null,
    "date": "2010-11-01"
  },
  {
    "title": "Hot water cylinder change.",
    "text": "I'm an old lady in my nineties, so I am wary of tradesmen who come to my door, Gas Lite are now my first call repair. They were just brilliant with their services, especially Steve the engineer.",
    "postcode": null,
    "date": "2010-11-01"
  },
  {
    "title": "Boiler and heating upgrade.",
    "text": "Gas Lite now first call repair, had come out to my property to install a new boiler, I was impressed with the service, but more impressed when 3 weeks later my water tank burst and there response was immediate.",
    "postcode": null,
    "date": "2010-11-01"
  },
  {
    "title": "Heating and hot water break down.",
    "text": "We had to much hot water at boiling point. I had got four plumbing firms I and did not have a clue. 1st Call Repair who were Gaslite, fixed the problem straight away.",
    "postcode": null,
    "date": "2010-11-01"
  },
  {
    "title": "Gas Boiler fault repair",
    "text": "My boiler needed a new Circuit Board and Gas Valve fitting. It was fitted quickly, efficiently and without fuss. The engineer was experienced, knowledgeable, extremely helpful and willing to answer any questions I had. The costs of the repair were very reasonable. I wouldn't hesitate to recommend this company and I have since arranged an annual boiler servicing with them. My heating/hot water is now working better and more efficiently than it ever has. Very happy.",
    "postcode": null,
    "date": "2010-11-01"
  },
  {
    "title": "Service potierton boiler.",
    "text": "I would recommend this company.",
    "postcode": null,
    "date": "2010-11-01"
  },
  {
    "title": "Boiler service",
    "text": "The engineer new his job well, thank you.",
    "postcode": null,
    "date": "2010-11-01"
  },
  {
    "title": "Heating break down.",
    "text": "1st call repair / formally Gaslite fixed my heating in no time. The guy new what he was doing, and fixed it with no inconvenience. 1xt Call repair are outstanding.",
    "postcode": null,
    "date": "2010-11-01"
  },
  {
    "title": "Install electric shower unit",
    "text": "I would recommend this company.",
    "postcode": null,
    "date": "2010-11-01"
  },
  {
    "title": "Replacement of boiler parts",
    "text": "Worked diligently to identify boiler problems and anxious to be seen to provide an excellent service.",
    "postcode": null,
    "date": "2010-06-01"
  },
  {
    "title": "Fit and install new Worcester boiler.",
    "text": "Steve is friendly - knowledgeable - helpful - professional - efficient and tidy. Would highly recommend, a pleasure to deal with.",
    "postcode": null,
    "date": "2010-05-01"
  },
  {
    "title": "Gas.",
    "text": "Very flexible re timings, pleasant and polite to deal with, high quality work. Strongly recommend.",
    "postcode": null,
    "date": "2010-04-01"
  },
  {
    "title": "Gas hob connection.",
    "text": "Simply excellent! Professionally completed with a personal attention to detail.",
    "postcode": null,
    "date": "2010-04-01"
  },
  {
    "title": "Installed a heating system",
    "text": "Excellent service, estimate for the work and time scale was spot on.  ",
    "postcode": null,
    "date": "2010-04-01"
  },
  {
    "title": "Check for gas leak",
    "text": "Friendly - knowledgeable - helpful - professional - efficient and tidy.",
    "postcode": null,
    "date": "2010-04-01"
  },
  {
    "title": "Gas.",
    "text": "Gaslite had come round and fixed a plumbing repair on my hot water cylinder.",
    "postcode": null,
    "date": "2010-04-01"
  },
  {
    "title": "Gas.",
    "text": "They were very professional in boiler installation and cylinder change, I would recommend this company from any others in Horsham.",
    "postcode": null,
    "date": "2010-04-01"
  },
  {
    "title": "Gas.",
    "text": "Gas Lite had come round and fixed a fault in my combination boiler that had been running faulty for weeks.",
    "postcode": null,
    "date": "2010-04-01"
  },
  {
    "title": "Gas.",
    "text": "Very happy with work done.",
    "postcode": null,
    "date": "2010-04-01"
  },
  {
    "title": "Fault boiler fault and fix.",
    "text": "Gaslite were the first of many engineers to find the fault in my boiler and has helpful fix the boiler in my nans house and found them to be good.",
    "postcode": null,
    "date": "2010-03-01"
  },
  {
    "title": "Fault finder combination boiler.",
    "text": "Knowledgeable and efficient on the work on the boiler. Friendly and tidy. Would recommend him to others.",
    "postcode": null,
    "date": "2010-03-01"
  },
  {
    "title": "Boiler service.",
    "text": "Would highly recommend his company - 1st class service and experience.",
    "postcode": null,
    "date": "2010-03-01"
  },
  {
    "title": "To fit and install a radiator in the house",
    "text": "The work was carried out exactly to my requirements. Arrived as promised and was very pleased with the standard of work carried out. Very good on price and would highly recommend them.",
    "postcode": null,
    "date": "2010-03-01"
  },
  {
    "title": "Boiler repairs and service.",
    "text": "Very happy with all aspects of the work done. We will use GasLite Response again.",
    "postcode": null,
    "date": "2010-03-01"
  },
  {
    "title": "Boiler Installation",
    "text": "GasLite Ltd gave an excellent service, very pleased with work done. We will use hem in the future. I would recommend this company.",
    "postcode": null,
    "date": "2010-03-01"
  }
]
