[
 {
  "title": "Annual boiler check",
  "text": "EVO plumbing and heating were easy to get hold of and offered a flexible, friendly and accommodating service to fit round my work shifts. They phoned prior to arrival and turned up exactly when they said they would",
  "postcode": "TN5",
  "date": "2023-07-01"
 },
 {
  "title": "Install thermostatic valves and hive heating control",
  "text": "Job done quickly, neatly, and as per quoted price. Friendly and reliable service",
  "postcode": "RH10",
  "date": "2023-07-01"
 },
 {
  "title": "Stop leak and replace faulty magnetic heatic filter",
  "text": "EVO plumbing and heating were recommended by a neighbour for a leak emergency we had over the weekend. They were absolutely superb throughout. We were struggling to find an out of hours emergency engineer but Steve answered immediately and quickly came to us to do a temporary fix on a badly leaking magnetic filter. He returned early Monday to install the new unit and fully recommission our hot water and heating. He is a very likeable person and a pleasure to have in our house",
  "postcode": "RH10",
  "date": "2023-07-01"
 },
 {
  "title": "Water damage to Cylinder",
  "text": "I called out Evo after having a water leak in my cylinder. Jamie attended and was quick in finding out where the leak coming from, and was able to resolve the problem for me. He then gave good advice, as to what to do next, which was to replace the whole system. We then had Aaron around a few days later to quote for a combi boiler, who advice this was the best way to go for my house. Both I felt where very knowledgeable, and helpful in resolving my water leak damage.",
  "postcode": "RH16",
  "date": "2023-07-01"
 },
 {
  "title": "Various jobs, fixing leaks, fitting new taps and ballcock",
  "text": "Arrived on time, completed all work as requested, no mess",
  "postcode": "RH10",
  "date": "2023-07-01"
 },
 {
  "title": "Plumbing and heating work",
  "text": "Stephen from EVO plumbing and heating provided amazing service, and quality work. He Installed 2 new radiators, a mixer tap, and fixed a shower issue. Highly recommended, he was professional at all times and extremely clean. Very good prices too.\"",
  "postcode": "TN22",
  "date": "2023-07-01"
 },
 {
  "title": "Central heating service",
  "text": "Reliable, dependable, friendly service.",
  "postcode": "RH20",
  "date": "2023-07-01"
 },
 {
  "title": "New bathroom radiator",
  "text": "Very neat and tidy work carried out by a really nice chap.",
  "postcode": "TN22",
  "date": "2023-07-01"
 },
 {
  "title": "Clear drain obstructions and check with CCTV camera",
  "text": "Jamie did a thorough and professional job first clearing the drains from roots and sludge build up, then checking the improvement with his drain camera. We found the entire company set up to be both professional and friendly. They were easy to get hold of to make an appointment and kept us updated on arrival.",
  "postcode": "RH10",
  "date": "2023-07-01"
 },
 {
  "title": "Amazing",
  "text": "I contacted the company as I required an emergency, out of hours plumbing services for a leaking boiler. The person arrived within a short space of time and fixed the leak within 15 mins. Although the service was provided outside the business hours it was reasonably-priced. I will definitely be using their services in the future!",
  "postcode": "W4",
  "date": "2023-07-01"
 },
 {
  "title": "Emergergency leak repair",
  "text": "Was recommended by a neighbour who has used EVO plumbing several times. They were amazing, managed to pop over early morning as we had an emergency with our badly leaking tap. A very polite young man, my partner and I will be looking to upgrade our heating later on in the year and will definitely be usingEVO plumbing. Thank you.\"",
  "postcode": "RH11",
  "date": "2023-07-01"
 },
 {
  "title": "Reseal bath to stop leak",
  "text": "Very neat and tidy work completed by a very pleasant worker",
  "postcode": "RH6",
  "date": "2023-07-01"
 },
 {
  "title": "Fixing toilet issue.",
  "text": "Efficient both in responding and resolving the issue we had. Also seemed reasonably priced for same day service.",
  "postcode": "RH10",
  "date": "2023-07-01"
 },
 {
  "title": "Blocked drain at back of house",
  "text": "Can't fault any aspect of work. Call was answered straight away by Harvey who scheduled Jamie to arrive at a set time later in the day. Jamie arrived spot on time and cleared the drain quickly and without any fuss. The entire area was left clean and tidy.",
  "postcode": "RH10",
  "date": "2023-07-01"
 },
 {
  "title": "Outside tap",
  "text": "Excellent thank you",
  "postcode": "RH12",
  "date": "2023-06-01"
 },
 {
  "title": "Boiler service",
  "text": "Prompt, friendly and professional service",
  "postcode": "TN22",
  "date": "2023-06-01"
 },
 {
  "title": "Remedy central heating problem",
  "text": "We called Stephen from EVO plumbing because our central heating was coming on whenever we turned on our hot water. Steve was quick to respond and diagnosed and fixed the issue quickly and on his first visit. Friendly guy giving excellent service",
  "postcode": "RH11",
  "date": "2023-06-01"
 },
 {
  "title": "Investigate and fix leak",
  "text": "They came very quickly and were able to locate and fix the leak and at a good price too.",
  "postcode": "TN6",
  "date": "2023-06-01"
 },
 {
  "title": "Re-pressure boiler, check and fix leaks",
  "text": "A very thorough job undertaken by Stephen. He did well to locat and fix 2 leaks in very obscure parts of the system",
  "postcode": "RH10",
  "date": "2023-06-01"
 },
 {
  "title": "Leak in attic",
  "text": "Good job.Good price.",
  "postcode": "RH1",
  "date": "2023-06-01"
 },
 {
  "title": "Mend leaking sink Connection",
  "text": "Fantastic weekend response. It wasn't a big job, but struggled to get hold of anyone. As soon as I spoke to Harvey from EVO the job was acted on quickly and fixed within 2 hours of call. Very appreciative of the great service and will be booking more work in",
  "postcode": "TN22",
  "date": "2023-06-01"
 },
 {
  "title": "Blocked Drain",
  "text": "Friendly, professional service carried out by Jamie. Many thanks for fitting me in . I will be using EVO next time I have a plumbing problem or work that needs to be carried out.",
  "postcode": "RH9",
  "date": "2023-06-01"
 },
 {
  "title": "To change the elements of the immersion heather",
  "text": "The plumber was very professional and efficient.",
  "postcode": "RH10",
  "date": "2023-06-01"
 },
 {
  "title": "Shower install",
  "text": "Very amiable and friendly guys who talked me through what they were doing in words we could understand - not jargon. Job was completed to a high standard and area was left tidy. Would recommend",
  "postcode": "TN22",
  "date": "2023-06-01"
 },
 {
  "title": "Clear drain blockage",
  "text": "They were easy to get hold of. Service was good. Fast and neat service.",
  "postcode": "RH13",
  "date": "2023-05-01"
 },
 {
  "title": "Boiler service.",
  "text": "Reliable, professional and friendly service as always.",
  "postcode": "TN6",
  "date": "2023-05-01"
 },
 {
  "title": "Diagnose-Fix hot water issue.",
  "text": "We have used EVO plumbing and heating several times now, and will continue to use them again. Service and follow up is top rate. They think about the best solution to your problem and deliver a good result.\"",
  "postcode": "RH10",
  "date": "2023-05-01"
 },
 {
  "title": "Supply and fit bathroom taps. Install new w.C.",
  "text": "Communication and work both superbly executed. Highly delighted with every aspect of work",
  "postcode": "RH10",
  "date": "2023-05-01"
 },
 {
  "title": "Installation of outside tap and fixing of toilet",
  "text": "I am really happy with the fast response time -- and the good workmanship of Evo Plumbing. I needed a new tap but there was an electrical box where the tap should have gone -- he problem solved it and I am happy with my new tap! Highly recommend.",
  "postcode": "RH14",
  "date": "2023-05-01"
 },
 {
  "title": "Replace broken shower pump",
  "text": "Brilliant responsive service. Faulty pump was replaced on the same day call was first made.",
  "postcode": "RH16",
  "date": "2023-05-01"
 },
 {
  "title": "Replace cracked shower tray",
  "text": "Very careful and tidy work. Steve was thoughtful every step of the way and the completed work is superb",
  "postcode": "RH10",
  "date": "2023-05-01"
 },
 {
  "title": "Fix leaking taps and adjust water flow in toilet cistern",
  "text": "Mark was pleasant, attentive, competent and clearly very motivated to help. Would have no hesitation in recommending Evo on the basis of his attitude and work.",
  "postcode": "RH15",
  "date": "2023-04-01"
 },
 {
  "title": "Install wall hung basin",
  "text": "Work was done in a neat and tidy fashion, and with great care and attention to detail. The engineer was sociable and pleasant. He insisted on tidying up after too.",
  "postcode": "RH10",
  "date": "2023-04-01"
 },
 {
  "title": "Replace existing radiator",
  "text": "Harvey was responsive to my needs and sent James out to my home to replace a radiator. James was very polite, efficient and left no mess. I was charged as per my call with Harvey and would not think twice about using their services again.",
  "postcode": "TN22",
  "date": "2023-04-01"
 },
 {
  "title": "Fix overflow in loft",
  "text": "Very quick, friendly and efficient service. Called in morning and problem was sorted within 2 hours",
  "postcode": "RH15",
  "date": "2023-04-01"
 },
 {
  "title": "Replace old radiator for new",
  "text": "I have used EVO plumbing and heating several times now and am always 100% satisfied with their work. They were quick and efficient and I trust them to do a great job. They never disappoint.",
  "postcode": "TN22",
  "date": "2023-04-01"
 },
 {
  "title": "Fix toilet flush mechanism and repair leak",
  "text": "Highly satisfied with every aspect of work completed by EVO plumbing. They are a help, courteous and conscientous team who do a thorough and tidy job.",
  "postcode": "RH13",
  "date": "2023-04-01"
 },
 {
  "title": "Clearing a blockage in the kitchen sink",
  "text": "Aaron and Jamie worked really hard to clear a very stubborn blockage in the pipe from the kitchen sink. I suspect some other plumbers would have given up. Jamie also checked some of the other drains with his camera. They did very well.",
  "postcode": "BN6",
  "date": "2023-04-01"
 },
 {
  "title": "No hot water",
  "text": "I phoned several companies and Harvey was the only one who answered. An appointment was made and Steve arrived dead on time. He was able to diagnose and fix the problem quickly with minimal disruption, and was insistent on leaving the work area clean. Service cannot be faulted,",
  "postcode": "RH10",
  "date": "2023-04-01"
 },
 {
  "title": "Looking for and mending a leak from the bathroom into the laundry room roof",
  "text": "Mark arrived at the arrranged time he was very polite and generally respectful of my property. He took a lot of care locating the leak which was not easy to access. He assesed the problem and spoke to me before the repair, giving me information about the cost. He took a lot of care and managed to do the job well. I paid him at the time as everything was very satisfactory and being just before a National holiday, a great releif to find such a helpful company and professional plumber.",
  "postcode": "RH20",
  "date": "2023-04-01"
 },
 {
  "title": "Fix hot bath tap",
  "text": "Great job completed by Alan from EVO. It was impossible to change leaking tap due to position at back of bath. Phoned several other companies who weren't really interested in such a small fiddly job, but EVO were great, really helpful and accommodating. I will always recommend this company.",
  "postcode": "RH13",
  "date": "2023-04-01"
 },
 {
  "title": "Replace shower , and immersion heater valves and tap cartridges.",
  "text": "Steve and Mark arrived on time , completed the work swiftly and professionally and as shower access was easier than anticipated and quoted for , the invoice was reduced accordingly.",
  "postcode": "RH14",
  "date": "2023-03-01"
 },
 {
  "title": "Install new toilet and hand basin in cloakroom",
  "text": "Evo are all that you want from a plumbing company; skilled tradesmen, reliable, punctual, sociable, and work is completed on time and at reasonable cost",
  "postcode": "RH10",
  "date": "2023-03-01"
 },
 {
  "title": "Replace leaking kitchen sink drainage",
  "text": "A very neat and tidy job. Steve obviously takes great pride in his work and is also a very polite and pleasant person.",
  "postcode": "RH12",
  "date": "2023-03-01"
 },
 {
  "title": "Emergency clearance of kitchen drain",
  "text": "Responded quickly To our out of hours drainage clearance request, The contractor was very pleasant and worked diligently to remedy the problem. We are very satisfied with all work done.",
  "postcode": "TN6",
  "date": "2023-03-01"
 },
 {
  "title": "Replace bathroom taps and re-seal bath and shower",
  "text": "The service from start to finish was exemplary from initial telephone call through to job completion. Refreshing to have found a company who you can trust and believe in",
  "postcode": "TN6",
  "date": "2023-03-01"
 },
 {
  "title": "Fitted kitchen sink and taps",
  "text": "Brilliant service, turned up on time, did an excellent job including cleaning up all the mess from an unexpected blocked drain! Steve was extremely friendly and knowledgeable. I would highly recommend this company.",
  "postcode": "RH11",
  "date": "2023-03-01"
 },
 {
  "title": "Replacing a bath waste",
  "text": "Harvey provided someone very quickly to deal with a leaking bath waste. The problem was identified quickly and a new waste provided and fitted. All is now well!",
  "postcode": "RH11",
  "date": "2023-03-01"
 },
 {
  "title": "Installing a gas connector in the kitchen",
  "text": "Absolutely excellent service from start to finish. Aaron was very professional and done a splendid job. Work was completed very quickly. Would highly recommend.",
  "postcode": "RH6",
  "date": "2023-03-01"
 },
 {
  "title": "Replace dripping bathroom tap",
  "text": "Excellent service. Mark came to fix a leaking bathroom tap, quickly identified the problem, and tried various solutions. We ordered in some new wall-mounted replacement taps, which he came to instal the following day, as promised. Careful, thorough installation, and separately he sorted out a spurting kitchen tap and answered some other questions I had about the water level in the toilet. Efficient and reliable service, and he kindly reduced the normal cost per hour as it took two visits. Would definitely recommend, and will be using EVO and Mark again in the future. Really excellent job.",
  "postcode": "SW19",
  "date": "2023-03-01"
 },
 {
  "title": "Install Washing machine",
  "text": "Tremendous service. Easy to get hold of, Polite, friendly, and quick turn around.",
  "postcode": "TN22",
  "date": "2023-03-01"
 },
 {
  "title": "Clear blocked drain",
  "text": "Unable to clear ourselves so called Harvey from EVO. He got to us very quickly and managed to clear the drain in no time with no mess. Thoroughly good done by a very reliable company",
  "postcode": "RH6",
  "date": "2023-03-01"
 },
 {
  "title": "Boiler service and re-pressure system",
  "text": "Arrived on time and did a great job. Very friendly and pleasant to talk to.",
  "postcode": "GU14",
  "date": "2023-03-01"
 },
 {
  "title": "Clear blockage of toilet",
  "text": "Jamie arrived promptly to address our emergency of a blocked toilet. His efforts to locate the cause were carried out in a professional manner and he was polite and well presented. His efforts were rewarded with isolating the problem, which he then fixed to a high satisfaction. Great job! Thank you, Mrs Craven.",
  "postcode": "BN8",
  "date": "2023-03-01"
 },
 {
  "title": "Leak on pipe leading out from hot water tank.",
  "text": "Absolutely DELIGHTED with the work.. all fixed at a reasonable price. We had left messages on various numbers.. 5 in total and Evo were the only ones who picked up immediately! Two others replied and could not help .. one was on check a trade and never bothered to get back to me after he said he would.  So well done Evo… Very reliable , a hard working guy. Really pleased. Will definitely be using Evo again!  And would definitely recommend Evo to my friends.  Thank you.",
  "postcode": "BN43",
  "date": "2023-03-01"
 },
 {
  "title": "Re-seal bath and basin",
  "text": "Only a small job, but done very neatly. I have used Harvey from EVO before and he is always very friendly and reliable and has never let us down.",
  "postcode": "RH11",
  "date": "2023-03-01"
 },
 {
  "title": "Blocked kitchen sink",
  "text": "Good Price. Arrived on time. Rectified the issue. Friendly and left the area clean and tidy. Would recommended.",
  "postcode": "RH10",
  "date": "2023-02-01"
 },
 {
  "title": "Power flush heating system",
  "text": "We used EVO to power flush our heating system and the results were amazing. We phoned several companies for quotes and EVO seemed at a different level technically from all others. We obviously made the right decision as they delivered exactly what they promised and the difference before and after is just incredible.",
  "postcode": "TN6",
  "date": "2023-02-01"
 },
 {
  "title": "Weekend callout to carbon monoxide alarm",
  "text": "Very rapid response, friendly and reasonable price",
  "postcode": "TN22",
  "date": "2023-02-01"
 },
 {
  "title": "Replace leaking radiator",
  "text": "EVO plumbing did a great job replacing my leaking radiator. They were easy to get hold of, quick to react, and quality of work was excellent. It was a pleasure having Stephen in our house.",
  "postcode": "RH10",
  "date": "2023-02-01"
 },
 {
  "title": "Boiler maintenance",
  "text": "Steve serviced the boiler and cured a problem with the under floor heating pump",
  "postcode": "KT22",
  "date": "2023-01-01"
 },
 {
  "title": "Emergency callout to split water mains",
  "text": "Terrific service from this company. Responded very quickly to our request. Actioned a temporary emergency fix, then returned quickly thereafter with specialist mains fittings. Kept us updated at all times.",
  "postcode": "TN22",
  "date": "2023-01-01"
 },
 {
  "title": "New boiler installation",
  "text": "I found them online just to have a boiler serviced, Stephen was very helpful and had a huge knowledge about boilers. Unfortunately we had a small leak in our boiler and we had to change it asap. Stephen arranged everything very quickly and sent Aaron within 2 days to install the new boiler. Aaron was very professional and very efficient, he installed the boiler very quickly which we were very happy with as it was due to temperature dropping to -3 at night. We can highly recommend this company.",
  "postcode": "RH11",
  "date": "2023-01-01"
 },
 {
  "title": "Emergency callout to burst pipe",
  "text": "Really appreciate the rapid response and quick repair. The guys were obviously very busy but pulled out all the stops to get to us quickly and resolve our problem",
  "postcode": "RH11",
  "date": "2023-01-01"
 },
 {
  "title": "Supply and fit new basin and bath taps",
  "text": "Brilliant service. Harvey was very attentive and responded quickly to our initial enquiry, booking and completing the work. He was really friendly and helpful and nothing seemed like too much bother.",
  "postcode": "TN22",
  "date": "2023-01-01"
 },
 {
  "title": "Fix leaking bath tap",
  "text": "Steve did a terrific job accessing and fixing a bad leak on hot bath tap. We needed a quick response as water had started to come through our ceiling, so it was great have a reliable company at hand.",
  "postcode": "TN6",
  "date": "2023-01-01"
 },
 {
  "title": "Boiler service",
  "text": "Stephen was unbelievably helpful. He went above and beyond his remit answering my random questions on unrelated heating questions as well as doing a very thorough job. More than impressed and I won't be going anywhere else in the future.",
  "postcode": "TN22",
  "date": "2023-01-01"
 },
 {
  "title": "Reconfigure radiator pipework",
  "text": "Super neat job and attention to detail. Steve delivered precisely what we wanted and actually exceeded our expectations",
  "postcode": "RH3",
  "date": "2023-01-01"
 },
 {
  "title": "Boiler replacement and power flush",
  "text": "Evo provided at the outset confidence, and knowledge, in the service they were offering. They arrived spot-on time on the due date of the work. The work was done professionally, with great attention to tidiness and finishing touches to the job. The heating engineer who did the work was extremely friendly, obviously highly experienced and knowledgeable, and was a pleasure to have with us for the duration of the work. We had impression of nothing being too much trouble to do a good job. We are delighted to have chosen this company.",
  "postcode": "GU4",
  "date": "2023-01-01"
 },
 {
  "title": "Clearing rainwater drain and downpipes",
  "text": "Gave good advice, job done quickly and efficiently,",
  "postcode": "RH10",
  "date": "2022-12-01"
 },
 {
  "title": "Repair a pin hole leak in a copper pipe in the loft",
  "text": "Was so relieved when I called Evo and explained we had a leaky pipe in the loft and they were able to send someone round later the same day! Jamie arrived on time and was friendly, polite and super efficient. He had the job done within the hour and the charge was very reasonable. All round a great experience and based on this I would thoroughly recommend! Thank you Evo and Jamie!",
  "postcode": "RH12",
  "date": "2022-12-01"
 },
 {
  "title": "Installation of new water cylinder",
  "text": "13 years ago Steve installed a replacement Ariston cylinder in a flat I own in Kingston, Surrey - I do not live there but it has worked continually since that time. When it recently gave up and beyond repair, Steve was the first person I called. His dedication to customer satisfaction is excellent. He firstly ordered and then replaced the cylinder yesterday. His workmanship is superb and he does what he says and does it when he says he will do it. Totally reliable, I would not hesitate to recommend Steve and his Company without reservation. Bob",
  "postcode": "KT2",
  "date": "2022-12-01"
 },
 {
  "title": "Install new cylinder",
  "text": "EVO were really helpful and offered a great level of service. They came late one evening to make safe our leaking cylinder, then returned 2 days later to fit replacement. All staff were friendly and helpful and went out of their way to assist in every way they could. Will definitely be using again.",
  "postcode": "RH6",
  "date": "2022-12-01"
 },
 {
  "title": "Gas fitting",
  "text": "The job was done as scheduled and very promptly and effectively carried out (connection of a job to Calor gas)",
  "postcode": "RH12",
  "date": "2022-12-01"
 },
 {
  "title": "Pump change",
  "text": "Harvey and Evo are always such a pleasure to work with, professional and never let me down",
  "postcode": "BN16",
  "date": "2022-12-01"
 },
 {
  "title": "Fitting replacement Mixer Tap to Kitchen Sink",
  "text": "Excellent work carried out promptly and efficiently by courteous and friendly Engineer who managed to fit in the job very quickly to avoid problems caused by the old tap leaking! Overall a very satisfacory job, Thanks!!",
  "postcode": "RH17",
  "date": "2022-12-01"
 },
 {
  "title": "Power Flushing",
  "text": "Some Sri Lanken friends of mine who recently moved into an old bungalow asked my advice on their heating problems and it was clear to me that a professional Power Flush was required. I did a survey at their behest and thankfully fell upon Evo as others did not impress me. I had a technical chat with Harvey who inspired me and booked an appointment for yesterday. I went along to see how things were going and met Aaron who explained technically the proceedure and found him very knowledgable and professional. He is an asset to your company and trust he is respected as such. A 100 p-c outcome!",
  "postcode": "ME17",
  "date": "2022-11-01"
 },
 {
  "title": "Replace bath taps and and side panel",
  "text": "Lovely job, completed neatly, and very friendly service.",
  "postcode": "RH15",
  "date": "2022-11-01"
 },
 {
  "title": "Remove old boiler and cylinder unit, and replace with combi boiler and new flue system.",
  "text": "They did a great job and I'd thoroughly recommend EVO based on my experience. This was a big job that involved them arranging scaffolding to access the flue from the roof in my top floor flat, and removing the old boiler and cylinder unit. They organised everything really well, so that everything went smoothly during the job and kept me updated throughout. They worked really hard to deliver exactly as had been specified, and were professional throughout.",
  "postcode": "RH10",
  "date": "2022-11-01"
 },
 {
  "title": "Re-pressurise and check boiler.",
  "text": "Our boiler supplier (2021) and maintenance contractor could only offer a response within ten days to our boiler shutdown. My call to EVO was responded to within minutes and the technician came within half an hour. He was helpful, supportive and highly competent, re-setting the boiler and showing me how to deal with a similar problem in the future. I am in the process of cancelling my existing service contract and will call on EVO in future.",
  "postcode": "RH13",
  "date": "2022-11-01"
 },
 {
  "title": "Fix bathroom leak",
  "text": "Steve worked diligently to solve our leak problem and was able to sort our issue very quickly. He made a very difficult job, that 2 other plumbers had not been able to solve, look very easy.",
  "postcode": "RH10",
  "date": "2022-11-01"
 },
 {
  "title": "Replace broken gulley",
  "text": "Darren did a first class job. He was friendly, very accommodating, and quality of work exceptional.",
  "postcode": "TN6",
  "date": "2022-11-01"
 },
 {
  "title": "Powerflush heating system",
  "text": "Absolute quality work carried out by Harvey and his team. We did receive a cheaper quote, but the knowledge demonstrated by Harvey during our initial conversation made us feel we would be getting a far more comprehensive and service with EVO plumbing and heating, and we weren't disappointed. The results are absolutely astounding. Would definitely recommend",
  "postcode": "RH10",
  "date": "2022-11-01"
 },
 {
  "title": "Blocked foul drainage",
  "text": "Polite, professional, kept informed of progress to site as urgent attendance required. Effective and intelligent approach to solving problem (Jamie) helpful office contact (Steve). Would certainly use this contractor again. Thank you to all at Evo Home Services Ltd.",
  "postcode": "TN6",
  "date": "2022-11-01"
 },
 {
  "title": "Repair to external drain",
  "text": "Every aspect of the work from the original quotation through to job completion were amazing. Steven was respectful, friendly and resourceful. Would definitely use Steven and EVO again.",
  "postcode": "TN6",
  "date": "2022-11-01"
 },
 {
  "title": "New boiler",
  "text": "We have had Steve service our old boiler so we knew who we wanted to install our new one. Job was done perfectly with a great deal of thinking to change to the latest requirements. Perfect.",
  "postcode": "RH16",
  "date": "2022-11-01"
 },
 {
  "title": "Two leaks were detected and dealt with very efficiently by Jamie from EVO.",
  "text": "Jamie was diligent and efficient in his work. He detected both leaks and dealt with them brilliantly. I cant recommend him and this company enough! Thank you!",
  "postcode": "BN7",
  "date": "2022-11-01"
 },
 {
  "title": "Repair cracked pipes under sink",
  "text": "Delighted with all work done by Harvey and EVO. They responded quickly, were friendly, polite and couteous, and did an excellent first class job.",
  "postcode": "RH11",
  "date": "2022-11-01"
 },
 {
  "title": "CH fault finding and service",
  "text": "Excellent work by Nathan, friendly, efficient, tidy and communicated clearly with my elderly mother; explaining in advance what needed to be done with estimate of cost for us to compare with other engineers prior to booking. Will be using Evo for extended family CH checks and servicing going forwards. Would highly recommend.",
  "postcode": "RH10",
  "date": "2022-10-01"
 },
 {
  "title": "Flush heating system and fit new valves",
  "text": "Really pleased with the work undertaken by Steven from EVO. He was able to restore heating to all radiators and they are now are running far more efficiently than before",
  "postcode": "RH10",
  "date": "2022-10-01"
 },
 {
  "title": "Replace Electric Shower",
  "text": "I was very impressed with Mark who contacted me on Monday and we agreed a time on Tuesday. He arrived on time and disagnosed the problem very quickly. He sourced a replacement electric shower unit and fitted it. He was very polite and efficient. He left the site clean and tidy. Great job and 10 out of 10 for Mark.",
  "postcode": "TN6",
  "date": "2022-10-01"
 },
 {
  "title": "Boiler repair",
  "text": "No problem contacting EVO, unlike a lot of other companies. Very happy with the service received throughout and will continue using this company from now on",
  "postcode": "GU14",
  "date": "2022-10-01"
 },
 {
  "title": "Boiler service and install programmer control",
  "text": "Steve provided a terrific service at reasonable cost. He is friendly and approachable and explains things very well",
  "postcode": "TN6",
  "date": "2022-10-01"
 },
 {
  "title": "Replacement of toilet, resealing floor edges around tile and bath resecuring bath panel .",
  "text": "Nathan arrived on time , was very thorough. Nathan always made sure I was happy with work ; where adaptions had to be made he was careful to ensure it was what I wanted. The workmanship skills are excellent and the final appearance  looks very professional. Nathan was very tidy and ensured all flooring was covered, he hoovered as he worked and was very respectful. I would strongly reccomend Nathan and this company ; excellent service. Thank you.",
  "postcode": "GU14",
  "date": "2022-09-01"
 },
 {
  "title": "Gas Safety Certificate",
  "text": "An appointment was booked and there was a no show from the tenants. Another was booked in swiftly. And certificate sent out easily. Overall a happy experience",
  "postcode": "RH6",
  "date": "2022-09-01"
 },
 {
  "title": "Clearing blocked soilstack.",
  "text": "Attended the day they were called and completed the job within one hour of arrival. Excellent service and good communication.",
  "postcode": "GU14",
  "date": "2022-08-01"
 },
 {
  "title": "Solve banging pipe problem",
  "text": "Thank you Harvey and EVO - such a relief to get this problem finally resolved!",
  "postcode": "RH11",
  "date": "2022-08-01"
 },
 {
  "title": "Resolving a leak on shower pump Flexi hose.",
  "text": "It was an emergency call out and Mark the plumber attended within 3 hours and did a very good neat and workmanlike job. Excellent service. Very impressed.",
  "postcode": "RH13",
  "date": "2022-08-01"
 },
 {
  "title": "Fix leak on water tank",
  "text": "Fast and reactive service on a weekend callout. Very amiable worker - friendly and helped clear the mess the leak had caused.",
  "postcode": "TN6",
  "date": "2022-08-01"
 },
 {
  "title": "Fixing the toilet flushing mechanism",
  "text": "The response was good - worked completed and checked.",
  "postcode": "RH15",
  "date": "2022-08-01"
 },
 {
  "title": "Replace kitchen sink pipework to stop leak",
  "text": "Really please with all aspects of work. Great response and friendly service. Not charged a fortune either!",
  "postcode": "GU12",
  "date": "2022-08-01"
 },
 {
  "title": "No Hot water",
  "text": "Fast efficient service and great communication. Gave options on best way(s) to resolve problem too. Highly recommend these guys",
  "postcode": "TN6",
  "date": "2022-08-01"
 },
 {
  "title": "Remove radiator and install vertical towel rail",
  "text": "EVO were responsive and friendly. The work was completed quickly and to a high standard. I also feel we got good value. I shall be using Stephen and EVO again",
  "postcode": "RH10",
  "date": "2022-08-01"
 },
 {
  "title": "Replacement of flexible hose under bath",
  "text": "Evo Plumbing arrived on time, was very amenable and carried out the work promptly.",
  "postcode": "KT17",
  "date": "2022-08-01"
 },
 {
  "title": "Find leak and produce report for insurance company",
  "text": "Courteous and professional throughout. Cannot fault service at all, they were tremendous",
  "postcode": "RH10",
  "date": "2022-07-01"
 },
 {
  "title": "Fix Permanently running toilet",
  "text": "Displayed professional attributes throughout. They were a delight to have in the house and will definitely be using EVO again",
  "postcode": "TN6",
  "date": "2022-07-01"
 },
 {
  "title": "Repair leak under concrete",
  "text": "Can't thank EVO and Steve enough. We had really struggled to find someone who was willing to help us and were beginning to despair. EVO really came to our rescue. Phoned the office in the morning and Steve was round within a few hours to assess, then came back following day to repair. Friendly, helpful, tidy and all round quality work!",
  "postcode": "RH10",
  "date": "2022-07-01"
 },
 {
  "title": "Fitting new dishwasher and replace kitchen sink tap",
  "text": "Evo plumbing were great. Mark arrived on time and was very efficient. Thanks for the great job done Mark",
  "postcode": "RH13",
  "date": "2022-07-01"
 },
 {
  "title": "Clear blocked kitchen drain",
  "text": "Very good service. Called early morning and blocked drain had been cleared before midday. Worker was polite, friendly, and tidy with his work. Would recommend to others and use again",
  "postcode": "RH10",
  "date": "2022-07-01"
 },
 {
  "title": "Unblocking a toilet",
  "text": "From a stubborn blocked toilet , to a complete drain -wastepipe industrial jetwash-clean , the work was carried out carefully and thoroughly especially as was a brand new bathroom, Mark took his time , checked everytime and went back again and again to make sure drain and toilet were running how they were meant too . This was after we had contacted them as being let down by another plumber the day before, definitely recommended.",
  "postcode": "RG21",
  "date": "2022-07-01"
 },
 {
  "title": "Leak investigation of water coming through the kitchen ceiling from under bath",
  "text": "Fantastic service, prompt response by courteous staff and problem quickly resolved by Mark. It was found to be a split in the pop up bath waste hose which was also causing water to hit the electrics and take out all socket power.",
  "postcode": "RH12",
  "date": "2022-06-01"
 },
 {
  "title": "Leaking toilet",
  "text": "Excellent work. Called in the morning, job completed by 1300.",
  "postcode": "RH14",
  "date": "2022-06-01"
 },
 {
  "title": "Replacement of cold water header tank valve",
  "text": "Mark arrived at the agreed time and fixed the problem very quickly by fitting a new valve assembly and took away the old valve and left the area clean and tidy. A very efficient and friendly emergency service which I would use again.",
  "postcode": "KT9",
  "date": "2022-06-01"
 },
 {
  "title": "A leak behind toilet",
  "text": "Mark arrived within the time slot he estimated. He found the leak wasn't from a pipe as first thought but a new valve was needed. He replaced this part and the problem was solved. He was very efficient and I am very pleased with his service and I would call on him again.",
  "postcode": "BN2",
  "date": "2022-06-01"
 },
 {
  "title": "Replace leaking shower pump",
  "text": "Great service. Quick to respond, gave excellent advice regarding pump replacement options, and work was completed neatly and at a fair price.",
  "postcode": "RH10",
  "date": "2022-06-01"
 },
 {
  "title": "Cleared blocked toilet",
  "text": "Excellent, swift service. Highly recommend these guys!",
  "postcode": "TN6",
  "date": "2022-06-01"
 },
 {
  "title": "Fix overflow and change ballvalve",
  "text": "Terrific responsive service. Kind and considerate to my elderly mum, and very fair pricing",
  "postcode": "RH10",
  "date": "2022-05-01"
 },
 {
  "title": "Replace bathroom radiator",
  "text": "Excellent job. Very neat and tidy work.",
  "postcode": "RH15",
  "date": "2022-05-01"
 },
 {
  "title": "Change kitche tap",
  "text": "Completed",
  "postcode": "RH10",
  "date": "2022-05-01"
 },
 {
  "title": "Shower mixer leak",
  "text": "Nathan has completed the job neatly, efficiently and quickly. Very good service overall from calling to book until finishing the job. I will definitely recommend Evo, Nathan in particular. Thank you.",
  "postcode": "RH1",
  "date": "2022-05-01"
 },
 {
  "title": "Back boiler removed and new boiler installed",
  "text": "Amazing job done by Nathan and team, very professional and reasonably priced, job was completed quickly and to a high standard. I will not hesitate to call this company again should I need them, highly recommended.",
  "postcode": "GU1",
  "date": "2022-05-01"
 },
 {
  "title": "Fix 2 leaks",
  "text": "Fantastic service. Harvey was terrific. We'd had a chap out last week who was unable to find the leaks, but with perseverance Harvey was able to find and fix which is such a relief!",
  "postcode": "TN6",
  "date": "2022-05-01"
 },
 {
  "title": "Overflow",
  "text": "Job very well done, left bathroom really tidy too. Have used company in the past, highly recommended. Very quick response too. Thank you once again.",
  "postcode": "RH11",
  "date": "2022-05-01"
 },
 {
  "title": "Annual boiler service",
  "text": "This was the second year we have used EVO for our annual boiler service and we'll continue to do so. Very easy to make the booking via phone. Nathan, the engineer arrived on time, was very friendly, knowledgeable and tidy. Very easy online invoice and Gas Safety Certificate issued. Will def use again.",
  "postcode": "KT22",
  "date": "2022-05-01"
 },
 {
  "title": "Replacement of kitchen mixer tap.",
  "text": "Excellent service! Mark came the day after our request for a plumber and was very pleasant and gave an efficient service. No mess, everything cleared up after the work. Would thoroughly recommend and use again. Many thanks.",
  "postcode": "RH10",
  "date": "2022-05-01"
 },
 {
  "title": "Patio and driveway cleaned",
  "text": "Would recommend",
  "postcode": "GU14",
  "date": "2022-05-01"
 },
 {
  "title": "Boiler repair",
  "text": "Great work by these guys. Steve was able to more or less diagnose the problem over the phone before coming to us, allowing him to fix and totally resolve the problem on first visit",
  "postcode": "TN6",
  "date": "2022-04-01"
 },
 {
  "title": "Install shower",
  "text": "Great work throughout. Very easy to communicate with. Went along with their choice of shower and really glad I followed their recommendation as it's superb!",
  "postcode": "RH11",
  "date": "2022-04-01"
 },
 {
  "title": "Annual service of boiler",
  "text": "As ever I am completely happy with Nathan from Evo Plumbing, Heating and Drainage. Always pleasant, prompt, efficient and helpful.  I wouldn't dream of using any other plumbing company.  This visit was a routine service but I have had several other issues which have also been dealt with by Evo and I would not hesitate to recommend them to anyone.",
  "postcode": "RG41",
  "date": "2022-04-01"
 },
 {
  "title": "Install outside tap",
  "text": "Very happy with the work. The workman was very friendly and the work was done neatly too, with no mess.",
  "postcode": "TN6",
  "date": "2022-04-01"
 },
 {
  "title": "Central heating - gas boiler service",
  "text": "Nathan came to service our gas central heating system today. He was very friendly and knowledgeable. He clearly explained everything he was doing as he went and completed all remediation work while he was here. We received the gas safety certificate before he had even left our house which was great. We will definitely be using Nathan -EVO again. Thank you very much",
  "postcode": "RH6",
  "date": "2022-04-01"
 },
 {
  "title": "Dealt with a toilet blockage.",
  "text": "He rang me to ask details. When he arrived he was able to get to the root of the problem. All the time he was courteous and professional. The blockage in the toilet was fixed quickly and competently. I would certainly think of using this firm again if needed.",
  "postcode": "RH1",
  "date": "2022-04-01"
 },
 {
  "title": "Investigated boiler problem and installed new boiler",
  "text": "Fantastic service, our boiler broke down on a Sunday morning, our usual engineer couldn’t get out to us but contacted Evo who organised an engineer for the next day. They got the boiler working but it needed repairs. Evo quoted for the work plus the cost of a new boiler. Made sense to get a new boiler, this was installed within a week. Really pleased with the workmanship and service provided.",
  "postcode": "RH13",
  "date": "2022-04-01"
 },
 {
  "title": "Pre purchase drain survey",
  "text": "Really pleased with the service. Harvey bent over backwards to accommodate us before contract exchange. The CCTV survey report was produced very quickly after the survey and was clear and concise. Will definitely use again for further plumbing and heating work once the purchase is complete",
  "postcode": "RH10",
  "date": "2022-04-01"
 },
 {
  "title": "Boiler inspection and resolve pressure issue",
  "text": "Brilliant professional and reliable service.",
  "postcode": "RH13",
  "date": "2022-04-01"
 },
 {
  "title": "To supply and fit radiators",
  "text": "The work was carried out by Nathan, who was extremely helpful and considerate He performed all the work to a very high standard and we are very pleased with the result. We would not hesitate in recommending the company to anyone requiring central heating work.",
  "postcode": "GU21",
  "date": "2022-04-01"
 },
 {
  "title": "Boiler Service and Gas Safety Check",
  "text": "Excellent professional service delivered, a pleasure to deal with from start to finish - would definitely use again.",
  "postcode": "RH13",
  "date": "2022-04-01"
 },
 {
  "title": "He serviced my boiler and replaced a part",
  "text": "Nathan was excellent, he arrived early and fitted us in before my hospital appointment. Would absolutely recommend this company.",
  "postcode": "RH4",
  "date": "2022-04-01"
 },
 {
  "title": "Basin cleared from blockage",
  "text": "Mark was very efficient and the job was completed quickly and well",
  "postcode": "RH10",
  "date": "2022-04-01"
 },
 {
  "title": "Reduced length of time for hot water to come out of taps",
  "text": "Second time used and second time impressed. Punctual, professional and friendly",
  "postcode": "RH10",
  "date": "2022-04-01"
 },
 {
  "title": "Repair a leaking pipe",
  "text": "Evo returned my call quickly and a plumber was with me within an hour. He was polite, efficient and tidy. I would be glad to use Evo again.",
  "postcode": "RH2",
  "date": "2022-03-01"
 },
 {
  "title": "Trace and fix leak",
  "text": "Terrific responsive local service. Called on a Sunday and issue was resolved within 2 hours",
  "postcode": "RH10",
  "date": "2022-03-01"
 },
 {
  "title": "Install waste disposal unit",
  "text": "Great work. Friendly and dependable service. Will definitely be calling again for further work",
  "postcode": "TN7",
  "date": "2022-03-01"
 },
 {
  "title": "Installing a new boiler",
  "text": "Nathan installed a new boiler for us. His work was of excellent quality, he was extremely tidy and friendly and took the time to explain how everything worked and answered all of my questions. Excellent worker. I would highly recommend him.",
  "postcode": "RH12",
  "date": "2022-03-01"
 },
 {
  "title": "Powerflush heating system to resolve boiler error and restore heat",
  "text": "Steve from EVO plumbing and heating did a fantastic job. He managed to resolve a boiler fault previously reported by another engineer, and also restored our heating to a level way beyond what we previously had. We had a powerflush done by another company several years ago. EVO were slightly more expensive but the difference in equipment used and improved results are totally incomparable.",
  "postcode": "RH10",
  "date": "2022-03-01"
 },
 {
  "title": "Fix leak in en-suite bathroom",
  "text": "Top rate service. Acted very quickly, arriving within an hour of call, which was great as I had water dripping through a downstairs light fitting. Spent time after fix helping me clear up which was greatly appreciated.",
  "postcode": "RH3",
  "date": "2022-03-01"
 },
 {
  "title": "Diagnose noise and replace valve",
  "text": "First class - kept us informed about when he would arrive. Found the problem straightaway, obtained spare part and fitted. Worked neatly and successfully.",
  "postcode": "RH12",
  "date": "2022-03-01"
 },
 {
  "title": "Annual service for unvented cylinder system",
  "text": "Aaron did a great job as always. Would 100% recommend",
  "postcode": "RH10",
  "date": "2022-03-01"
 },
 {
  "title": "Boiler Service",
  "text": "Really pleased with Aaron from Evo completing a standard boiler service. They were able to visit the same week I made the enquiry and were quick to reply. Very friendly and polite and gave some very honest and practical advice without and ‘upselling’. Highly recommend and will definitely use them again.",
  "postcode": "RH10",
  "date": "2022-03-01"
 },
 {
  "title": "Water leak from the emersion heater.",
  "text": "Contacted EVO in the morning and Mark (plumber) came out at about 5pm and fixed the leak within the hour.",
  "postcode": "RH13",
  "date": "2022-03-01"
 },
 {
  "title": "Fix a leak on the cistern",
  "text": "This was an awkward job involving replacing the filler valve in a cistern. Difficult to reach. Mark sourced the part and fitted the new valve at the second attempt. He also connected a tap on some flexi hose so that the water could be cut off to the cistern without shutting the whole house down. Mark is a friendly and very competent workman.",
  "postcode": "RH6",
  "date": "2022-03-01"
 },
 {
  "title": "Cylinder, tank and sundries replacement",
  "text": "During the past week Steve and co. Have made several visits for differing plumbing problems. Their work on every task has been excellent. I have already booked them for July 2022 for a boiler replacement",
  "postcode": "RH6",
  "date": "2022-03-01"
 },
 {
  "title": "Unblocking a toilet",
  "text": "A toilet rim block and a previous plumber's drain rod rubber plunger were successfully removed.",
  "postcode": "RH10",
  "date": "2022-03-01"
 },
 {
  "title": "Repair leaks on boiler system",
  "text": "Many thanks to team EVO. They responded swiftly and worked conscientiously to rectify problems from install work carried out by another local firm. Great that they could turn this round so quickly for us.",
  "postcode": "GU12",
  "date": "2022-03-01"
 },
 {
  "title": "Fix gutter connection to underground drainage",
  "text": "Great Communication, reliability and pricing. Very warm, friendly service too",
  "postcode": "RH10",
  "date": "2022-02-01"
 },
 {
  "title": "Replaced pump and fitted new thermostats to some radiators",
  "text": "Nathan was very efficient, knowledgeable and explanatory. He left his work areas tidy and clean. Highly recommend.",
  "postcode": "RG10",
  "date": "2022-02-01"
 },
 {
  "title": "Boiler and Megaflow service",
  "text": "Can't fault it. Punctual, good quality and a really friendly engineer",
  "postcode": "RH10",
  "date": "2022-02-01"
 },
 {
  "title": "Boiler Service",
  "text": "Really efficient, friendly service. Quick turnaround when booking the service, good communication and reliable. Service and advice was thorough and comprehensive.",
  "postcode": "GU8",
  "date": "2022-02-01"
 },
 {
  "title": "Central Heating Boiler Service",
  "text": "First time using EVO. Engineer Nathan was knowledgeable, personable and extremely helpful. Would definitely recommend.",
  "postcode": "RH12",
  "date": "2022-02-01"
 },
 {
  "title": "Repair leak through ceiling",
  "text": "Very Grateful to EVO for the quick turnaround. Called late afternoon and problem sorted within two hours of first contact.",
  "postcode": "RH11",
  "date": "2022-02-01"
 },
 {
  "title": "Boiler Fix",
  "text": "A timely fix to get heat back on for the weekend. Steve was superb from first contact through to job completion. He Was able to come out and diagnose and fix the boiler all on the same day. Very reasonable charges too.",
  "postcode": "TN6",
  "date": "2022-01-01"
 },
 {
  "title": "Replacement boiler",
  "text": "Brilliant service, very friendly and efficient. Job was completed quickly and well. No mess.",
  "postcode": "RH12",
  "date": "2022-01-01"
 },
 {
  "title": "Checkatrade Welcome",
  "text": "Checkatrade would like to welcome EVO Plumbing, Heating and Drainage to Crowborough. They have been a Checkatrade Member since 2012. EVO Plumbing, Heating and Drainage specialise in Plumbing services.",
  "postcode": "TN6",
  "date": "2022-01-01"
 },
 {
  "title": "Fix leak and service boiler",
  "text": "We were very grateful to get a quick response and resolution to our leaking boiler. We made this appointment at very short notice and were very happy with the friendly service and very reasonable charges",
  "postcode": "GU14",
  "date": "2022-01-01"
 },
 {
  "title": "Sorted problem with overflowing drain",
  "text": "Our drain overflowed yesterday and we had to deal with a pretty nasty mess. We called EVO plumbing and they came out early afternoon. Harvey was our technician and he was amazing! Prompt, professional, and courteous. He cleared our drainage issue in about 30 minutes and cleaned the area when he finished.",
  "postcode": "RH10",
  "date": "2021-12-01"
 },
 {
  "title": "Put in a new Saniflo - commissioned and tested",
  "text": "He was absolutely brilliant, really good. Very polite, very clean and tidy. Would definitely recommend him.",
  "postcode": "CR6",
  "date": "2021-12-01"
 },
 {
  "title": "Boiler Repair",
  "text": "Very responsive, friendly and charged very fairly.",
  "postcode": "RH3",
  "date": "2021-12-01"
 },
 {
  "title": "Replacement boiler",
  "text": "Excellent job carried out, tidy, clear communication of the process. Very pleasant and professional.",
  "postcode": "BN8",
  "date": "2021-12-01"
 },
 {
  "title": "Repair leaking toilet",
  "text": "Very quick response to an urgent job. Friendly and very fair price",
  "postcode": "RH10",
  "date": "2021-12-01"
 },
 {
  "title": "Gutter clearance",
  "text": "Fantastic work. Friendly, polite and good rates.",
  "postcode": "BN6",
  "date": "2021-12-01"
 },
 {
  "title": "Fitting a boiler",
  "text": "My boiler packed up last week and within 5 days I had a new glow worm unit with a 10 year guarantee. From the time I contacted Evo to the time the final checks were made by the most efficient and polite engineer they were nothing but professional, knowledgable, courteous and hard working. I have used many tradesmen over the last 40 years and Evo are right up there!!!",
  "postcode": "SM6",
  "date": "2021-12-01"
 },
 {
  "title": "Clearing a blocked drain.",
  "text": "We are amazed and upset that this negative feedback has been published. We had previously quoted and scheduled in with this customer a fixed price drain clearance. On the day we were due to do the work the customer messaged me to try and force a price reduction on the fixed price that had already been discussed and agreed. I told the customer the price was non negotiable and we would therefore be cancelling the job. We should have every right to charge what is a fair price, and feel it is quite wrong for a customer to try and force a price reduction on what has already been agreed and scheduled in.. We have spoken to checkatrade about this, but have been told that despite appealing, the feedback will be published, therefore vindicating the customers actions. We feel this is quite wrong. I did ask to speak with a manager within the complaints team, but never heard back.",
  "postcode": "RH11",
  "date": "2021-11-01"
 },
 {
  "title": "Replace heating pipework after boiler install",
  "text": "Came late in the day (at our request) after a very busy day and completed the work quickly and fixed the issue right away.",
  "postcode": "RH11",
  "date": "2021-11-01"
 },
 {
  "title": "Cleared guttering of debris",
  "text": "Fast and efficient",
  "postcode": "BN41",
  "date": "2021-11-01"
 },
 {
  "title": "Preform power flush and new central heating pump installed",
  "text": "Excellent work, efficiently completed in reasonable time by Nathan Francis.",
  "postcode": "RH11",
  "date": "2021-10-01"
 },
 {
  "title": "Yearly service carried out",
  "text": "Nathan carried a yearly service for my boiler and checked my hot water, radiator heating and underfloor heating working in order. He gave me all the advice how I should get the maximum efficiency from my heating system",
  "postcode": "RH10",
  "date": "2021-10-01"
 },
 {
  "title": "Service boiler",
  "text": "Nathan turned up on time and did a very good job , explained what he was doing went very will. 5 stars",
  "postcode": "GU14",
  "date": "2021-10-01"
 },
 {
  "title": "Remove old combi boiler and replace with a new one.",
  "text": "Came to service old boiler upon checking it found it had gone wrong could be fixed but couldnt guarantee if anything else would after being fixed as 15 years plus old.Agreed on new boiler .Fitted within a week and is much better than old one .Nathan did a great job and does know his stuff .Have used EVO a lot before and very happy with service.Another great job done.",
  "postcode": "RH12",
  "date": "2021-10-01"
 },
 {
  "title": "To make all the water pipes in an extension to be above ground instead of underfloor",
  "text": "A very neat job carried out quickly and all the  mess and waste cleared up. All done by a very good and likeable plumber at a good price.",
  "postcode": "RG5",
  "date": "2021-10-01"
 },
 {
  "title": "Service boiler Install new boiler",
  "text": "New boiler installed promptly-work completed in one day. Engineer Nathan was polite and considerate and kept me informed about the work during the day. He cleaned all areas he had used and the house was left as he found it. An excellent job and I can fully recommend Evo Services. The previous week Evo sent gas engineer Steve to service my 12 year old boiler. He gave me what I considered to be honest advice as to how reliable this boiler would be in future. It was my decision to replace the boiler which Steve arranged to be done in a week. An excellent service from Evo.",
  "postcode": "RH5",
  "date": "2021-10-01"
 },
 {
  "title": "Service and check boiler.",
  "text": "I was very impressed with Nathan he was very polite, very clean got on with the job and also gave me some good advice about my heating regulations things I hadn’t been told about before, so hopefully my bills may be a little cheaper next time. Thank you.",
  "postcode": "GU3",
  "date": "2021-10-01"
 },
 {
  "title": "Install new boiler and pump",
  "text": "Nathan was brilliant. Showed up on time, very professional and thorough. Really pleased with this company and it’s nice to deal with a professional engineer. Would definitely recommend.",
  "postcode": "KT16",
  "date": "2021-09-01"
 },
 {
  "title": "Replacing boiler",
  "text": "Nathan did a great job. He explained clearly what products were available and the different outcomes each would give. This allowed me to choose the most suitable product. He fitted it quickly and efficiently, and cleared up any mess. I would definitely recommend him and will use the company again.",
  "postcode": "RH13",
  "date": "2021-09-01"
 },
 {
  "title": "Service boiler and provide gas safety certificate.",
  "text": "Lovely, nice and efficient job. Turned up exactly on time, worked quickly and tidily and completed the service exactly as requested. Competitive pricing.  Would definitely use again.",
  "postcode": "GU14",
  "date": "2021-09-01"
 },
 {
  "title": "Repair of boiler",
  "text": "Efficient service, Nathan kept us informed throughout the repair.",
  "postcode": "RH6",
  "date": "2021-09-01"
 },
 {
  "title": "Powerflush",
  "text": "Nathan was very professional. He arrived very promptly, and worked extremely hard without any breaks. He explained what he was doing throughout the processand cleared up very well at the end. He was polite and efficient.",
  "postcode": "CR3",
  "date": "2021-09-01"
 },
 {
  "title": "System Power Flush and replace 3 radiators",
  "text": "Very happy with the work completed. Nathan was tidy, professional and did a very thorough job, I would recommend this company",
  "postcode": "RH19",
  "date": "2021-08-01"
 },
 {
  "title": "Replacing a kitchen and outside tap, as well as fixing a stopcock.",
  "text": "We chose Evo as the company have previously completed plumbing work for us and we were very happy with the professional service. Aaron did the work for us and did a great job. He was efficient, friendly, professional and very good at his job, which he clearly takes pride in. We will definitely continue to use Evo when we need any further plumbing jobs done.",
  "postcode": "RH10",
  "date": "2021-08-01"
 },
 {
  "title": "First, a drainage survey. Then, repairing a damaged sewer pipe.",
  "text": "We are very satisfied with the service provided by EVO Home Services and can only recommend them. Harvey's helpful drainage showed that one pipe needed urgent work, so we scheduled for EVO to address this. This repair was done timely and efficiently. Steve kept us informed during the works. The damage was more than expected - there was even a puddle of water at the corner of the house, unable to drain due to a heavily blocked-silted pipe. We were very glad the survey had picked this up and Steve was able to address it. The billing was fair considering the additional work involved. Great Job!",
  "postcode": "RH10",
  "date": "2021-08-01"
 },
 {
  "title": "Power flushing of central Heating system",
  "text": "Nathan from EVO communicated prior to arrival, arrived on the job on time and was thoroughly professional. Nathan carried out his work efficiently and always kept the customer up to date on progress and what he was actually doing ( a font of knowledge). The work has been completed to a professional standard and you can see and feel the difference in our heating system. Nathan completed the job by ensuring he cleaned up after his work and left the premises as he found it. An excellent job and a very happy customer- many thanks, will highly recommend and will personally use again.",
  "postcode": "GU14",
  "date": "2021-08-01"
 },
 {
  "title": "Boiler service",
  "text": "Fantastic The engineer rang to in form me he was 20 mins away Arrived promptly. Extremely helpful. Very nice easy to talk to very knowledgeable. Worked efficiently but not rushing. Very happy",
  "postcode": "GU1",
  "date": "2021-08-01"
 },
 {
  "title": "Remove a large radiator and cap off supply at room entry point.",
  "text": "Nathan completed an excellent job today. He de-pressurized and drained the radiator and removed it. He was very knowledgeable about combi boilers and re-pressurized the central heating, checking it heated up properly. Will definitely use this company again.",
  "postcode": "RH6",
  "date": "2021-08-01"
 },
 {
  "title": "Boiler service",
  "text": "Great communication, arrived promptly, very helpful and professional. You have gained a new customer going forward",
  "postcode": "GU5",
  "date": "2021-08-01"
 },
 {
  "title": "Replace Radiators",
  "text": "Excellent work from Nathan. Booked a day, arrived on-time, clean and tidy work, all completed as agreed.",
  "postcode": "RH10",
  "date": "2021-07-01"
 },
 {
  "title": "Repair to leaking pipe joint",
  "text": "A leak was identified under kitchen sink with potential for serious flooding. EVO Plumbing responded very quickly and within two hours Nathan arrived and quickly and efficiently solved the problem. A very impressive response by a pleasant and cheerful plumber. Very pleased and thoroughly recommend.",
  "postcode": "RH16",
  "date": "2021-07-01"
 },
 {
  "title": "New boiler plus associated work",
  "text": "Such a good job and such nice people. You can just tell when you are dealing with trustworthy people and these guys are from initial diagnosis to Nathan coming to do the work. He was incredibly polite, tidy, courteous and hard working taking time to explain aspects of the work to a total novice like me. Couldn’t recommend highly enough.",
  "postcode": "RH3",
  "date": "2021-07-01"
 },
 {
  "title": "Fixing a shower above bath",
  "text": "We moved into a new build property last Christmas and there was no shower over the bath. Called EVO and Harvey came and priced everything up which with a very competitive quote. Completed the installation of the shower above the bath and fitted new taps within a few hours. He also fitted the shower screen. The work was done to a high standard and the shower is great. He even added extra silicone around the newly fitted shower screen and extra support for the shower rod. Would highly recommend EVO.",
  "postcode": "BN6",
  "date": "2021-06-01"
 },
 {
  "title": "Fixing a kitchen tap that would not turn off",
  "text": "Excellent service. New part required and fitted same day. Would highly recommend.",
  "postcode": "RH10",
  "date": "2021-06-01"
 },
 {
  "title": "CCTV",
  "text": "I used EVO (Harvey) to complete a CCTV drain survey. I could not recommend him enough. He found out the cause for the drain blockage and advised how to prevent further ussues",
  "postcode": "RH11",
  "date": "2021-06-01"
 },
 {
  "title": "Installation of 2 radiators in the kitchen",
  "text": "We highly recommend Nathan. He is very knowledgeable, thorough, courteous and extremely tidy. We are very pleased with our new radiators. We would be very happy to use his services in the future.",
  "postcode": "RH15",
  "date": "2021-05-01"
 },
 {
  "title": "Repair leaking cistern, replace kitchen stopcock, replace outside tap",
  "text": "Work completed by Nathan to time, to budget and efficiently. Update sent with regard to arrival time. Immediate response by phone. Particularly recommended for customers who wish to make an appointment by phone (rather than book anonymously online).",
  "postcode": "GU2",
  "date": "2021-05-01"
 },
 {
  "title": "Rebuilt old manhole gully and installed new inspection lid with frame",
  "text": "Courteous and smooth job. The drains in our house are old and the concrete around one of the gullies was cracking and starting to collapse. Steve and Harvey did a great job of clearing out the drains, jetting to ensure no blockages, and then rebuilding. The concrete work was to a high standard and the new inspection cover looks so much better than the rusty, damaged one we had before.",
  "postcode": "GU10",
  "date": "2021-04-01"
 },
 {
  "title": "Dig out broken exterior drainage pipe, replace pipe and rebuild gullies.",
  "text": "The repairs were carried out by Harvey and Steve who, besides working quietly and efficiently, are two of the most courteous people we have encountered. After completing the work they left the area clean and tidy - even taking the trouble to rake the topsoil level ready for replanting. The finished job is a great credit to them.",
  "postcode": "TW11",
  "date": "2021-04-01"
 },
 {
  "title": "Replacing a faulty fan on a boiler",
  "text": "Aaron answered our emergency call yesterday and fixed our fan today. The service znd price was great. Many thanks Aaron",
  "postcode": "RH13",
  "date": "2021-04-01"
 },
 {
  "title": "Boiler fault repair",
  "text": "I would definitely recommend to family and friends, prompt response and very courteous.",
  "postcode": null,
  "date": "2021-04-01"
 },
 {
  "title": "Boiler leak",
  "text": "A huge “THANKS” to Aaron today. So so helpful, tidy and professional AND had a great sense of humour! Courteous and polite and diagnosed the problem in minutes. I will be recommending this company to friends and family. Stay safe. Regards Your Lancing customer today.",
  "postcode": null,
  "date": "2021-04-01"
 },
 {
  "title": "Resolving a flow issue following work undertaken by another plumber",
  "text": "Mark was fantastic. He was running a bit late but let us know. He was polite, professional and fixed the problem in no time at all. We would heartily recommend this service. Thanks Mark!",
  "postcode": "SM7",
  "date": "2021-03-01"
 },
 {
  "title": "Gas check of oven and hob, replacement of hob and compliance of safety regulations",
  "text": "British craftsmanship is alive and well. Excellent diagnostics skills. Work efficiently and effectively undertaken",
  "postcode": "RH1",
  "date": "2021-03-01"
 },
 {
  "title": "Replacement boiler installed",
  "text": "My boiler was leaking through the kitchen ceiling last Friday and so I hailed Evo to come to the rescue. Colin was here within half an hour. He inspected the old boiler and presented me with very honest options for repairs, or a new boiler. I decided upon the latter course. He confirmed his quote in writing on Sunday afternoon and Aaron arrived on Monday morning to carry out the work. Initially, Colin had given a time slot of 2 days for the job to be completed. Aaron, however, is a super engineer and all the work was finished in 6 hours. The boiler is a Glow Worm combi, with remote control.",
  "postcode": "RH16",
  "date": "2021-03-01"
 },
 {
  "title": "Repaired leaking toilet",
  "text": "I use this company all the time, really good service, I am so glad they could come out to me, the man that came is clean and tidy, leaves everything as best he can when he has finished",
  "postcode": "RH11",
  "date": "2021-02-01"
 },
 {
  "title": "Replacement of faulty ballcock",
  "text": "Mark kept us informed in respect of the appointment and arrived when expected, he replaced the part quickly and efficiently and tidied up after himself",
  "postcode": "RH17",
  "date": "2021-02-01"
 },
 {
  "title": "New washing machine tap and mains stop cock fitted",
  "text": "Excellent job carried out by Mark who turned up at the promised time slot and carried out both jobs very efficiently",
  "postcode": "RH14",
  "date": "2021-02-01"
 },
 {
  "title": "Leaking shower tray investigated and resolved",
  "text": "Water stains on kitchen ceiling indicated leaking shower tray above. Called EVO and Mark arrived the next morning. Potential sources of the leak were systematically eliminated and Mark then removed the old silicone around the tray, cleaned up the area and re-siliconed to a high standard. I have used EVO in the past and the high standard of service was maintained.",
  "postcode": "RH16",
  "date": "2021-02-01"
 },
 {
  "title": "Fix the central heating-hot water system",
  "text": "Boiler failed on Thursday. Steve came on Friday and got it working again. He noticed that the pump was leaking. Promised to come back on Monday, which he did. Fitted a new pump, serviced the boiler and repressurised the system. Also showed us how to fix the condensate problem that he had identified. Very friendly and professional service. I would recommend this company unreservedly. Very prompt and timely communications which was much appreciated!",
  "postcode": "RH13",
  "date": "2021-02-01"
 },
 {
  "title": "Leak from downstairs toilet",
  "text": "Mark was very proficient. He quickly discovered the issue and was able to rectify the problem to high standard and great repair.",
  "postcode": null,
  "date": "2021-01-01"
 },
 {
  "title": "Diagnosed hot water issue, fit new valve and actuator, replaced kitchen tap",
  "text": "Excellent service, happy to recommend. Nathan went well above and beyond in getting everything sorted for us, overcame unforeseen challenges and the results are perfect! Heating, boiler, radiators, water flow, nothing seemed to be a problem for him. House was left spotless after visit.",
  "postcode": "RH13",
  "date": "2021-01-01"
 },
 {
  "title": "Fixed leak from pressure release part of the boiler",
  "text": "Really pleased with the service from Evo, great communication, we were kept informed all the way through. Nathan was polite and helpful, he showed us what was wrong and how he was able to sort it. Will definitely use again.",
  "postcode": "RH12",
  "date": "2021-01-01"
 },
 {
  "title": "Blocked kitchen sink and slow draining shower",
  "text": "Problem solved and they worked late to fit us in on the same day we contacted them. Super service.",
  "postcode": "RH12",
  "date": "2021-01-01"
 },
 {
  "title": "Safe disconnection of dishwasher and maintenance of shower",
  "text": "The job was actually done in December 2020 but I forgot to submit in a review",
  "postcode": "RH10",
  "date": "2021-01-01"
 },
 {
  "title": "Stop cock valve and kitchen tap installed",
  "text": "Work done efficently.",
  "postcode": "RH12",
  "date": "2021-01-01"
 },
 {
  "title": "Replacing faulty toilet flushes x2",
  "text": "Really impressive service from Mark. Came the same day I called and kept me updated on timings. Carried out the work very efficiently and just got on with the job. There were a few extra things that needed sorting and he dealt with everything we needed. Would highly recommend and will definitely call again if we need further work carried out.",
  "postcode": "RH1",
  "date": "2021-01-01"
 },
 {
  "title": "Fixed a pipe leaking under the kitchen sink unit",
  "text": "Young man named Mark and he was brilliant and he had to saw some of the bottom of the unit away to get to the pipe. He took out two shelves and put it all back and cleaned up after him. Couldn't wish for anyone better.",
  "postcode": "RH5",
  "date": "2021-01-01"
 },
 {
  "title": "He cleared the side drain as the kitchen sink was cligged",
  "text": "Mark was very thorough and professional. He immediately found the root cause of the issue and within half an hour resolved a major problem for us",
  "postcode": "RH10",
  "date": "2021-01-01"
 },
 {
  "title": "Replaced a part in toilet cistern",
  "text": "Arrived earlier than expected. Diagnosed the problem, got the part from his van and fitted it. Very quick, neat and tidy job.",
  "postcode": "RH11",
  "date": "2021-01-01"
 },
 {
  "title": "Replacement of old leaking pipe",
  "text": "Mark quickly assessed the problem and cut out and replaced the leaking steel pipe with a copper pipe.",
  "postcode": null,
  "date": "2020-12-01"
 },
 {
  "title": "The cistern for upstairs wc was continually running, the cistern was taken out, fitted a new syphon in grey plastic and cut out the copper pipework, fitted a new flexible isolating valve connector, re assembled everything",
  "text": "I would certainly recommend him, very clean and polite, I used to be a Plumber 65 years ago, we had things in common, we got on very well, tidied up after himself, nothing was too much trouble",
  "postcode": null,
  "date": "2020-12-01"
 },
 {
  "title": "Leak under bathroom sink repaired",
  "text": "Mark was an absolute star. He arrived in the middle of a crisis as we had a leaking pipe. He handled the job very professionally and I felt very sure that he was confident in the job he had to do, there was no fuss and no mess whatsoever. He had to come back and fit a new tap that he had ordered and again was courteous and just got on with the job in hand. Excellent service! Would definitely use the company again.",
  "postcode": null,
  "date": "2020-12-01"
 },
 {
  "title": "Replaced two flush valves for two toilets",
  "text": "Mark was a lovely chap. Reviewed the job a week or so ago. Managed to source the parts in about a week. Came round and fitted them no fuss at all. No issues. Good job done.",
  "postcode": null,
  "date": "2020-12-01"
 },
 {
  "title": "Repairing the taps on the shower fitting (put new taps on) 2nd job the pipe on the wc was leaking",
  "text": "Very quick to respond, came very promptly and just got on with the work. Attitude was very good. Pleased with the work",
  "postcode": null,
  "date": "2020-12-01"
 },
 {
  "title": "Connected 2 water pipes",
  "text": "The job was completed efficiently, I felt it was a bit expensive.",
  "postcode": null,
  "date": "2020-12-01"
 },
 {
  "title": "Dripping tap, leaking sing and blocked sink",
  "text": "Called in the morning, left a message, they called back within the hour and arranged for a plumber to come out about 2:00. Plumber arrived on time and finished the jobs very quickly.",
  "postcode": null,
  "date": "2020-12-01"
 },
 {
  "title": "Outside drain blockage fixed",
  "text": "Fantastic service from Harvey. I called in the evening as I had a blocked drain. I asked for an estimate for the cost of unblocking and was given an estimated range of prices dependent on the work involved. Harvey was able to attend the next working day and did a fantastic job of unblocking the drain and the price was exactly as agreed. Would definitely recommend and will use again in the future. Thank you!",
  "postcode": null,
  "date": "2020-12-01"
 },
 {
  "title": "Remove badly leaking water filter and tap off to avoid further problems",
  "text": "Phoned Evo at 11am arrived at 3.30 stayed about 1.30 minutes. Contacted this company after other local plumbers unable to help today Mark made a good job and as such would use this company again.",
  "postcode": null,
  "date": "2020-11-01"
 },
 {
  "title": "Broken pipe to radiator replaced and thermostatic valve installed",
  "text": "Steve was efficient and fixed the problem. He was careful to explain what needed doing and courteous throughout his visit.",
  "postcode": null,
  "date": "2020-11-01"
 },
 {
  "title": "Replacing kitchen tap and finishing silicon sealant around sink",
  "text": "Excellent workmanship",
  "postcode": null,
  "date": "2020-11-01"
 },
 {
  "title": "Replace radiators",
  "text": "Very courteous, very good quality work and good covid precautions. Customer service very good.",
  "postcode": null,
  "date": "2020-11-01"
 },
 {
  "title": "Repair damaged drain at side of property",
  "text": "We were worried that the drainage repair would be messy and problematic, but needn't of worried as the service and quality of work was excellent.",
  "postcode": null,
  "date": "2020-11-01"
 },
 {
  "title": "Put new tap in and cleared waste pipe",
  "text": "Very good, very polite and did an excellent job.",
  "postcode": null,
  "date": "2020-11-01"
 },
 {
  "title": "Toilet flush repair",
  "text": "All work done well and quietly. Great clearing up afterwards.",
  "postcode": null,
  "date": "2020-11-01"
 },
 {
  "title": "Unblocked sink",
  "text": "Called at 9.30,arrived within the hour, quickly identified and fixed problem quietly and efficiently.Veery good service",
  "postcode": null,
  "date": "2020-11-01"
 },
 {
  "title": "Changed new taps",
  "text": "Very happy with tradesmen, very nice. Would highly recommend",
  "postcode": null,
  "date": "2020-11-01"
 },
 {
  "title": "Install Kitchen Tap",
  "text": "Nathan did a very good job installing my kitchen tap. He always observed Covid restrictions while working. I will definitely be using Evo for my heating and plumbing in the future.",
  "postcode": null,
  "date": "2020-11-01"
 },
 {
  "title": "One radiator removed - a new radiator installed in a different place. New thermostats on 5 radiators.",
  "text": "I was delighted in everyway with the work completed and also with how helpful Nathan was. He kept me fully informed both before the appointment and also on the day. I will definitely be using this company again and would recommend them.",
  "postcode": null,
  "date": "2020-11-01"
 },
 {
  "title": "Fit three new radiators.",
  "text": "Nathan did a fantastic job. He explained exactly what if he was doing and always asked our opinion if there was an option about how something could be done. He was very polite and knowledgeable, offering us advice about optimum boiler settings, positioning of thermostat and how radiators could be removed for decorating in the future. He did all this whilst remaining COVID-Safe. I would 100% recommend and would definitely use again. Many thanks",
  "postcode": null,
  "date": "2020-11-01"
 },
 {
  "title": "Gas check of oven and hob, replacement of hob and compliance of safety regulations",
  "text": "British craftsmanship is alive and well. Excellent diagnostics skills. Work efficiently and effectively undertaken",
  "postcode": null,
  "date": "2020-11-01"
 },
 {
  "title": "Plumbing in new gas hob",
  "text": "Work was completed on time and within the agreed price despite it taking longer than expected",
  "postcode": null,
  "date": "2020-11-01"
 },
 {
  "title": "Drain clearance",
  "text": "Contacted EVO via Checkatrade after finding out my tenants drain was blocked. Needed it resolved ASAP. EVO were able to visit the following day. They were friendly, courteous, polite and, most importantly, sorted out the blockage! The price for the job was reasonable as well. 10 out of 10. Would 100% use again and would definitely recommend. Thank you EVO.",
  "postcode": null,
  "date": "2020-10-01"
 },
 {
  "title": "Securing outside tap for the autumn-winter",
  "text": "Mr. Turtle arrived promptly, he knew what to do, and the job was finished very quickly.",
  "postcode": null,
  "date": "2020-10-01"
 },
 {
  "title": "Kitchen sink taps replaced and stabiliser bar fitted under sink",
  "text": "Mark was very efficient, worked quietly and went out of his way to ensure the work was carried out to a good standard. I have used Evo plumbers before, Steve, Harvey and Mark make a great team. I can thoroughly recommend them.",
  "postcode": null,
  "date": "2020-10-01"
 },
 {
  "title": "Fitted kitchen sink",
  "text": "Did a great job on fitting the kitchen sink, I would recommend them and would use them again.",
  "postcode": null,
  "date": "2020-10-01"
 },
 {
  "title": "Boiler Service and gas safety",
  "text": "After speaking with Harvey, I told him it was fairly urgent. Not only he accommodated my request, he fitted around my schedule and promptly on time. All specialised equipment was used to carry out necessary checks and Harvey's approach and attention to detail was impeccable. I would definitely use them again.",
  "postcode": null,
  "date": "2020-10-01"
 },
 {
  "title": "Leaking drain valve on radiator",
  "text": "Fast, efficient, tidy, good communications - can't fault it.",
  "postcode": null,
  "date": "2020-10-01"
 },
 {
  "title": "Stop cock and washing machine valve-tap replacement.",
  "text": "Although Mark was a little later than planned, he ensured that he reached me on the day specified and the work he carried out was of a high quality. This is the second time he has done some work for me and both times he has been very professional, clean, tidy and polite. Recommended.",
  "postcode": null,
  "date": "2020-10-01"
 },
 {
  "title": "Shower unit removal and replacement",
  "text": "Very helpful in setting up appointment at a convenient time.  Mark arrived on time, was polite and courteous and completed the work on time and to a very good standard. Faultless :)",
  "postcode": null,
  "date": "2020-10-01"
 },
 {
  "title": "Replaced central heating pump",
  "text": "Nathan came out to fix our central heating. He quickly identified the problem and replaced our central heating pump. What really impressed me was how thorough he was, and how he was willing to discuss in depth the different options for sorting out our dysfunctional heating system definitively. Very likely to get work done with them in future.",
  "postcode": null,
  "date": "2020-10-01"
 },
 {
  "title": "Cleared blockage in kitchen pipe",
  "text": "Nice neat and tidy work. Punctual and polite.",
  "postcode": null,
  "date": "2020-10-01"
 },
 {
  "title": "He took out an old shower fitting and fitted a new one, he also replaced a dripping tap cartridge, he also put in a short length of hose",
  "text": "Punctual, courteous, he completed the work very well and overall my wife and I thought he had a good attitude",
  "postcode": null,
  "date": "2020-10-01"
 },
 {
  "title": "New washing machine valve fitted. Hot valve capped.",
  "text": "My second time using Evo. Pleased with the quality of the work done and the friendly, professional young man. Explained what he was doing and cleaned up afterwards. Reasonable price will use Evo again.",
  "postcode": null,
  "date": "2020-10-01"
 },
 {
  "title": "Replacement of Pump, amendments to pipework and a central heating system flush",
  "text": "Nathan from Evo Plumbing and Heating was excellent! He worked very hard all day, was updating me throughout the day on progress and what he was doing and finding with regards to the problem on our heating system. He had to get under floor boards but took great care with getting flooring up to gain access and cleared and put everything back as it was found (in fact it was probably a bit cleaner when he left if truth be known!). I would have no hesitation recommending Evo Plumbing as this is the 2nd time I've used them and both times they have been excellent.",
  "postcode": null,
  "date": "2020-09-01"
 },
 {
  "title": "Clear blockage and fix leak",
  "text": "Very Impressed with all round service",
  "postcode": null,
  "date": "2020-09-01"
 },
 {
  "title": "Changed the main tap in the kitchen as it was leaking",
  "text": "Nathan was really excellent, very professional and courteous, I would definitely recommend them.",
  "postcode": null,
  "date": "2020-09-01"
 },
 {
  "title": "Resealed shower tray and cleared drainage pipes",
  "text": "The work was done to a very high standard I would be very happy to use them again.",
  "postcode": null,
  "date": "2020-09-01"
 },
 {
  "title": "Fix leak under bath",
  "text": "Great work. Quick response, polite tidy, and good value",
  "postcode": null,
  "date": "2020-09-01"
 },
 {
  "title": "Fixing toilet leak",
  "text": "Some initial confusion about timing, but otherwise professional and charged as quoted.",
  "postcode": null,
  "date": "2020-09-01"
 },
 {
  "title": "Boiler service and fot magnetic filter",
  "text": "Second time I have used EVO. Again the service was faultless.",
  "postcode": null,
  "date": "2020-09-01"
 },
 {
  "title": "Old radiator removed and new one installed",
  "text": "A little bit of confusion over which member of the team would be come to do the work but all was resolved nicely. Work was done to a high standard with clear communication of options available.",
  "postcode": null,
  "date": "2020-09-01"
 },
 {
  "title": "Fixed busty shower controls",
  "text": "Amazing service!! Super fast arrival to an emergency water leak- Mark was fantastic and really professional. Thank you! Will definitely recommend!!",
  "postcode": null,
  "date": "2020-09-01"
 },
 {
  "title": "Bathroom leak repaired",
  "text": "Very impressed - plumber inspired confidence and was pleasant and very efficient",
  "postcode": null,
  "date": "2020-09-01"
 },
 {
  "title": "New ball valve in cold water tank",
  "text": "Mark was punctual, polite, tidy, and carried out his work efficiently. He also advised me about a couple of other plumbing -related issues before leaving. Excellent job - will use again. Many thanks, Mark.",
  "postcode": null,
  "date": "2020-08-01"
 },
 {
  "title": "New toilet cistern",
  "text": "A bit concerned that the screws holding the cistern to the wall are not tight.",
  "postcode": null,
  "date": "2020-09-01"
 },
 {
  "title": "Balancing radiators",
  "text": "Nathan did a great job. He explained what he was doing and why. Very polite and tidy too.",
  "postcode": null,
  "date": "2020-08-01"
 },
 {
  "title": "Kitchen tap replaced",
  "text": "Work done in a thoroughly professional way.",
  "postcode": null,
  "date": "2020-08-01"
 },
 {
  "title": "New soakaway",
  "text": "Excellent job in very difficult, rainy conditions. They worked exceptionally hard .",
  "postcode": null,
  "date": "2020-08-01"
 },
 {
  "title": "Fix emergency leak, replace stopcock",
  "text": "Very helpful, friendly and efficient.",
  "postcode": null,
  "date": "2020-08-01"
 },
 {
  "title": "Unblocking of sink, checking of leaking dishwasher, replacement of flush valve",
  "text": "Punctual, tidy, professional",
  "postcode": null,
  "date": "2020-08-01"
 },
 {
  "title": "Clearing down pipe",
  "text": "Work carried out efficiently and as agreed",
  "postcode": null,
  "date": "2020-08-01"
 },
 {
  "title": "New ball vale and isolate valve for cold storage tank",
  "text": "Simple but awkward job that was well done.",
  "postcode": null,
  "date": "2020-08-01"
 },
 {
  "title": "Unblocked sink in bathroom loosened taps in bath, fitted new kitchen tap",
  "text": "No comments given.",
  "postcode": null,
  "date": "2020-08-01"
 },
 {
  "title": "Put new basin in bathroom",
  "text": "No comments given.",
  "postcode": null,
  "date": "2020-08-01"
 },
 {
  "title": "Replace flush valve",
  "text": "Excellent work, very pleased, very pleasant young man",
  "postcode": null,
  "date": "2020-08-01"
 },
 {
  "title": "Powerflush of heating system to restore working boiler",
  "text": "Excellent work throughout. Did exactly as they said with fantastic results, were tidy and kept us informed from first booking to completion. Will definitely use again and recommend",
  "postcode": null,
  "date": "2020-08-01"
 },
 {
  "title": "Leack in the bathroom taps",
  "text": "Job well exercuted. Happy with the end results.",
  "postcode": null,
  "date": "2020-08-01"
 },
 {
  "title": "New Kitchen Tap",
  "text": "The plumber was very polite and conscientious. He did the job steadily and efficiently, and cleaned up after himself. I would definitely consider using this company again, and will recommend them to others.",
  "postcode": null,
  "date": "2020-08-01"
 },
 {
  "title": "Toilet repairs",
  "text": "I had a toilet that needed urgent repair and Mark attended to resolve the issue. What initially appeared to be a simple issue turned out to be a compete nightmare job that was awkward in every way. Mark was absolutely brilliant, single mindedly finding resolutions to every challenge, whilst working in a 30+ degree heatwave with no windows in a cramped environment...\r A few weeks later, a had a separate issue that needed looking at, and I didn't hesitate to book Evo again, asking specifically for Mark.\r Once again, he was brilliant and fully resolved the issue perfectly.\r Thank you Mark!",
  "postcode": null,
  "date": "2020-08-01"
 },
 {
  "title": "Renewed Ball Valve to old water tank",
  "text": "Prompt ,efficient and fairly priced task carried out in a pleasant manner",
  "postcode": null,
  "date": "2020-08-01"
 },
 {
  "title": "Fix broken toilet flush",
  "text": "Service was fast and efficient and fixed the problem within a couple of hours, leaving everything tidy.",
  "postcode": null,
  "date": "2020-07-01"
 },
 {
  "title": "Emergency repair of burst radiator leak. Removal of radiator. Repair of over flow from",
  "text": "Very Professional, Enthusiastic to do a good job. Helpful and friendly.",
  "postcode": null,
  "date": "2020-07-01"
 },
 {
  "title": "Leaking pipe found and joint replaced.",
  "text": "Arrived sooner than expected. Located my issue promptly and dealt with it professionally. I would recommend.",
  "postcode": null,
  "date": "2020-07-01"
 },
 {
  "title": "New fill valve",
  "text": "Very courteous, neat and careful work.",
  "postcode": null,
  "date": "2020-07-01"
 },
 {
  "title": "Not specified by customer.",
  "text": "Efficient and friendly service.",
  "postcode": null,
  "date": "2020-07-01"
 },
 {
  "title": "Repaired a leaking tap.",
  "text": "No comments given.",
  "postcode": null,
  "date": "2020-07-01"
 },
 {
  "title": "Serviced our boiler",
  "text": "Stephen is efficient, polite, affordable and a great worker. Thanks so much. He is a brilliant plumber.",
  "postcode": null,
  "date": "2020-07-01"
 },
 {
  "title": "Outside tap replaced",
  "text": "Quick service, good customer service and work completed to high standard.",
  "postcode": null,
  "date": "2020-06-01"
 },
 {
  "title": "Locate leak from toilet cistern. Supply and fit new cistern.",
  "text": "Prompt and efficient service. Excellent work.",
  "postcode": null,
  "date": "2020-06-01"
 },
 {
  "title": "Fitted a tap",
  "text": "Great service",
  "postcode": null,
  "date": "2020-06-01"
 },
 {
  "title": "Fixed emergency leak",
  "text": "Called to emergency leak even though committed on another job came quickly and resolved the issue. Very impressed with work.",
  "postcode": null,
  "date": "2020-06-01"
 },
 {
  "title": "Replaced a concealed cistern",
  "text": "Mark removed a broken cistern and replaced it with a new one in a space which was very difficult to access. Mark was courteous and carried out the work in a professional manner.",
  "postcode": null,
  "date": "2020-06-01"
 },
 {
  "title": "Fit new garden tap which was leaking",
  "text": "I was very pleased with this young plumber who fitted a new garden tap for us. We have just had a very bad experience with Crown Roofing and are very upset. By the way we were treated by them.",
  "postcode": null,
  "date": "2020-06-01"
 },
 {
  "title": "Replacement of leaking mixer tap",
  "text": "Very friendly, courteous and efficient service.",
  "postcode": null,
  "date": "2020-06-01"
 },
 {
  "title": "Replace sink taps",
  "text": "Mark came to replace two ancient taps on our downstairs cloakroom sink, unfortunately whilst he was removing one the porcelain cracked but he arranged a replacement sink which was fitted two days later as soon as it was available with the help of Steve. Both Mark and Steve were friendly and professional throughout and althoguh the job didn't go to plan issue was handled well. I would be happy to use the firm again.",
  "postcode": null,
  "date": "2020-06-01"
 },
 {
  "title": "Repaired 2 toilets.",
  "text": "Very efficient and helpful and also very good with Covid19 procedure etc. Very good service and have booked in for another separate job.",
  "postcode": null,
  "date": "2020-05-01"
 },
 {
  "title": "Replace a feed pipe and internal valve on to a toilet cistern",
  "text": "Within an hour of calling for help Mark arrived and an hour later he left with all new parts fitted on a saturday.",
  "postcode": null,
  "date": "2020-05-01"
 },
 {
  "title": "Kitchen taps replaced",
  "text": "Having repaired toilets the previous week we asked him to come back and replace our kitchen taps. Really good, clean and tidy too. Very pleased.",
  "postcode": null,
  "date": "NaN-aN-aN"
 },
 {
  "title": "Water mains replacement",
  "text": "Turned up on time and carried out the work to a high degree",
  "postcode": null,
  "date": "2020-05-01"
 },
 {
  "title": "Fixing of leak from cold water pipe above kitchen ceiling",
  "text": "Came to my rescue when I had a leaking pipe, very helpful, efficient and friendly",
  "postcode": null,
  "date": "2020-05-01"
 },
 {
  "title": "New shower fitted",
  "text": "Great finish, was polite and cleaned up after himself. Would definitely recommend!",
  "postcode": null,
  "date": "2020-05-01"
 },
 {
  "title": "Clear blockage and fix leak",
  "text": "Superb service -most efficient and man very pleasant would definitely recommend them again.",
  "postcode": null,
  "date": "2020-04-01"
 },
 {
  "title": "New Cistern",
  "text": "Very Good.",
  "postcode": null,
  "date": "2020-04-01"
 },
 {
  "title": "Boiler Breakdown During Coronavirus",
  "text": "We called Evo Home Services when our boiler stopped working. Stephen Morgan came out a day later who was able to fix our boiler within the hour. He was very efficient and kept within the 2 metre distance, he sanitised everything he touched, he wore a mask for protection for himself and us. Would defiantly recommend their services!",
  "postcode": null,
  "date": "2020-04-01"
 },
 {
  "title": "Serviced and repaired boiler",
  "text": "Really excellent service today, the boiler was seviced and repaired. Steve took care observe all the guidelines regarding corona virus. He wore a face mask and disinfected everything he touched including the door handles. He was very knowledge and did a great job. Really reassuring as one of the household is immunosuppressed.",
  "postcode": null,
  "date": "2020-04-01"
 },
 {
  "title": "Fitted waste water pipe leak behind bathroom sink",
  "text": "Prompt efficient and courteous.",
  "postcode": null,
  "date": "2020-04-01"
 },
 {
  "title": "Pipe blockage",
  "text": "Excellent from start to finish. Prompt and personable workers.",
  "postcode": null,
  "date": "2020-04-01"
 },
 {
  "title": "Called in to fix a new tap and sort poor pressure problem out.",
  "text": "From making the call he arrived spot on time and got straight on with the job very good.",
  "postcode": null,
  "date": "2020-03-01"
 },
 {
  "title": "Replace bathroom tap and pipes",
  "text": "Very quick response to leak. Repaired very quick and a very good job.",
  "postcode": null,
  "date": "2020-03-01"
 },
 {
  "title": "Very high quickly a very friendly service",
  "text": "I would highly recommend very polite, value for money and great service",
  "postcode": null,
  "date": "2020-03-01"
 },
 {
  "title": "Very polite and friendly and the work is extremely good.",
  "text": "Extremly good. Work was done with skill and knowlegde thank you",
  "postcode": null,
  "date": "2020-03-01"
 },
 {
  "title": "Drains cleared out throughout premises, Evo discovered new issues whilst carrying out the work and completed it quickly and effortlessly.",
  "text": "Couldn’t have been happier with the service provided by EVO. The work was arranged and completed within 2 days. The guys were very efficient, friendly and tidy. Would highly recommend, it can be so difficult to find a reliable, reasonably priced plumber.",
  "postcode": null,
  "date": "2020-03-01"
 },
 {
  "title": "Flush of multi bore 30 year old heating system.",
  "text": "Colin did a thorough job on our 30 year old, very complicated system. Very satisfactory results. Very courteous and polite. Would always recommend",
  "postcode": null,
  "date": "2020-03-01"
 },
 {
  "title": "Replace full valve flush valve",
  "text": "No comments given.",
  "postcode": null,
  "date": "2020-02-01"
 },
 {
  "title": "Power flushing",
  "text": "Nice clean job pleasant experience",
  "postcode": null,
  "date": "2020-02-01"
 },
 {
  "title": "Unblocking exterior waste pipe",
  "text": "No comments given.",
  "postcode": null,
  "date": "2020-02-01"
 },
 {
  "title": "Replaced tap washer",
  "text": "Very speedy and efficient.",
  "postcode": null,
  "date": "2020-02-01"
 },
 {
  "title": "Fitted new sink",
  "text": "Excellent finish and very professional",
  "postcode": null,
  "date": "2020-02-01"
 },
 {
  "title": "Changed one TRV on radiator",
  "text": "Very quick response to a leaking valve. They were professional and friendly. I would have no hesitation in recommending Evo Home Services and will no doubt use them again in the future should the need arise.",
  "postcode": null,
  "date": "2020-02-01"
 },
 {
  "title": "Leaking pipe work",
  "text": "Very efficient and pleasant young man",
  "postcode": null,
  "date": "2020-02-01"
 },
 {
  "title": "Replaced flush valve",
  "text": "Prompt time keeping very pleasant manner efficient and careful",
  "postcode": null,
  "date": "2020-01-01"
 },
 {
  "title": "New heating system pump and power flush",
  "text": "Excellent. Good customer care skills. Made the effort to come round quickly. Was clear in advance on timescales and cost. Professional, competent, friendly, helpful and considerate. Would definitely use again.",
  "postcode": null,
  "date": "2020-01-01"
 },
 {
  "title": "Boiler replaced; open system replaced by cold system; system flushed; radiators replaced.",
  "text": "Great job getting our heating system up and going efficiently.",
  "postcode": null,
  "date": "2020-01-01"
 },
 {
  "title": "Put back piping under kitchen sink",
  "text": "Friendly and helpful with quick response.",
  "postcode": null,
  "date": "2020-01-01"
 },
 {
  "title": "Fixed leak in bath",
  "text": "No comments given.",
  "postcode": null,
  "date": "2019-12-01"
 },
 {
  "title": "Washing machine installed",
  "text": "Very quick and tidy installation of our machine and much cheaper than other quotes. Will definitely use again.",
  "postcode": null,
  "date": "2019-12-01"
 },
 {
  "title": "Score Breakdown",
  "text": "We have done several jobs at this property, often at very short notice and unsocial hours as we appreciate the occupant is very elderly and vulnerable. With this particular job we responded the same day and out of hours. We spoke with the carer regarding toilet replacement and both agreed further works regarding flooring and boxing-tiling could be done after the toilet install. He was more than happy with this as it meant time without a functioning toilet was kept to a minimum and the follow on works with a third party could be scheduled at their convenience.We were contacted by the elderly gentleman's son six weeks after fitting the replacement toilet. I assume this is the first time had seen the installation. It is unfortunate that he had not been involved at the outset as if we had given a different remit we could have given timings and costings accordingly.\r We did offer to reattend but this was declined.\r This feedback isn't a fair reflection of our company. Please view our other feedback which gives a more accurate reflection of our work and ethics.\r ",
  "postcode": null,
  "date": "2019-12-01"
 },
 {
  "title": "Replace programmer",
  "text": "No comments given.",
  "postcode": null,
  "date": "2019-12-01"
 },
 {
  "title": "Replacing diaphragm in toilet",
  "text": "Quick service, looked for the best solution for the problem and will with further advice",
  "postcode": null,
  "date": "2019-12-01"
 },
 {
  "title": "Not specified by customer.",
  "text": "Excellent service and arrived on time",
  "postcode": null,
  "date": "2019-11-01"
 },
 {
  "title": "Powerflush and boiler fix",
  "text": "We were very happy. Very professional, corteous, honest and clean. Hard working personnell.",
  "postcode": null,
  "date": "2019-11-01"
 },
 {
  "title": "Heating system leak",
  "text": "No comments given.",
  "postcode": null,
  "date": "2019-10-01"
 },
 {
  "title": "Toilet leaking and flush running.",
  "text": "Clean, efficient work. All tidy. Will use again.",
  "postcode": null,
  "date": "2019-10-01"
 },
 {
  "title": "New water tank",
  "text": "Very prompt reliable, clean and reasonably priced",
  "postcode": null,
  "date": "2019-10-01"
 },
 {
  "title": "Fitting a new shower pump",
  "text": "Arrived on time, fast tidy and good quality work.",
  "postcode": null,
  "date": "2019-10-01"
 },
 {
  "title": "Repair macerator",
  "text": "Very good service",
  "postcode": null,
  "date": "2019-10-01"
 },
 {
  "title": "Power flush",
  "text": "No comments given.",
  "postcode": null,
  "date": "2019-10-01"
 },
 {
  "title": "Replace toilet inlet valve",
  "text": "No comments given.",
  "postcode": null,
  "date": "2019-09-01"
 },
 {
  "title": "Inspection and rectification of two sink taps",
  "text": "Swift, efficient and friendly",
  "postcode": null,
  "date": "2019-09-01"
 },
 {
  "title": "Replacing a kitchen tap",
  "text": "",
  "postcode": null,
  "date": "2019-09-01"
 },
 {
  "title": "Reconnected flush on toilet.",
  "text": "Excellent service, we had started a job we couldn't complete and Harvey saved the day. We would definitely use EVO again.",
  "postcode": null,
  "date": "2019-09-01"
 },
 {
  "title": "Unblock drain",
  "text": "Very good.",
  "postcode": null,
  "date": "2019-08-01"
 },
 {
  "title": "Repair to kitchen taps.",
  "text": "Turned up on time and came on very short notice.",
  "postcode": null,
  "date": "2019-08-01"
 },
 {
  "title": "New Tap fitted and flush repaired in the bathroom",
  "text": "Harvey is always efficient, friendly reliable and has exceptional customer service skills. He always charges very reasonable rates for the work required compared to other national and local plumbing services I have used Evo Plumbing services for the past three years and I have found them to be both great value for money and great with customers. They never charge than what is absolutely necessary. If you want reliable, efficient, speedy, cost effective, honest plumbers who are gentlemanly in their manner and sincere problem solvers in their work then Evo Plumbers are for you! Thank you guys!",
  "postcode": null,
  "date": "2019-08-01"
 },
 {
  "title": "Fixed ancient shower (researched and sourced correct parts)",
  "text": "",
  "postcode": null,
  "date": "2019-08-01"
 },
 {
  "title": "New immersion heater.",
  "text": "Fast, efficient, polite and tidy service. Very happy.",
  "postcode": null,
  "date": "2019-08-01"
 },
 {
  "title": "Rectify leak and fix washer on tap.",
  "text": "Excellent service, work completed.",
  "postcode": null,
  "date": "2019-07-01"
 },
 {
  "title": "Boiler service",
  "text": "Arrived on time and did the work as described. Friendly and helpful",
  "postcode": null,
  "date": "2019-07-01"
 },
 {
  "title": "Change valve",
  "text": "Very efficient, friendly and helpful",
  "postcode": null,
  "date": "2019-06-01"
 },
 {
  "title": "Overflow running - replaced a valve",
  "text": "Good service. Came when they said they would. Kept us informed. Very reliable.",
  "postcode": null,
  "date": "2019-06-01"
 },
 {
  "title": "Mending the toilet flush.",
  "text": "Fantastic! Toilet mended efficiently.",
  "postcode": null,
  "date": "2019-06-01"
 },
 {
  "title": "Repair toilet leak.",
  "text": "Service and work excellent. Fantastic response.",
  "postcode": null,
  "date": "2019-06-01"
 },
 {
  "title": "Leak and stiff stopcock",
  "text": "Very capable",
  "postcode": null,
  "date": "2019-06-01"
 },
 {
  "title": "Drain blocked now running perfectly",
  "text": "Prompt, polite and excellent",
  "postcode": null,
  "date": "2019-06-01"
 },
 {
  "title": "Drain clearance + camera drain survey.",
  "text": "Quick, efficient + friendly.",
  "postcode": null,
  "date": "2019-06-01"
 },
 {
  "title": "Replacement of valve in expansion tank",
  "text": "Excellent... would highly recommend this company.",
  "postcode": null,
  "date": "2019-06-01"
 },
 {
  "title": "Pump replacement.",
  "text": "Great service, quick, efficient, tidy.",
  "postcode": null,
  "date": "2019-05-01"
 },
 {
  "title": "Repaired-Replaced old faulty ball valves.",
  "text": "Made effort to find relevant tank that had issues and locate stop cock when no-one knew where these were within our warehouse-offices. Worked efficiently, was courteous and seemed very knowledgeable. Tidied up and put everything back into place after finishing. Also total cost seems very reasonable.",
  "postcode": null,
  "date": "2019-05-01"
 },
 {
  "title": "Recommendations as how to fix a problem.",
  "text": "Very helpful.",
  "postcode": null,
  "date": "2019-05-01"
 },
 {
  "title": "Fitting an isolating valve for a gas hob.",
  "text": "Polite, clean, quick, and helpful. Completed the job as requested in a very short time.",
  "postcode": null,
  "date": "2019-04-01"
 },
 {
  "title": "Drains cleared and checked with camera.",
  "text": "Efficient and friendly. Exceptionally good service.",
  "postcode": null,
  "date": "2019-04-01"
 },
 {
  "title": "Toilet changed.",
  "text": "On time, knowledgeable ad friendly.",
  "postcode": null,
  "date": "2019-04-01"
 },
 {
  "title": "Clearing a blocked drain",
  "text": "No comments given.",
  "postcode": null,
  "date": "2019-03-01"
 },
 {
  "title": "Provided plumbing for power shower and WC",
  "text": "Good service and arrived on time. Very reliable.",
  "postcode": null,
  "date": "2019-03-01"
 },
 {
  "title": "Gas pipe in kitchen re-situated.",
  "text": "Excellent work efficiently carried out by a very pleasant man, I would thoroughly recommend this company.",
  "postcode": null,
  "date": "2019-03-01"
 },
 {
  "title": "Boiler service.",
  "text": "Very friendly and helpful.",
  "postcode": null,
  "date": "2019-02-01"
 },
 {
  "title": "Renewed valve on tank.",
  "text": "Very good service, arrived when they said, removed shoes. Great service.",
  "postcode": null,
  "date": "2019-02-01"
 },
 {
  "title": "Boiler service",
  "text": "Harvey arrived promptly",
  "postcode": null,
  "date": "2019-02-01"
 },
 {
  "title": "Fix leaky kitchen mixer tap",
  "text": "Fixed as requested. Checked for leaks after putting in tap and noticed a slow leak elsewhere under the sink that was previously there and fixed it.",
  "postcode": null,
  "date": "2019-02-01"
 },
 {
  "title": "New flush in toilet cistern.",
  "text": "Quick, friendly and efficient service.",
  "postcode": null,
  "date": "2019-01-01"
 },
 {
  "title": "Dripping tap",
  "text": "Courteous and efficient",
  "postcode": null,
  "date": "2019-01-01"
 },
 {
  "title": "Boiler annual service.",
  "text": "Quick efficient service.",
  "postcode": null,
  "date": "2019-01-01"
 },
 {
  "title": "Leak pipe behind basin",
  "text": "Excellent service polite and helpful.",
  "postcode": null,
  "date": "2019-01-01"
 },
 {
  "title": "Leak from pipe.",
  "text": "Kept in contact and worked very well.",
  "postcode": null,
  "date": "2019-01-01"
 },
 {
  "title": "Replace flush valve washers.",
  "text": "2nd time we have used EVO Plumbing different engineer but came wonderful service. Polite, tidy and happy to explain and answer questions.",
  "postcode": null,
  "date": "2019-01-01"
 },
 {
  "title": "Not specified by customer.",
  "text": "Quick and easy.",
  "postcode": null,
  "date": "2019-01-01"
 },
 {
  "title": "Blocked down pipe.",
  "text": "Excellent service, prompt, friendly.",
  "postcode": null,
  "date": "2018-12-01"
 },
 {
  "title": "Seized tap fixed",
  "text": "Excellent service. Fast, friendly and resolved the issue.",
  "postcode": null,
  "date": "2018-12-01"
 },
 {
  "title": "Central heating system - Replaced (Failed) Honeywell 28mm 2 port valve head and fitted inline cable connector.",
  "text": "Colin was very quick, efficient and knowledgeable on the problem and after visiting us late on the Fri 21st to assess the fault , he left us with a temporary fix-working central heating system and returned the next day (Saturday) with a new valve head assembly. The new part was fitted in less than an hour and the central heating is now working normally again. We are so pleased that Colin was able to fix this problem so promptly and we would definitely recommend him.",
  "postcode": null,
  "date": "2018-12-01"
 },
 {
  "title": "Gutter and drain cleaning",
  "text": "Everything was done according to plan. Efficient and prompt service .... recommended",
  "postcode": null,
  "date": "2018-12-01"
 },
 {
  "title": "Installing new bathroom radiator.",
  "text": "Conscientious work thoroughly satisfied.",
  "postcode": null,
  "date": "2018-12-01"
 },
 {
  "title": "Fixing the ball cock and valve in the loft based storage tan.",
  "text": "Very pleasant, efficient work carried out. Also gave notice of need to flush radiator system, will do this shortly.",
  "postcode": null,
  "date": "2018-12-01"
 },
 {
  "title": "Connection of shower.",
  "text": "First class service.",
  "postcode": null,
  "date": "2018-11-01"
 },
 {
  "title": "Not specified by customer.",
  "text": "Excellent service - was able to complete the job the same day I called. Great!",
  "postcode": null,
  "date": "2018-11-01"
 },
 {
  "title": "Replacement radiator value.",
  "text": "No comments given.",
  "postcode": null,
  "date": "2018-11-01"
 },
 {
  "title": "Leak detection + fix.",
  "text": "Excellent service, quick response + punctual.",
  "postcode": null,
  "date": "2018-11-01"
 },
 {
  "title": "Flush on downstairs, WC not working.",
  "text": "Colin arrived on time, did an excellent job and cleaned up all debris, I would highly recommend them.",
  "postcode": null,
  "date": "2018-11-01"
 },
 {
  "title": "New flush siphon fitted.",
  "text": "Excellent and efficient.",
  "postcode": null,
  "date": "2018-11-01"
 },
 {
  "title": "Boiler service.",
  "text": "Usual excellent service.",
  "postcode": null,
  "date": "2018-10-01"
 },
 {
  "title": "Fitted a new ball-cock.",
  "text": "Harvey came round when he said and Identified the problem almost immediately, he had the parts in his van and had the job done within 15 minutes for what I consider a very reasonable price, I also showed him a radiator that I had taken off and painted he attached to the pipes, filled and bled the radiator without charging me, not a big job but still he did not charge me, very nice guy.",
  "postcode": null,
  "date": "2018-09-01"
 },
 {
  "title": "Not specified by customer.",
  "text": "Very good service, clean and tidy.",
  "postcode": null,
  "date": "2018-09-01"
 },
 {
  "title": "Boiler service. Fix bath leak.",
  "text": "Used before so knew what service I was getting. Great service given as always. Strongly recommended.",
  "postcode": null,
  "date": "2018-08-01"
 },
 {
  "title": "Replace faulty tap.",
  "text": "Helpful, communicate, quick, replacement of faulty tap.",
  "postcode": null,
  "date": "2018-08-01"
 },
 {
  "title": "Mending a leaking pipe from the toilet",
  "text": "Prompt, competent, helpful and tidy",
  "postcode": null,
  "date": "2018-07-01"
 },
 {
  "title": "Radiator and towel rail fitted.",
  "text": "Colin was friendly, efficient and helpful and carried out the work well and at very short notice.",
  "postcode": null,
  "date": "2018-07-01"
 },
 {
  "title": "Unblocking a drain.",
  "text": "Harvey turned up on time, was well presented and polite. He assessed the problem and unblocked the drain effectively.",
  "postcode": null,
  "date": "2018-07-01"
 },
 {
  "title": "Unblocked a very blocked downstairs cloakroom loo.",
  "text": "Super impressed with the service and efficiency. Within 60 minutes of calling this company Colin the plumber was at my door and fixed the problem in minutes. I thought the fee was reasonable for a Saturday call out and appreciate you are paying for expertise, not an hourly rate so we are very satisfied and very relieved given the nature of the problem! Colin was a very pleasant, amenable fellow and clearly loves his job and the business he works for which is great to see.",
  "postcode": null,
  "date": "2018-07-01"
 },
 {
  "title": "Drain blocked and cleared.",
  "text": "Absolute perfection, quick, efficient, pleasant.",
  "postcode": null,
  "date": "2018-07-01"
 },
 {
  "title": "Service boiler",
  "text": "Pleased with the work",
  "postcode": null,
  "date": "2018-07-01"
 },
 {
  "title": "Replace kitchen tap.",
  "text": "Very quick and helpful.",
  "postcode": null,
  "date": "2018-07-01"
 },
 {
  "title": "Unblock drain satisfactorily.",
  "text": "No comments given.",
  "postcode": null,
  "date": "2018-06-01"
 },
 {
  "title": "Boiler service",
  "text": "Arrived on time, completed quickly.",
  "postcode": null,
  "date": "2018-06-01"
 },
 {
  "title": "Repair of a leak.",
  "text": "The work was carried out very efficiently by Colin who was very courteous indeed. He was friendly and professional. He arrived within half an hour of making the call. He explained what work needed to be carried out and got on with it. He removed his shoes to go upstairs. A great job! I was very impressed.",
  "postcode": null,
  "date": "2018-06-01"
 },
 {
  "title": "Emergency call out Sunday isolated leak returned a few days later for full repair",
  "text": "No comments given.",
  "postcode": null,
  "date": "2018-06-01"
 },
 {
  "title": "Leak detection outside valve replaced",
  "text": "Great friendly service very efficient and very quick.",
  "postcode": null,
  "date": "2018-06-01"
 },
 {
  "title": "Leak on mains water pipe fixed.",
  "text": "Our kitchen was being refitted and during the process of the old one being taken out a leak was discovered on our mains water pipe, halting all work until fixed. I phoned up Harvey who came round the next day to assess things, he then had someone come round that afternoon to fixed the leak! Tidy, quick and thoroughly sorted.",
  "postcode": null,
  "date": "2018-05-01"
 },
 {
  "title": "Unblock sink drain (outside).",
  "text": "Excellent prompt and efficient service, highly recommend.",
  "postcode": null,
  "date": "2018-04-01"
 },
 {
  "title": "Water leak in garage.",
  "text": "Polite, clean and tidy. Discovered problem quickly.",
  "postcode": null,
  "date": "2018-04-01"
 },
 {
  "title": "Replaced two isolation valves and shower cartridge.",
  "text": "Impressively speedy attendance for an urgent job. Friendly, polite, tidy and fixed problem.",
  "postcode": null,
  "date": "2018-04-01"
 },
 {
  "title": "Replace expansion vessel and TVR.",
  "text": "Very efficient, assessment and price before work done in minimum of fuss and all good.",
  "postcode": null,
  "date": "2018-04-01"
 },
 {
  "title": "Fix outside tap and pipes.",
  "text": "Excellent service. Quick response.",
  "postcode": null,
  "date": "2018-04-01"
 },
 {
  "title": "Cleaning of guttering.",
  "text": "Efficient, friendly and thorough.",
  "postcode": "Kent",
  "date": "2018-04-01"
 },
 {
  "title": "Replaced 3 port valve.",
  "text": "Fast service, clean + tidy, price right.",
  "postcode": null,
  "date": "2018-04-01"
 },
 {
  "title": "Replace valves on kitchen radiator.",
  "text": "No comments given.",
  "postcode": null,
  "date": "2018-04-01"
 },
 {
  "title": "Flush mechanism on toilet broken and replaced and ball cock replaced.",
  "text": "Prompt response and friendly and polite staff. Efficient and timely work and very tidy. Would use again.",
  "postcode": null,
  "date": "2018-04-01"
 },
 {
  "title": "Attended to frozen garden tap.",
  "text": "My garden tap froze, came completely off and we were faced with water pouring 6 feet high out onto the garden! Despite being a very busy day for them, Colin was with us within the hour and had it all fixed, when no-one else I called would even come out. Great friendly service - will definitely be using you again. You really saved the day!",
  "postcode": null,
  "date": "2018-03-01"
 },
 {
  "title": "New taps-shower fittings.",
  "text": "No comments given.",
  "postcode": null,
  "date": "2018-02-01"
 },
 {
  "title": "Replacing domestic cold water tank.",
  "text": "Excellent quality of work and friendly approach gave us full trust in the work and the company.",
  "postcode": null,
  "date": "2018-02-01"
 },
 {
  "title": "Clear downpipe.",
  "text": "Arrived on time, quick efficient service.",
  "postcode": null,
  "date": "2018-02-01"
 },
 {
  "title": "Guttering cleaned out back and front with satisfaction.",
  "text": "I watched the process, it was amazing and Harvey was a very friendly guy. I even had a look through the camera used to check.",
  "postcode": null,
  "date": "2018-02-01"
 },
 {
  "title": "Repairs to radiator valve.",
  "text": "No comments given.",
  "postcode": null,
  "date": "2018-02-01"
 },
 {
  "title": "New tap head fitted and dripping tap issue sorted.",
  "text": "Colin did a very thorough and efficient job, resolving the issue.",
  "postcode": null,
  "date": "2018-02-01"
 },
 {
  "title": "Blocked outside storm drain.",
  "text": "Absolutely top notch!! From phone call to arrival - 20 mins and on a Sunday!! Got to work and sorted the problem! Very happy and would definitely recommend!!!",
  "postcode": null,
  "date": "2018-01-01"
 },
 {
  "title": "Boiler service.",
  "text": "Used Harvey again as service great. You can relay on him to turn up and do a good job.",
  "postcode": null,
  "date": "2018-01-01"
 },
 {
  "title": "Replace toilet valve.",
  "text": "Great service!",
  "postcode": null,
  "date": "2017-12-01"
 },
 {
  "title": "Replace toilet siphon, boiler service.",
  "text": "As usual, Harvey arrived on time and did an excellent job, cheerfully and effectively overcoming unexpected challenges in replacement of the toilet siphon. I would not hesitate to recommend.",
  "postcode": null,
  "date": "2017-12-01"
 },
 {
  "title": "Boiler service",
  "text": "No comments given.",
  "postcode": null,
  "date": "2017-12-01"
 },
 {
  "title": "Boiler service.",
  "text": "Excellent.",
  "postcode": null,
  "date": "2017-12-01"
 },
 {
  "title": "Gutter clearing.",
  "text": "Very good and knowledgeable.",
  "postcode": null,
  "date": "2017-12-01"
 },
 {
  "title": "CCTV to track drains.",
  "text": "I needed my sewer-drains investigated to find exactly where they run under my patio and garden prior to building work. Very proficient and knowledgeable guy. Also, having lifted the manholes, the pipe was several feet down and hard to access, but he managed somehow. Great work and he didn't clock watch. Did the job for the agreed price.",
  "postcode": null,
  "date": "2017-12-01"
 },
 {
  "title": "Replace bathroom sink tap.",
  "text": "I contacted Harvey to replace a broken tap in my bathroom, having used his services before to service my boiler. He fitted me in at short notice and rang me shortly before to let me know what time he’d be coming. Am very pleased with his work. Thanks again Harvey.",
  "postcode": null,
  "date": "2017-12-01"
 },
 {
  "title": "Boiler service.",
  "text": "Work carried out swiftly and efficiently.",
  "postcode": null,
  "date": "2017-11-01"
 },
 {
  "title": "Plumbing in washing machine, mending leak",
  "text": "Prompt and efficient service, getting us started in new house.",
  "postcode": null,
  "date": "2017-11-01"
 },
 {
  "title": "Boiler service.",
  "text": "Thanks Harvey.",
  "postcode": null,
  "date": "2017-11-01"
 },
 {
  "title": "Boiler repositioned after previous installer had wrongly installed it.",
  "text": "Very good work. The engineers were friendly and informative.",
  "postcode": null,
  "date": "2017-11-01"
 },
 {
  "title": "New kitchen sink and tap fitted",
  "text": "Arrived on time and completed work to our satisfaction.",
  "postcode": null,
  "date": "2017-11-01"
 },
 {
  "title": "Boiler service.",
  "text": "Very courteous and efficient work. Highly recommended.",
  "postcode": null,
  "date": "2017-10-01"
 },
 {
  "title": "Remove airlock in cold water system in bathroom.",
  "text": "Colin was fast, efficient + knowledgeable.",
  "postcode": null,
  "date": "2017-10-01"
 },
 {
  "title": "Boiler service.",
  "text": "Excellent service, punctual, would highly recommend.",
  "postcode": null,
  "date": "2017-10-01"
 },
 {
  "title": "Restored heat to top floor radiators.",
  "text": "Excellent work. Good time keeping, clear communication, and work done at a fair price.",
  "postcode": null,
  "date": "2017-10-01"
 },
 {
  "title": "Washing machine pipe fixed",
  "text": "Very thorough.",
  "postcode": null,
  "date": "2017-10-01"
 },
 {
  "title": "New Taps, and Vent Pipe",
  "text": "I'm usually wary of calling tradesmen in and prefer normally tp try to give most things a go myself, but this time I didn't have the tools or the time. Evo had Great comms, were able to make it the same day and really got me out of a grim situation, Colin was friendly, relaxed and very helpful. He was attentive to his work and made sure that it was absolutely necessary to change the vent pipe, he did an outstanding job and the price was great too. Would definitely use again. A++++++",
  "postcode": null,
  "date": "2017-10-01"
 },
 {
  "title": "Score Breakdown",
  "text": "I would like to issue the following response to this feedback, We are surprised and upset about these comments as the customer gave no indication whatsoever that they were unhappy with our service, at the oustset the customer was advised tiles would need to be removed in order to investigate-trace the leak, and they were happy for us to proceed. We also advised that we would be happy to reinstate when the job was completed. With reference to the shower valve, we were acting directly from advice from the manufacturer's technical department which the customer was fully aware of as the phone call was made at his property and in his presence. It is rather puzzling why the customer asked us to return to carry out further work if they were so unhappy with the original work? If any customer is unhappy with our service we would bend over backwards to turn this round, but we were never given this opportunity. The customer never made us aware of any dissatisfaction, complaining and expressly asking that we do not contact them. Please view all other customer feedback for a more accurate indication of our workmanship and ethics.",
  "postcode": null,
  "date": "2017-09-01"
 },
 {
  "title": "Courtesy",
  "text": "Excellent, efficient and identified the problem quickly.",
  "postcode": null,
  "date": "2017-09-01"
 },
 {
  "title": "Replacement inlet valve on toilet.",
  "text": "Very pleased with same day service.",
  "postcode": null,
  "date": "2017-08-01"
 },
 {
  "title": "Unblocked a drain.",
  "text": "No comments given.",
  "postcode": null,
  "date": "2017-07-01"
 },
 {
  "title": "Replace kitchen tap.",
  "text": "Very prompt. Very helpful.",
  "postcode": null,
  "date": "2017-06-01"
 },
 {
  "title": "Resealed faulty sink wasteaway",
  "text": "A quick very efficient fix",
  "postcode": null,
  "date": "2017-06-01"
 },
 {
  "title": "Clearing out a blocked drain.",
  "text": "Had a great a really good turn around for the whole process. Didn't take long at all, was friendly and professional.",
  "postcode": null,
  "date": "2017-05-01"
 },
 {
  "title": "Toilet install",
  "text": "No comments given.",
  "postcode": null,
  "date": "2017-05-01"
 },
 {
  "title": "Not specified by customer.",
  "text": "Excellent service, prompt, professional and courteous.",
  "postcode": null,
  "date": "2017-04-01"
 },
 {
  "title": "Replace toilet fill valve.",
  "text": "Prompt call out , work done as requested , all good.",
  "postcode": null,
  "date": "2017-04-01"
 },
 {
  "title": "Removal of 2 x ball valves and capping of pipes.",
  "text": "Very reliable, turned up when expected, quality of work excellent. Will use again.",
  "postcode": null,
  "date": "2017-04-01"
 },
 {
  "title": "Lifted drain cover which had rusted solid",
  "text": "Arrived early and work was completed in friendly and helpful attitude.",
  "postcode": null,
  "date": "2017-03-01"
 },
 {
  "title": "Installed new toilet system.",
  "text": "Excellent service. Perfect job done at very reasonable price. Would definitely use again.",
  "postcode": null,
  "date": "2017-03-01"
 },
 {
  "title": "Unblock Drain at work address.",
  "text": "I rang Harvey at lunchtime and by about 2.30 he and his colleague were on site sorting the problem out. The drain was severely blocked and overflowing. It took them about 1.5 hours to clear it due to the issue but they duly did. They were polite and efficient. I'd have no problems recommending them.",
  "postcode": null,
  "date": "2017-03-01"
 },
 {
  "title": "Unblocking toilet.",
  "text": "Very good.",
  "postcode": null,
  "date": "2017-03-01"
 },
 {
  "title": "Gas service + safety certificate.",
  "text": "Good service.",
  "postcode": null,
  "date": "2017-03-01"
 },
 {
  "title": "Fixed toilet.",
  "text": "Great service. Thanks Colin.",
  "postcode": null,
  "date": "2017-03-01"
 },
 {
  "title": "Blocked hand basin.",
  "text": "Arrived promptly, work carried out efficiently by Colin.",
  "postcode": null,
  "date": "2017-03-01"
 },
 {
  "title": "Replaced 3 part valve and leak detection.",
  "text": "Very good and prompt.",
  "postcode": null,
  "date": "2017-03-01"
 },
 {
  "title": "Broken toilet-slow filling system.",
  "text": "Friendly service, came on time and explained the issues when asked, with advice on other issues too.",
  "postcode": null,
  "date": "2017-03-01"
 },
 {
  "title": "Replace valve by central heating pump.",
  "text": "Excellent service as always.",
  "postcode": null,
  "date": "2017-02-01"
 },
 {
  "title": "Boiler service and repair.",
  "text": "Great. Very prompt, explained all work, will use again and recommend.",
  "postcode": null,
  "date": "2017-02-01"
 },
 {
  "title": "Clean blocked drain.",
  "text": "Amazing quick service! Brilliant job, would thankfully recommend.",
  "postcode": null,
  "date": "2017-02-01"
 },
 {
  "title": "Fixed the leaky loo",
  "text": "Very friendly chap, quick fix.",
  "postcode": null,
  "date": "2016-12-01"
 },
 {
  "title": "Kitchen waste water drain unblocked.",
  "text": "Available within 1 days notice, turned up on time, fixed the problem quickly, was polite and courteous, and the invoice matched the price quoted.",
  "postcode": null,
  "date": "2016-12-01"
 },
 {
  "title": "Replacing two radiators and pop up bath waste plug.",
  "text": "Harvey did a terrific job. Nothing was too much trouble. Cleaned and tidied up after job completed. One of the few people that I would recommend to friends and family.",
  "postcode": null,
  "date": "2016-12-01"
 },
 {
  "title": "Fixed leak and replaced pump valves.",
  "text": "Attended promptly and fixed expertly.",
  "postcode": null,
  "date": "2017-08-01"
 },
 {
  "title": "Blocked toilet, low water pressure - difficult to flush",
  "text": "Colin arrived very promptly and did a thorough and efficient job. He was very pleasant and cleaned up afterwards. Highly recommended.",
  "postcode": null,
  "date": "2016-12-01"
 },
 {
  "title": "Power flush",
  "text": "Great service polite helpful really good service.",
  "postcode": null,
  "date": "2016-11-01"
 },
 {
  "title": "Fix heating",
  "text": "Excellent.",
  "postcode": null,
  "date": "2016-11-01"
 },
 {
  "title": "Repaired toilet leaking.",
  "text": "Prompt, friendly and so helpful, would definitely recommend this company. Thank you, Colin.",
  "postcode": null,
  "date": "2016-11-01"
 },
 {
  "title": "New stopcock.",
  "text": "Excellent time keeping, cleanliness and very courteous. Very pleasant young man.",
  "postcode": null,
  "date": "2016-11-01"
 },
 {
  "title": "Ball valve on cold water tank in loft replaced.",
  "text": "No comments given.",
  "postcode": null,
  "date": "2016-11-01"
 },
 {
  "title": "Replace dishwasher trap.",
  "text": "Excellent. Lovely chap. Really helped with been able to help at very short notice.",
  "postcode": null,
  "date": "2016-11-01"
 },
 {
  "title": "Bathroom tap replaced kitchen tap replaced.",
  "text": "Arrived on time, all work done very well.",
  "postcode": null,
  "date": "2016-11-01"
 },
 {
  "title": "Radiator work.",
  "text": "New radiators and drainage of radiator, excellent work.",
  "postcode": null,
  "date": "2016-11-01"
 },
 {
  "title": "Miscellaneous plumbing jobs.",
  "text": "As usual we are absolutely delighted with this company and would certainly recommend them to anyone who required plumbing work, no matter how difficult, in their home.",
  "postcode": null,
  "date": "2016-11-01"
 },
 {
  "title": "Cause of leak established and fixed.",
  "text": "Harvey called me back immediately and arranged for his colleague, Colin, to visit my home. Colin kept me updated on his arrival time on the day, and was very friendly and careful in his work. Colin also called back several times after the work was completed and texted to check that the leak had stopped completely and that we had no further problems. Thank you to Harvey and Colin - great service. I am sure I will be using you again in the future.",
  "postcode": null,
  "date": "2016-10-01"
 },
 {
  "title": "Fitting new radiator, fitting new electric shower unit",
  "text": "Excellent service, on time and to budget, and always helpful.",
  "postcode": null,
  "date": "2016-10-01"
 },
 {
  "title": "Fit filter to central heating system.",
  "text": "Very courteous and efficient service. Many thanks.",
  "postcode": null,
  "date": "2016-10-01"
 },
 {
  "title": "Replacement basin tap and shower head washer.",
  "text": "Very happy with the work Harvey carried out for us. Tidy work and a professional finish. I would definitely recommend.",
  "postcode": null,
  "date": "2016-10-01"
 },
 {
  "title": "Clearing of blocked drains.",
  "text": "Very responsive, on time, and helpful in explaining and then solving the problem.",
  "postcode": null,
  "date": "2016-10-01"
 },
 {
  "title": "Drainage clearance.",
  "text": "Wonderful! Did the job without any fuss and even gave suggestions on how to stop it happening again. Also checked other drains around our property without being asked. Would certainly recommend them.",
  "postcode": null,
  "date": "2016-10-01"
 },
 {
  "title": "Gas cooker connection with all safety checks carried out.",
  "text": "Very friendly, helpful and professional. Very clean and tidy.",
  "postcode": null,
  "date": "2016-10-01"
 },
 {
  "title": "Boiler service",
  "text": "Very helpful and prompt service",
  "postcode": null,
  "date": "2016-10-01"
 },
 {
  "title": "Boiler service",
  "text": "No comments given.",
  "postcode": null,
  "date": "2016-10-01"
 },
 {
  "title": "System check",
  "text": "Excellent",
  "postcode": null,
  "date": "2016-09-01"
 },
 {
  "title": "Replacement of a ball valve",
  "text": "Excellent service - polite friendly and tidy.",
  "postcode": null,
  "date": "2016-09-01"
 },
 {
  "title": "Replace water tank",
  "text": "Work done confidently and thoroughly tested.",
  "postcode": null,
  "date": "2016-09-01"
 },
 {
  "title": "Leak in cistern toilet pipe.",
  "text": "Would have this company back anytime. He came, he saw and he conquered. Nice guy too!",
  "postcode": null,
  "date": "2016-09-01"
 },
 {
  "title": "Clearing blocked drain.",
  "text": "Very good.",
  "postcode": null,
  "date": "2016-08-01"
 },
 {
  "title": "South out noise problem under sink and fixed.",
  "text": "Arrived on time, carried work as promised, would highly recommend this company.",
  "postcode": null,
  "date": "2016-08-01"
 },
 {
  "title": "Boiler service.",
  "text": "Very pleased with his work.",
  "postcode": null,
  "date": "2016-08-01"
 },
 {
  "title": "Fixed blocked toilet",
  "text": "Arrived on time. Identified the problem straight away + fixed. Charged fair price. Very tidy work. Recommended.",
  "postcode": null,
  "date": "2016-08-01"
 },
 {
  "title": "Cleared blocked external drain.",
  "text": "Prompt, quick and friendly, helpful.",
  "postcode": null,
  "date": "2016-08-01"
 },
 {
  "title": "Outside tap repair.",
  "text": "Very quick response. Well explained.",
  "postcode": null,
  "date": "2016-07-01"
 },
 {
  "title": "Boiler installation and removal of old boiler and rebriching.",
  "text": "Excellent, very clean and tidy.",
  "postcode": null,
  "date": "2016-07-01"
 },
 {
  "title": "Repair flush. Replace 2 loo seats.",
  "text": "Good service, on time, tidy.",
  "postcode": null,
  "date": "2016-07-01"
 },
 {
  "title": "Fixed a water leak.",
  "text": "No comments given.",
  "postcode": null,
  "date": "2016-07-01"
 },
 {
  "title": "Repair to toilet cistern (leaking badly).",
  "text": "Kind and competent.",
  "postcode": null,
  "date": "2016-07-01"
 },
 {
  "title": "Install tap in garage.",
  "text": "No comments given.",
  "postcode": null,
  "date": "2016-07-01"
 },
 {
  "title": "Replacement waste disposal unit.",
  "text": "Excellent service.",
  "postcode": null,
  "date": "2016-07-01"
 },
 {
  "title": "Fixed leaking shower.",
  "text": "Fast, quick and reliable.",
  "postcode": null,
  "date": "2016-07-01"
 },
 {
  "title": "Serviced stop valve and resolved leak.",
  "text": "On time, very polite. Solved problem immediately.",
  "postcode": null,
  "date": "2016-07-01"
 },
 {
  "title": "Installation of electric shower",
  "text": "Very professional service quality of work excellent very pleased thank you.",
  "postcode": null,
  "date": "2016-07-01"
 },
 {
  "title": "Sealant around shower.",
  "text": "Professional and friendly service",
  "postcode": null,
  "date": "2016-06-01"
 },
 {
  "title": "Fixing and mending leaky pipe behind bath.",
  "text": "Very good service and good price.",
  "postcode": null,
  "date": "2016-06-01"
 },
 {
  "title": "Replace shower.",
  "text": "Friendly and professional service, good communication.",
  "postcode": null,
  "date": "2016-06-01"
 },
 {
  "title": "New kitchen taps.",
  "text": "No comments given.",
  "postcode": null,
  "date": "2016-06-01"
 },
 {
  "title": "Leak, not straightforward in utility room.",
  "text": "No comments given.",
  "postcode": null,
  "date": "2016-06-01"
 },
 {
  "title": "Replace valve.",
  "text": "Turned up on time, very friendly and professional, could not be better.",
  "postcode": null,
  "date": "2016-06-01"
 },
 {
  "title": "Emergency call out for leak.",
  "text": "Arrived promptly and fixed problem. Excellent service, would recommend to everyone.",
  "postcode": null,
  "date": "2016-06-01"
 },
 {
  "title": "Repair two leaks, replace ball cock.",
  "text": "Friendly and reliable service. Efficient and clean repairs.",
  "postcode": null,
  "date": "2016-05-01"
 },
 {
  "title": "Fixed leaking taps-pipes.",
  "text": "Did a great job and didn't waste any time. I have no hesitation in recommending Harvey to others.",
  "postcode": null,
  "date": "2016-05-01"
 },
 {
  "title": "Power flush of heating system.",
  "text": "Good service and very friendly.",
  "postcode": null,
  "date": "2016-05-01"
 },
 {
  "title": "New water tank",
  "text": "They provided a great service and did an excellent job, would recommend strongly.",
  "postcode": null,
  "date": "2016-04-01"
 },
 {
  "title": "Stop leak in toilet.",
  "text": "As usual excellent job.",
  "postcode": null,
  "date": "2016-04-01"
 },
 {
  "title": "Attend to leak in kitchen coming from first floor.",
  "text": "Very prompt and efficient service. Would recommend.",
  "postcode": null,
  "date": "2016-04-01"
 },
 {
  "title": "Fitted inlet valve in toilet.",
  "text": "Steve fitted the valve in just over an hour. The price was very fair and Steve was efficient and very courteous. He left everything very clean and tidy. Steve and Harvey are both very pleasant and I would recommend them.",
  "postcode": null,
  "date": "2016-04-01"
 },
 {
  "title": "Utility plumbing installation and outside tap.",
  "text": "Arrived on time, tidy workman ship, very polite, will use again on future jobs.",
  "postcode": null,
  "date": "2016-04-01"
 },
 {
  "title": "Flushed central heating system.",
  "text": "Excellent service. Very thorough, clean and tidy. No mess. Explained everything.",
  "postcode": null,
  "date": "2016-04-01"
 },
 {
  "title": "Leaky tap fixed with part I had already purchased.",
  "text": "Plumber kept me informed when they had arrive. Than arrived on time. Polite and friendly.",
  "postcode": null,
  "date": "2016-04-01"
 },
 {
  "title": "Kitchen sink replacement and plumbing.",
  "text": "Harvey was able to do the job at short notice and to the quoted price. Professional and a good job done.",
  "postcode": null,
  "date": "2016-04-01"
 },
 {
  "title": "Suspected leave coming from washing machine waste pipe.",
  "text": "OK so Harvey agreed to come out to see me at very short notice. He identified there was actually no leak. He advise my daughter that there would be no call out charge and even agree to call myself to confirm this. A lovely helpful guy.",
  "postcode": null,
  "date": "2016-03-01"
 },
 {
  "title": "Replace ball valve.",
  "text": "Very efficient and prompt.",
  "postcode": null,
  "date": "2016-03-01"
 },
 {
  "title": "Replaced taps",
  "text": "He is a reliable, fairly priced chap. Did a good job.",
  "postcode": null,
  "date": "2016-03-01"
 },
 {
  "title": "Fit new expansion vessel",
  "text": "Had no problems at all. Have used them a couple of times and would definitely use them again.",
  "postcode": null,
  "date": "2016-03-01"
 },
 {
  "title": "Drain clearance.",
  "text": "Punctual, polite, very quick work. Thank you. Good rate.",
  "postcode": null,
  "date": "2016-03-01"
 },
 {
  "title": "Replacement flush.",
  "text": "Prompt response to call, helpful and carried out work quickly and to good standard.",
  "postcode": null,
  "date": "2016-03-01"
 },
 {
  "title": "Drain system and remove radiator and cap off",
  "text": "Very professional, courteous and efficiently done.",
  "postcode": null,
  "date": "2016-02-01"
 },
 {
  "title": "Under the sink pipe.",
  "text": "I am so pleased with the service and I will keep the name and use it again in the future.",
  "postcode": null,
  "date": "2016-02-01"
 },
 {
  "title": "Gas safety check boiler service.",
  "text": "Good service, punctual no problems.",
  "postcode": null,
  "date": "2016-02-01"
 },
 {
  "title": "Repair of stop tap plus valve.",
  "text": "Great service. Turned up on day of calling to fix leak. Very informative and friendly. Gave plenty of advice before leaving.",
  "postcode": null,
  "date": "2016-02-01"
 },
 {
  "title": "Fitting new taps.",
  "text": "Punctual, friendly, neat job.",
  "postcode": null,
  "date": "2016-01-01"
 },
 {
  "title": "Leak in shower (bathroom)",
  "text": "Very reliable and trustworthy.",
  "postcode": null,
  "date": "2016-01-01"
 },
 {
  "title": "Ball valve in old water tank - outside tap changed.",
  "text": "No comments given.",
  "postcode": null,
  "date": "2016-01-01"
 },
 {
  "title": "Toilet cistern siphon change.",
  "text": "Efficient, clean, quick.",
  "postcode": null,
  "date": "2016-01-01"
 },
 {
  "title": "Boiler service and overflow pipe feed",
  "text": "Friendly, efficient and solved the issue.",
  "postcode": null,
  "date": "2016-01-01"
 },
 {
  "title": "New taps and shower fitted to bath.",
  "text": "Good service. Quick, good price, reliable and good customer service.",
  "postcode": null,
  "date": "2016-01-01"
 },
 {
  "title": "Broken boiler",
  "text": "Steve, who is business partner of Harvey at AHT Under company name 1st call repair was excellent- checking to make sure my boiler was safe before offering option to to get it fixed. As it happens the repair is covered by my household insurance but if it hadn't have been I would have been happy to ask Steve to complete the work.",
  "postcode": null,
  "date": "2016-01-01"
 },
 {
  "title": "Water leakage from toilet.",
  "text": "I phoned Steve as I noticed a large amount of water coming from our boiler. He was helpful in trying to ensure someone could look at the problem for me today. His colleague Steve from Evo (a company recently merged with AHT Plumbing& Drainage) came around. He quickly found the problem (a leaking pipe in the bathroom above the kitchen). He advised me of likely costs, depending on what work he'd need to do. He didn't take unnecessary time in fixing the problem and was also very helpful in answering general boiler questions, cleaning up thoroughly afterwards. Polite, efficient, tidy - great service!",
  "postcode": null,
  "date": "2016-01-01"
 },
 {
  "title": "Repair of leaking toilet.",
  "text": "Came at the time he said he would, found the leak quickly and repaired it.",
  "postcode": null,
  "date": "2016-01-01"
 },
 {
  "title": "Range cooker installation",
  "text": "No comment given.",
  "postcode": null,
  "date": "2016-01-01"
 },
 {
  "title": "Work description not specified",
  "text": "Very happy with work. Very quick service, very polite and efficient.",
  "postcode": null,
  "date": "2015-12-01"
 },
 {
  "title": "Radiator replacement",
  "text": "Very good.",
  "postcode": null,
  "date": "2015-12-01"
 },
 {
  "title": "3 x tap replacement and one sun repair.",
  "text": "Very pleased with work. Will contact when additional works required.",
  "postcode": null,
  "date": "2015-12-01"
 },
 {
  "title": "Boiler service.",
  "text": "Friendly, courteous, punctual, overall very good.",
  "postcode": null,
  "date": "2015-12-01"
 },
 {
  "title": "Water softener unit removal.",
  "text": "This is the 2nd time I have used Harvey Turtle and found him to be honest, professional and reliable. Very impressed.",
  "postcode": null,
  "date": "2015-12-01"
 },
 {
  "title": "3 radiators fixed",
  "text": "Very efficient service, would certainly recommend.",
  "postcode": null,
  "date": "2015-12-01"
 },
 {
  "title": "Power-flush of central heating system.",
  "text": "Excellent service. Timely and efficient, friendly.",
  "postcode": null,
  "date": "2015-12-01"
 },
 {
  "title": "Supply and install a flush system.",
  "text": "Work was completed as expected and he was very professional, tidy and friendly.",
  "postcode": null,
  "date": "2015-11-01"
 },
 {
  "title": "Replace ball valve.",
  "text": "Very quick service, bathroom left clean and tidy, advise given on system installed already.",
  "postcode": null,
  "date": "2015-11-01"
 },
 {
  "title": "New radiator.",
  "text": "No comment given.",
  "postcode": null,
  "date": "2015-11-01"
 },
 {
  "title": "Advice given on heating system over the phone.",
  "text": "I called them because I had a problem with my heating system. Even though they were busy and couldn't come out there and then. They advised me to look at the pump, which is in the cupboard next to the tank, it was there I could smell a chard smell coming from the electrical connection. I went out and bought a new pump, fitted it and now my system works!!!! Although there is no need for them to come out anymore. It was their advice that helped me to fix my heating within hours.  Not many would do that, which is why I would recommend them and use again when needed.",
  "postcode": null,
  "date": "2015-12-01"
 },
 {
  "title": "Taps replaced, both bath and basin.",
  "text": "Great service and professional job done. Clean finish.",
  "postcode": null,
  "date": "2015-11-01"
 },
 {
  "title": "Loft and exterior insulation.",
  "text": "No comments given.",
  "postcode": null,
  "date": "2015-11-01"
 },
 {
  "title": "Boiler service.",
  "text": "After exchanging emails, a very presentable friendly man turned up to service our boiler. He was clean and tidy, even hoovered around behind the boiler, putting my house keeping to shame! Would definitely use again- great service and great price, very competitive rates.",
  "postcode": null,
  "date": "2015-11-01"
 },
 {
  "title": "Excellent",
  "text": "Friendly quick, professional and great price.",
  "postcode": null,
  "date": "2015-11-01"
 },
 {
  "title": "Boiler replacement.",
  "text": "Exemplary service! Job completed ahead of schedule. Harvey and his team have done a fantastic job, even carried out a few smaller jobs for us whilst on site and wouldn't accept anymore money for their trouble. Highly recommend AHT Plumbing and Drainage!",
  "postcode": null,
  "date": "2015-11-01"
 },
 {
  "title": "Fixed faulty tap in bathroom. Fixed low pressure outside tap.",
  "text": "Exceptional service, prompt, top quality work. Kept fully informed throughout the job. Have booked for further work.",
  "postcode": null,
  "date": "2015-11-01"
 },
 {
  "title": "Emersion heater.",
  "text": "No comments given.",
  "postcode": null,
  "date": "2015-11-01"
 },
 {
  "title": "Fix leaks in home and install shower and screen.",
  "text": "Leak investigated and found. Good suggestion made on resolving it. Shower screen and new shower installed. Excellent work in all, now have dry house.",
  "postcode": null,
  "date": "2015-11-01"
 },
 {
  "title": "Repair leak on basin and replace tap.",
  "text": "Excellent service, very professional, all left clean and tidy.",
  "postcode": null,
  "date": "2015-10-01"
 },
 {
  "title": "Boiler service.",
  "text": "Good work and friendly service.",
  "postcode": null,
  "date": "2015-10-01"
 },
 {
  "title": "Power flush.",
  "text": "Extremely professional service provided, friendly. Will be using them again.",
  "postcode": null,
  "date": "2015-10-01"
 },
 {
  "title": "Service of gas boiler and addition of radiator to existing system",
  "text": "Service completed on time. Radiator installed as specified.",
  "postcode": null,
  "date": "2015-10-01"
 },
 {
  "title": "Unblocking bath drain.",
  "text": "Brilliant response time, excellent service, good job, well done !!",
  "postcode": null,
  "date": "2015-10-01"
 },
 {
  "title": "Plumbing - fixed leak on toilet.",
  "text": "Excellent service. Quick response to call out. Friendly. Job completed quickly and to a high standard.",
  "postcode": null,
  "date": "2015-10-01"
 },
 {
  "title": "Work description not specified.",
  "text": "Harvey was a great help, after phoning with my problem he came around in half an hour. I will be doing further business with him.",
  "postcode": null,
  "date": "2015-10-01"
 },
 {
  "title": "Central heating problem",
  "text": "Central heating problem was quickly diagnosed, clean and tidy work.",
  "postcode": null,
  "date": "2015-10-01"
 },
 {
  "title": "Power flush of central heating system.",
  "text": "Harvey was very polite, professional and tidy. He carried out the job as described and in good time. Would highly recommend.",
  "postcode": null,
  "date": "2015-09-01"
 },
 {
  "title": "Fitting of trv valves to radiators.",
  "text": "Quick, tidy and efficient. Very good.",
  "postcode": null,
  "date": "2015-09-01"
 },
 {
  "title": "Dishwasher fitted. Shower investigation.",
  "text": "Very helpful.",
  "postcode": null,
  "date": "2015-09-01"
 },
 {
  "title": "Change taps in down stairs toilet and radiator leak.",
  "text": "Friendly, efficient service and explained what he had to do so we knew what to efficient.",
  "postcode": null,
  "date": "2015-09-01"
 },
 {
  "title": "Repaired toilet.",
  "text": "Excellent.",
  "postcode": null,
  "date": "2015-09-01"
 },
 {
  "title": "Unblock plumbing.",
  "text": "Came very quickly.",
  "postcode": null,
  "date": "2015-09-01"
 },
 {
  "title": "Plumbing in dish-washing and washing machine.",
  "text": "Very quick -price as quoted.",
  "postcode": null,
  "date": "2015-09-01"
 },
 {
  "title": "Boiler service and system bled.",
  "text": "Very good service.",
  "postcode": null,
  "date": "2015-08-01"
 },
 {
  "title": "Bal cock replace .",
  "text": "On time , perfect across board .",
  "postcode": null,
  "date": "2015-08-01"
 },
 {
  "title": "New toilet and wash basin in laundry room and replaced an old toilet in the bathroom.",
  "text": "He and his associate were very polite and completed the work in time. They were very tidy. I would definitely recommend them for their professionalism and quality of work.",
  "postcode": null,
  "date": "2015-08-01"
 },
 {
  "title": "Tap cartridge change.",
  "text": "Good work, brilliant!",
  "postcode": null,
  "date": "2015-08-01"
 },
 {
  "title": "Fixed leak in floor.",
  "text": "Clean and tidy work done in a timely fashion.",
  "postcode": null,
  "date": "2015-08-01"
 },
 {
  "title": "Leaking washing machine connections .",
  "text": "Quick response to initial call , timely visit and efficient service to resolve problem .",
  "postcode": null,
  "date": "2015-08-01"
 },
 {
  "title": "Replace ball valve.",
  "text": "Excellent.",
  "postcode": null,
  "date": "2015-08-01"
 },
 {
  "title": "Leak under kitchen sink.",
  "text": "Fast, efficient and a great overall service.",
  "postcode": null,
  "date": "2015-08-01"
 },
 {
  "title": "Fix sink drainage.",
  "text": "Plumber punctual, job well done.",
  "postcode": null,
  "date": "2015-07-01"
 },
 {
  "title": "Boiler service",
  "text": "Very good work, happy with.",
  "postcode": null,
  "date": "2015-07-01"
 },
 {
  "title": "Fit taps to sink, install waste, plumb in washing machine and dishwasher.",
  "text": "Harvey is a quality plumber. Arrived on time, very courteous and friendly. Would definitely recommend.",
  "postcode": null,
  "date": "2015-07-01"
 },
 {
  "title": "Replaced kitchen taps.",
  "text": "Great job, came on time. Friendly service. Highly recommended.",
  "postcode": null,
  "date": "2015-07-01"
 },
 {
  "title": "Sorting out a cistern problem and faulty tap.",
  "text": "Excellent service very prompt and friendly. Helpful.",
  "postcode": null,
  "date": "2015-07-01"
 },
 {
  "title": "New outside tap",
  "text": "Fast polite efficient.",
  "postcode": null,
  "date": "2015-07-01"
 },
 {
  "title": "Replace cartridge dripping tap.",
  "text": "Quick reply to call. Good communication expert skills.",
  "postcode": null,
  "date": "2015-07-01"
 },
 {
  "title": "Harvey was professional and the work completed is of a high standard.",
  "text": "We are very happy with not only the work but happy with who has been very friendly and professional.",
  "postcode": null,
  "date": "2015-07-01"
 },
 {
  "title": "Old boiler removed and new one fitted.",
  "text": "Extremely polite, professional clean personnel. Everything fully explained. Would definitely recommend this company.",
  "postcode": null,
  "date": "2015-07-01"
 },
 {
  "title": "Toilet handle replacement.",
  "text": "Reliable and efficient. Knowledgeable in his trade.",
  "postcode": null,
  "date": "2015-07-01"
 },
 {
  "title": "New boiler fitted.",
  "text": "Fast, clean service, finished on time for price quoted.",
  "postcode": null,
  "date": "2015-07-01"
 },
 {
  "title": "Fit new washing machine tap",
  "text": "Excellent service, brilliant communication, quick.",
  "postcode": null,
  "date": "2015-06-01"
 },
 {
  "title": "Replaced new tap in kitchen.",
  "text": "Very quick and reliable response to an emergency.",
  "postcode": null,
  "date": "2015-06-01"
 },
 {
  "title": "Replacement water heater.",
  "text": "They diagnosed the problem quickly and found a replacement system which they came back to fit within a couple of hours. They were efficient, tidy and pleasant. We'd be happy to use them again.",
  "postcode": null,
  "date": "2015-06-01"
 },
 {
  "title": "Installation of chrome pipe connection to fridge freezer.",
  "text": "Very helpful, courteous, and on time kept in touch until appointment.",
  "postcode": null,
  "date": "2015-06-01"
 },
 {
  "title": "Fix 2 toilets.",
  "text": "Punctual, polite and professional, would happily recommend.",
  "postcode": null,
  "date": "2015-06-01"
 },
 {
  "title": "Check for leak, new tap head.",
  "text": "Good - helpful and friendly.",
  "postcode": null,
  "date": "2015-06-01"
 },
 {
  "title": "Repaired WC and tap.",
  "text": "Prompt, friendly, efficient.",
  "postcode": null,
  "date": "2015-06-01"
 },
 {
  "title": "Ball valve in loft.",
  "text": "No comments given.",
  "postcode": null,
  "date": "2015-06-01"
 },
 {
  "title": "Take out radiators replace new radiators.",
  "text": "Excellent service, went through what he was doing, to improve what was replaced. Cleaned and tidied up when finished.",
  "postcode": null,
  "date": "2015-06-01"
 },
 {
  "title": "Drain unblocking.",
  "text": "Blocked drains from sink.",
  "postcode": null,
  "date": "2015-06-01"
 },
 {
  "title": "Oven disconnection.",
  "text": "Courteous, on time, pleasure to deal with-Next job with Harvey already booked.",
  "postcode": null,
  "date": "2015-06-01"
 },
 {
  "title": "Leakage from shower tiling.",
  "text": "Quick and efficient diagnosis and remedy on the spot, very pleased.",
  "postcode": null,
  "date": "2015-06-01"
 },
 {
  "title": "Fixed leaking pipe in kitchen.",
  "text": "Quick, easy service. Reacted very promptly to my requirement. Job was done with minimal disruption. Very happy with the service.",
  "postcode": null,
  "date": "2015-05-01"
 },
 {
  "title": "Replacement tap head and reviver.",
  "text": "Good reliable service, work well done.",
  "postcode": null,
  "date": "2015-05-01"
 },
 {
  "title": "Capped gas supply and performed tightness test for leak.",
  "text": "Came quickly once phoned. Very quick and effective work and fixed the problem with ease. Very happy and would recommend.",
  "postcode": null,
  "date": "2015-05-01"
 },
 {
  "title": "Gas certificate.",
  "text": "Extremely professional service. Highly recommended to anyone.",
  "postcode": null,
  "date": "2015-05-01"
 },
 {
  "title": "Repaired damaged central heating pipe",
  "text": "Second time I have used this company as very good the first time.",
  "postcode": null,
  "date": "2015-05-01"
 },
 {
  "title": "Toilet repair.",
  "text": "No comments given.",
  "postcode": null,
  "date": "2015-05-01"
 },
 {
  "title": "Repair to toilet",
  "text": "Just to confirm what most other reviewers have already said. Would strongly recommend.",
  "postcode": null,
  "date": "2015-05-01"
 },
 {
  "title": "Installed a dishwasher.",
  "text": "Harvey arrived on time when he said and was polite and courteous. Plumbed in dishwasher, cleaned up mess. Would definitely recommend.",
  "postcode": null,
  "date": "2015-05-01"
 },
 {
  "title": "Blocked toilet, unblocked successfully.",
  "text": "Very quick and came out on the day, excellent service.",
  "postcode": null,
  "date": "2015-04-01"
 },
 {
  "title": "Repairs to leaking tank in loft and tap in bathroom.",
  "text": "Very responsive. Exceptional knowledge and gets the job done.",
  "postcode": null,
  "date": "2015-04-01"
 },
 {
  "title": "Repaired outside taps which were leaking.",
  "text": "Polite, on time, good work, very pleased overall.",
  "postcode": null,
  "date": "2015-04-01"
 },
 {
  "title": "Gas cooker install and boiler annual service.",
  "text": "Very professional and clear communication.",
  "postcode": null,
  "date": "2015-04-01"
 },
 {
  "title": "Replaced ballcock in central heating system.",
  "text": "Very professional and friendly. As the work was carried out in my loft I was also given a before and after picture. Would definitely recommend and use again for future jobs required.",
  "postcode": null,
  "date": "2015-04-01"
 },
 {
  "title": "Drains unblocked.",
  "text": "Very friendly and helpful, was kept informed whilst he carried out the work.",
  "postcode": null,
  "date": "2015-04-01"
 },
 {
  "title": "Unblocking drain.",
  "text": "Efficient and friendly service, able to attend same day as call, highly recommend.",
  "postcode": null,
  "date": "2015-04-01"
 },
 {
  "title": "Replaced ball valve in water tank.",
  "text": "Very friendly and quick service, would be happy to call Harvey again.",
  "postcode": null,
  "date": "2015-04-01"
 },
 {
  "title": "Unblock outside drain.",
  "text": "Very efficient.",
  "postcode": null,
  "date": "2015-04-01"
 },
 {
  "title": "Various plumbing issues in the bathroom.",
  "text": "On time as arranged very courteous and patient. Nothing too difficult. Excellent.",
  "postcode": null,
  "date": "2015-04-01"
 },
 {
  "title": "Leaking water pipe to bath.",
  "text": "Harvey came quickly to see the leaking pipe and sorted the problem out. I would recommend.",
  "postcode": null,
  "date": "2015-04-01"
 },
 {
  "title": "Bath waste leak.",
  "text": "No comments given.",
  "postcode": null,
  "date": "2015-03-01"
 },
 {
  "title": "Cleared a blocked drain.",
  "text": "Fantastic service, arrived within 10 minutes of calling, and had the job sorted out in a jiffy. I would definitely use AHT Plumbing and Drainage again, thank you very much!",
  "postcode": null,
  "date": "2015-03-01"
 },
 {
  "title": "Boiler serviced, chemical cleanse room thermostat replaced.",
  "text": "Punctual, excellent service.",
  "postcode": null,
  "date": "2015-03-01"
 },
 {
  "title": "Blockage.",
  "text": "No comments given.",
  "postcode": null,
  "date": "2015-03-01"
 },
 {
  "title": "Boiler service- check.",
  "text": "Punctual, efficient, polite and friendly.",
  "postcode": null,
  "date": "2015-03-01"
 },
 {
  "title": "Repair to cistern.",
  "text": "The service was prompt and efficient.",
  "postcode": null,
  "date": "2015-03-01"
 },
 {
  "title": "Repair bath outlet and over flow.",
  "text": "Excellent, punctuality, workmanship.",
  "postcode": null,
  "date": "2015-02-01"
 },
 {
  "title": "Check drains for rats accessing house.",
  "text": "Excellent.",
  "postcode": null,
  "date": "2015-02-01"
 },
 {
  "title": "Drain unblocked, thermostat replaced",
  "text": "Work carried out quickly and to a high quality, very satisfied.",
  "postcode": null,
  "date": "2015-02-01"
 },
 {
  "title": "Fitted gas hob.",
  "text": "Excellent job, reliable, tidy workman, very pleased with.",
  "postcode": null,
  "date": "2015-02-01"
 },
 {
  "title": "Fixed toilet cistern regulated flow.",
  "text": "Very pleased with work, very reliable and I would recommend them.",
  "postcode": null,
  "date": "2015-02-01"
 },
 {
  "title": "New ball valve in loft tank.",
  "text": "Promptly and friendly service.",
  "postcode": null,
  "date": "2015-02-01"
 },
 {
  "title": "Fitted new gas hob.",
  "text": "No fuss service.",
  "postcode": null,
  "date": "2015-01-01"
 },
 {
  "title": "Fit new WC and basin.",
  "text": "Good service, thanks. I would recommend.",
  "postcode": null,
  "date": "2015-01-01"
 },
 {
  "title": "Leaking tank.",
  "text": "Very good pleasant man and a good work.",
  "postcode": null,
  "date": "2015-01-01"
 },
 {
  "title": "Plumb in a dish washer.",
  "text": "Great service, arrived on time at short notice and completed the work quickly.",
  "postcode": null,
  "date": "2014-12-01"
 },
 {
  "title": "Fitted new kitchen taps.",
  "text": "Couldn't have asked for a better service and would definitely use again or recommend.",
  "postcode": null,
  "date": "2014-12-01"
 },
 {
  "title": "Boiler service, gas safety check, radiator installation.",
  "text": "Second time I have used Harvey's services. As before, Harvey arrived on time and completed all the work to a good standard. He is courteous, knowledgeable, efficient and very tidy. I would definitely recommend him.",
  "postcode": null,
  "date": "2014-12-01"
 },
 {
  "title": "Fault with radiator.",
  "text": "Called Harvey to check one radiator that wasn't working. He diagnosed fault very quickly and installed new thermostatic radiator valve. New unit was tested and he ensured everything was working fine before leaving. Harvey arrived at our premises on time and is extremely friendly and tidy. This is the second time we have used his services, which is very professional and reasonably priced. We would definitely use again and we would recommend his services without hesitation. Thank you for reading.",
  "postcode": null,
  "date": "2014-11-01"
 },
 {
  "title": "Radiator removed from kitchen.",
  "text": "Brilliant service. Definitely use again.",
  "postcode": null,
  "date": "2014-11-01"
 },
 {
  "title": "Repaired leakage on heating system.",
  "text": "Extremely good service. On time, polite, good workmanship. Would recommend.",
  "postcode": null,
  "date": "2014-11-01"
 },
 {
  "title": "Installation of electric shower.",
  "text": "Was very professional, polite and work finished to a good standard. Tidied up after work finished.",
  "postcode": null,
  "date": "2014-11-01"
 },
 {
  "title": "Removed wrongly placed towel radiator in bathroom and straightened radiator in bedroom.",
  "text": "Having found Harvey on here previously for blocked drain we had no hesitation in calling on him when a rogue bathroom company misfit a towel radiator to our new bathroom. Harvey also re-aligned a bedroom radiator wonky since the house builders installed it some 40 years ago. Excellent!",
  "postcode": null,
  "date": "2014-11-01"
 },
 {
  "title": "Repair leaking sink pipe",
  "text": "Very satisfied.",
  "postcode": null,
  "date": "2014-11-01"
 },
 {
  "title": "Boiler service.",
  "text": "Excellent service - very professional.",
  "postcode": null,
  "date": "2014-11-01"
 },
 {
  "title": "Replace kitchen tap",
  "text": "Quick response. Very friendly. Very professional. Good value for money.",
  "postcode": null,
  "date": "2014-11-01"
 },
 {
  "title": "Drain service.",
  "text": "Turned up on time and carried and work quickly and efficiently. Very pleased with the service.",
  "postcode": null,
  "date": "2014-11-01"
 },
 {
  "title": "Replaced leaking kitchen tap.",
  "text": "Great service, quoted before job, used before. Good communication and arrived promptly. Would use again.",
  "postcode": null,
  "date": "2014-11-01"
 },
 {
  "title": "Repair leaking pipe and fix cistern valve in toilet.",
  "text": "I would recommend this company.",
  "postcode": null,
  "date": "2014-11-01"
 },
 {
  "title": "Boiler service.",
  "text": "Excellent service, very professional. Would recommend.",
  "postcode": null,
  "date": "2014-10-01"
 },
 {
  "title": "Replaced leaking valve on radiator.",
  "text": "Excellent service, very friendly, great workmanship.",
  "postcode": null,
  "date": "2014-10-01"
 },
 {
  "title": "Fitting new toilet.",
  "text": "Made an excellent job on a Friday toilet fitting. Came on prompt timing, was very courteous and kept everything tidy. Impressed.",
  "postcode": null,
  "date": "2014-10-01"
 },
 {
  "title": "Macerator replaced.",
  "text": "I would certainly recommend Harvey. He was courteous and helpful. He offered to buy the Macerator for me and even saved me a few pounds on the price. His work was professional and tidy.",
  "postcode": null,
  "date": "2014-10-01"
 },
 {
  "title": "Leaking pipe mended.",
  "text": "Always helpful, quick to help. Job carried out neatly.",
  "postcode": null,
  "date": "2014-10-01"
 },
 {
  "title": "Score Breakdown",
  "text": "I was asked to perform a boiler service.  When I arrived I was directed to the boiler. As I approached the boiler there was a very strong smell of gas. I performed a gas tightness test which confirmed there was a gas leak. I established that all pipework up to the boiler was sound, and the leak was from within the boiler. I stripped the boiler, tightened and checked all accessible connections using leak detection spray, but was unable to pinpoint the leak. During this investigation a small wet patch of water had formed under the boiler and the boiler's pressure gauge was showing a drop in pressure. I advised the customer I was going on holiday that day and I would arrange for a colleague to further complete the investigation. Due to the gas leak, under gas safe guidelines the boiler had to be classified as immediately dangerous and the gas supply isolated to the appliance. I feel the customer became threatening and I was told to leave the house. In my van I telephoned national grid gas emergencies to inform them of the incident. As a gas safe registered engineer there are strict safety procedures that we have to adhere to. I have a duty of care to my customers.",
  "postcode": null,
  "date": "2014-09-01"
 },
 {
  "title": "Courtesy",
  "text": "Very quick response to my elderly parents. He sorted the problem and kept me informed. Very polite, I would recommend him to my friends and family.",
  "postcode": null,
  "date": "2014-09-01"
 },
 {
  "title": "Blocked toilet.",
  "text": "I would recommend this company.",
  "postcode": null,
  "date": "2014-09-01"
 },
 {
  "title": "Replacement saniflo system.",
  "text": "AHT Services were extremely professional and completed the job well. He also checks with me about how I wanted things finished.",
  "postcode": null,
  "date": "2014-09-01"
 },
 {
  "title": "Installation of 3 new radiators including towel rail.",
  "text": "Supplied an excellent report of the issue for insurance purposes. Prompt and speedy repair. Explained the problem and fuller impact. Charged a fair price for the fix. Would definitely use again. Thanks.",
  "postcode": null,
  "date": "2014-09-01"
 },
 {
  "title": "Emergency plumbing repair.",
  "text": "Professional and friendly. Very competitive price. The work was finished ahead of schedule and left in spotless condition. I would be pleased to recommend this firm.",
  "postcode": null,
  "date": "2014-08-01"
 },
 {
  "title": "New boiler and leaking pipe.",
  "text": "Arrived on time, helpful finding fault.",
  "postcode": null,
  "date": "2014-08-01"
 },
 {
  "title": "Leak diagnosis on mains tap.",
  "text": "Rang to ask if available and we arranged for them to visit two days later (bank holiday Monday) he arrived bang on time assessed the job quickly, had suitable replacement taps on board his van and fitted them after checking I was happy with them, job finished efficiently and reasonably priced I feel.",
  "postcode": null,
  "date": "2014-08-01"
 },
 {
  "title": "Replaced bathroom taps.",
  "text": "Polite and informative.",
  "postcode": null,
  "date": "2014-08-01"
 },
 {
  "title": "Fixed toilet drip installed taps.",
  "text": "All done neatly pleasant man.",
  "postcode": null,
  "date": "2014-08-01"
 },
 {
  "title": "Gas hob and oven fitted.",
  "text": "Very efficient turned up when said.",
  "postcode": null,
  "date": "2014-07-01"
 },
 {
  "title": "Leaking pipe.",
  "text": "Excellent service. Arrived an very short notice and fixed problem immediately.",
  "postcode": null,
  "date": "2014-07-01"
 },
 {
  "title": "Fixed 2 separate overflow problems.",
  "text": "Arrived in good time, identified the problems quickly and had the needed parts available. One problem had been \"fixed\" a number of times before but now it is done properly. The work was done in the estimated hour and the price was very reasonable.",
  "postcode": null,
  "date": "2014-07-01"
 },
 {
  "title": "Repair of toilet flush with ball valve fitting.",
  "text": "Efficient and timely service to a very high standard.",
  "postcode": null,
  "date": "2014-07-01"
 },
 {
  "title": "Fixed dripping overflow.",
  "text": "Really pleased. I called on Friday and Harvey came round the next morning. He not only looked at the problem but fixed it straight away.",
  "postcode": null,
  "date": "2014-07-01"
 },
 {
  "title": "Installed new washing machine.",
  "text": "Called Harvey this morning to ask him to disconnect old washing machine and install new washing machine. Delivery firm was unable to do this work due to complications with old plumbing mains. Harvey completed this work in the same afternoon with no problems. He gave advice and tested our new washing machine. He even provided us with details of a free collection service to take away our old washing machine. Price was reasonable and service was offered with a friendly smile. We would definitely use again and we would recommend his services without hesitation. Thank you for reading.",
  "postcode": null,
  "date": "2014-07-01"
 },
 {
  "title": "Plumb in bath",
  "text": "Really helped us out to get us up and running in our new home.",
  "postcode": null,
  "date": "2014-07-01"
 },
 {
  "title": "Install new soil vent pipe and lateral runs.",
  "text": "Thoroughly professional company, excellent standard of workmanship, courteous, helpful plumbers who were punctual and tidy. Competitively priced. Would use again without hesitation.",
  "postcode": null,
  "date": "2014-07-01"
 },
 {
  "title": "New valve to stop radiators getting hot when only water heating required.",
  "text": "Completed as needed.",
  "postcode": null,
  "date": "2014-07-01"
 },
 {
  "title": "Outside tap.",
  "text": "Work completed to satisfaction.",
  "postcode": null,
  "date": "2014-07-01"
 },
 {
  "title": "Repaired leak under kitchen sink.",
  "text": "Work done quickly and neatly.",
  "postcode": null,
  "date": "2014-06-01"
 },
 {
  "title": "Leaking cistern.",
  "text": "Quick and efficient. Explained all work needed. Friendly and helpful.",
  "postcode": null,
  "date": "2014-06-01"
 },
 {
  "title": "Replacing faulty outside water tap.",
  "text": "Very fast attendance and excellent work. Cheaper than I had expected.",
  "postcode": null,
  "date": "2014-06-01"
 },
 {
  "title": "Re-fit radiator",
  "text": "Very good!",
  "postcode": null,
  "date": "2014-06-01"
 },
 {
  "title": "Remove radiator.",
  "text": "Quick, helpful service.",
  "postcode": null,
  "date": "2014-06-01"
 },
 {
  "title": "Worcester boiler service.",
  "text": "Easy to contact and prompt service.",
  "postcode": null,
  "date": "2014-05-01"
 },
 {
  "title": "Replace cistern parts",
  "text": "Rather difficult job but thankfully Harvey made a good job of it.",
  "postcode": null,
  "date": "2014-05-01"
 },
 {
  "title": "Repair leaking tap.",
  "text": "On time, very good work. Will use again.",
  "postcode": null,
  "date": "2014-05-01"
 },
 {
  "title": "Boiler service.",
  "text": "",
  "postcode": null,
  "date": "2014-05-01"
 },
 {
  "title": "Blocked kitchen sink",
  "text": "I would recommend this company.",
  "postcode": null,
  "date": "2014-05-01"
 },
 {
  "title": "Rectified fault with immersion heater.",
  "text": "Fast and effective. Very knowledgeable.",
  "postcode": null,
  "date": "2014-05-01"
 },
 {
  "title": "Boiler and central heating installation.",
  "text": "Faultless, very quick and focused on the job at hand completed to a very neat and high standard.",
  "postcode": null,
  "date": "2014-04-01"
 },
 {
  "title": "Clearance of drain run.",
  "text": "Absolutely delighted with the service today. Will definitely use Harry again.",
  "postcode": null,
  "date": "2014-04-01"
 },
 {
  "title": "Investigation into blocked drains.",
  "text": "Excellent service, very helpful.",
  "postcode": null,
  "date": "2014-04-01"
 },
 {
  "title": "Plumbed washing machine to shed.",
  "text": "Great efficient service. I would recommend.",
  "postcode": null,
  "date": "2014-04-01"
 },
 {
  "title": "Leaking tap.",
  "text": "Very competent and knowledgeable. Friendly service.",
  "postcode": null,
  "date": "2014-03-01"
 },
 {
  "title": "Detection and repair of under flooring heating.",
  "text": "Excellent service, polite, friendly and very good at their job.",
  "postcode": null,
  "date": "2014-03-01"
 },
 {
  "title": "Change drain gully",
  "text": "I would recommend this company.",
  "postcode": null,
  "date": "2014-03-01"
 },
 {
  "title": "Cloakroom basin taps replaced.",
  "text": "Excellent service. He was prompt and standard of work very high. I was very pleased with the finished work and that he was able to do on a Sunday. Highly recommended.",
  "postcode": null,
  "date": "2014-02-01"
 },
 {
  "title": "Cleared blocked drains and general plumbing.",
  "text": "We have used Harvey on three separate occasions now. Every time he has been very efficient, tidy, courteous and got the job done. He is the only plumber I will use due to his great service.",
  "postcode": null,
  "date": "2014-02-01"
 },
 {
  "title": "Leaky boiler and blocked down pipe and drain.",
  "text": "Excellent service, polite and friendly. Highly recommended.",
  "postcode": null,
  "date": "2014-02-01"
 },
 {
  "title": "Replaced failed valve in cold water tank",
  "text": "Once again Harvey came to my rescue. It is very reassuring knowing I can call on him in an emergency and I would certainly go to him for any other plumbing work.",
  "postcode": null,
  "date": "2014-02-01"
 },
 {
  "title": "Leak from pipe joint.",
  "text": "Everything went well from start to finish.",
  "postcode": null,
  "date": "2014-01-01"
 },
 {
  "title": "Boiler service.",
  "text": "I would recommend this company.",
  "postcode": null,
  "date": "2014-01-01"
 },
 {
  "title": "Gas safety certificate.",
  "text": "Harvey managed to fit me in urgently which was great, squeezing me in between appointments. He was friendly, knowledgeable and helpful. I would happily call on his services again.",
  "postcode": null,
  "date": "2014-01-01"
 },
 {
  "title": "Supply and install new 15 mm mains stop cock.",
  "text": "",
  "postcode": null,
  "date": "2014-01-01"
 },
 {
  "title": "Toilet and bath fixed .",
  "text": "Excellent .",
  "postcode": null,
  "date": "2014-01-01"
 },
 {
  "title": "Clearing blocked drain from kitchen sink.",
  "text": "Prompt. Efficient. Friendly.",
  "postcode": null,
  "date": "2014-01-01"
 },
 {
  "title": "3x leak.",
  "text": "Very good - prompt, efficient and cost effective.",
  "postcode": null,
  "date": "2013-12-01"
 },
 {
  "title": "CCTV Survey of pipe.",
  "text": "Arrived when said got straight down to work , showed interior of pipes",
  "postcode": null,
  "date": "2013-12-01"
 },
 {
  "title": "Fit new saniflo unit.",
  "text": "I would recommend this company.",
  "postcode": null,
  "date": "2013-11-01"
 },
 {
  "title": "Replace inlet valve in toilet cistern.",
  "text": "Very good service, prompt and clean. Would recommend to anyone.",
  "postcode": null,
  "date": "2013-11-01"
 },
 {
  "title": "Unblocking outside drain.",
  "text": "AHT Plumbing and Drainage were very professional, punctual and very prompt in dealing with problem.",
  "postcode": null,
  "date": "2013-11-01"
 },
 {
  "title": "Boiler service.",
  "text": "Annual boiler service. No holes to pick. Gentleman was on time, very courteous and tidy. Charged as quoted and also additional helpful advice given.  Would use again. Would recommend.",
  "postcode": null,
  "date": "2013-11-01"
 },
 {
  "title": "Clean and scope drains.",
  "text": "Provided advice an actions required as a result of the drain scope investigation .",
  "postcode": null,
  "date": "2013-11-01"
 },
 {
  "title": "Hot water ball valve is broken, it was changed and screwed back.",
  "text": "Work was efficient. Glad the person was available and came in on time.",
  "postcode": null,
  "date": "2013-11-01"
 },
 {
  "title": "Supplied and fitted a new septic tank.",
  "text": "Harvey and his team carried out this job as anticipated and with a high level of professionalism. Have used Harvey's services before and have no hesitation in recommending him to others. Our experience restores ones faith in good, honest tradesman.",
  "postcode": null,
  "date": "2013-11-01"
 },
 {
  "title": "Unblock drain.",
  "text": "Contacted me quickly came out on time , job done quickly.",
  "postcode": null,
  "date": "2013-11-01"
 },
 {
  "title": "Kitchen taps replaced.",
  "text": "Excellent service. Punctual and good work.",
  "postcode": null,
  "date": "2013-10-01"
 },
 {
  "title": "Drain work.",
  "text": "I would recommend this company.",
  "postcode": null,
  "date": "2013-10-01"
 },
 {
  "title": "Remove basin pop up plug and install new one.",
  "text": "Remove leaking plug from basin. Install new pop up plug.",
  "postcode": null,
  "date": "2013-10-01"
 },
 {
  "title": "Repair to toilet flushing system.",
  "text": "Harvey is a very genuine guy and I would not hesitate in recommending him to other potential clients. Very reasonably priced!",
  "postcode": null,
  "date": "2013-10-01"
 },
 {
  "title": "Fixed leak in the thermostatic shower bar and installed a click clack waste in the bath.",
  "text": "Harvey is always very proactive and helpful. I definitely recommend him.",
  "postcode": null,
  "date": "2013-09-01"
 },
 {
  "title": "Plumbing",
  "text": "Brilliant, clean and tidy job, very quick and efficient and friendly.",
  "postcode": null,
  "date": "2013-09-01"
 },
 {
  "title": "Unblocked a drain.",
  "text": "Very friendly, prompt and efficient service, definitely recommend. He also deals with gas boilers, had asked about servicing my boiler, he was upfront and honest and said due to the age not needed, so clearly a genuine honest tradesman you can trust.",
  "postcode": null,
  "date": "2013-09-01"
 },
 {
  "title": "Boiler service.",
  "text": "Excellent job! I'd use them again.",
  "postcode": null,
  "date": "2013-09-01"
 },
 {
  "title": "Fantastic service.",
  "text": "Quick and reliable.",
  "postcode": null,
  "date": "2013-09-01"
 },
 {
  "title": "We asked for a quote to survey the drains before the purchase of a property.",
  "text": "Mr Turtles communication was consistently excellent. He explained everything before the work and afterwards. He made regular contact with updates prior to the day of the work. The quote for the inspection was competitive, his diligence was brilliant because it wasn't as straight forward as we first thought. He clearly explained the recommended works to be carried out. I will instruct him to do this in due course. I will give further feedback after that. Very pleased!",
  "postcode": null,
  "date": "2013-09-01"
 },
 {
  "title": "Survey and advice.",
  "text": "Harvey carried out a survey of our drains and also gave some good free advice on a related issue. Very happy with the service and will be pleased to give further work to AHT Plumbing and Drainage in the future.",
  "postcode": null,
  "date": "2013-09-01"
 },
 {
  "title": "Drainage survey and block cage clearance.",
  "text": "Harvey was polite, friendly and completed a full inspection and survey, as well as unblocked a major drain, on a potential new house. He arrived early and produced a fully comprehensive report, including videos, gave good recommendations and billed in good time. Excellent.",
  "postcode": null,
  "date": "2013-08-01"
 },
 {
  "title": "Fitting a new hob and gas safety certificate",
  "text": "Great, efficient service, would recommend. Pleasant guy.",
  "postcode": null,
  "date": "2013-08-01"
 },
 {
  "title": "Unblocking of sewer.",
  "text": "Come out at very short notice.",
  "postcode": null,
  "date": "2013-08-01"
 },
 {
  "title": "Cistern replacement.",
  "text": "Very good.",
  "postcode": null,
  "date": "2013-08-01"
 },
 {
  "title": "Fit outside tap.",
  "text": "I would recommend this company.",
  "postcode": null,
  "date": "2013-08-01"
 },
 {
  "title": "Minor plumbing.",
  "text": "I would recommend this company.",
  "postcode": null,
  "date": "2013-08-01"
 },
 {
  "title": "Septic tank inspection and report.",
  "text": "Efficient and tidy. Demonstrating good knowledge and experience of work undertaken.",
  "postcode": "Kent",
  "date": "2013-07-01"
 },
 {
  "title": "Changed taps in bathroom and kitchen.",
  "text": "Excellent.",
  "postcode": null,
  "date": "2013-07-01"
 },
 {
  "title": "Unblock a drain.",
  "text": "I had found AHT through checkatrade and was very satisfied with the chap who came and the standard of his work.",
  "postcode": null,
  "date": "2013-07-01"
 },
 {
  "title": "Clearing blocked drain.",
  "text": "I would recommend this company.",
  "postcode": null,
  "date": "2013-07-01"
 },
 {
  "title": "Disconnection of washing machine.",
  "text": "I would recommend this company.",
  "postcode": null,
  "date": "2013-07-01"
 },
 {
  "title": "Repaired flushing system and leak in the main bathroom.",
  "text": "Excellent performance and execution of the job.",
  "postcode": null,
  "date": "2013-07-01"
 },
 {
  "title": "Re-grouting and sealing shower, removal of radiators.",
  "text": "Clean, efficient, hardly know Harvey was here. Very happy with work.",
  "postcode": null,
  "date": "2013-07-01"
 },
 {
  "title": "New shower pump",
  "text": "Very good, came round same day and fixed problem within 2 days, came early to suit us.",
  "postcode": null,
  "date": "2013-07-01"
 },
 {
  "title": "Fixed toilet.",
  "text": "Turned up at short notice and did a good job. Would recommend.",
  "postcode": null,
  "date": "2013-07-01"
 },
 {
  "title": "Drain survey.",
  "text": "Harvey was very helpful and efficient. We will be contacting AHT Plumbing and Drainage again for further work in the future.",
  "postcode": null,
  "date": "2013-06-01"
 },
 {
  "title": "Unblocking of drain.",
  "text": "Very professional and great response time to urgent call out. Quick friendly service, would recommend to others.",
  "postcode": null,
  "date": "2013-06-01"
 },
 {
  "title": "Emergency work to toilet",
  "text": "Fast and reliable, friendly and informative.",
  "postcode": null,
  "date": "2013-06-01"
 },
 {
  "title": "Replace tap.",
  "text": "Prompt, reliable, friendly and helpful. Can not recommend enough.",
  "postcode": null,
  "date": "2013-06-01"
 },
 {
  "title": "A new ball cock fitted leaking overflow repaired.",
  "text": "Very good!",
  "postcode": null,
  "date": "2013-05-01"
 },
 {
  "title": "Fit reveiver unit.",
  "text": "Prompt and polite service.",
  "postcode": null,
  "date": "2013-05-01"
 },
 {
  "title": "Clearance of blocked drains.",
  "text": "Very efficient, very polite and very professional.",
  "postcode": null,
  "date": "2013-05-01"
 },
 {
  "title": "Blocked toilet and drain",
  "text": "Excellent - punctual, polite, professional, cleared up afterwards, fair price.",
  "postcode": null,
  "date": "2013-05-01"
 },
 {
  "title": "Flush repaired and new float fitted.",
  "text": "Old toilet cistern made access difficult - Harvey went to time and trouble to overcome.",
  "postcode": null,
  "date": "2013-05-01"
 },
 {
  "title": "Leakage of pipe in shower.",
  "text": "I would recommend this company.",
  "postcode": null,
  "date": "2013-04-01"
 },
 {
  "title": "Boiler service",
  "text": "Polite and worked hard.",
  "postcode": null,
  "date": "2013-04-01"
 },
 {
  "title": "New kitchen tap.",
  "text": "Work completed as agreed.",
  "postcode": null,
  "date": "2013-04-01"
 },
 {
  "title": "Install new gas hob.",
  "text": "Harvey was on time, carried out the work efficiently and cheerfully. He fitted a new shut off valve, as well as the new gas hob, and the whole installation was neat and tidy. The connections were leak checked in accordance with the regulations. We would recommend this company and would definitely use them again.",
  "postcode": null,
  "date": "2013-04-01"
 },
 {
  "title": "Unblocked outside drain.",
  "text": "My problem was fixed within 30 minutes of my discovering it! Thanks! You are a life saver!",
  "postcode": null,
  "date": "2013-04-01"
 },
 {
  "title": "Domestic drain cleared and CCTV survey done.",
  "text": "Harvey was polite and helpful from the initial telephone call through to the completion of the work and issuing of the invoice. He asked questions where appropriate, listened, assessed the evidence and then gave his opinion on the possible reasons for the blockage. He identified a problem that he explained in clear, concise detail, offered a number of possible solutions and quoted on the long term solution that he believed would be most appropriate. I would definitely recommend him, if nothing else for his polite and courteous customer service and the peace of mind I was left with. But also bear in mind, my drain was successfully cleared, so job done!",
  "postcode": null,
  "date": "2013-04-01"
 },
 {
  "title": "Leak in plumbing in roof.",
  "text": "Excellent.",
  "postcode": null,
  "date": "2013-04-01"
 },
 {
  "title": "Hot water boiler replace",
  "text": "Difficult job conducted quickly and as per estimate.",
  "postcode": null,
  "date": "2013-04-01"
 },
 {
  "title": "Tree root removed from drain. Repair and made good.",
  "text": "I am extremely pleased with the work conducted. Throughout I was kept updated on the progress and the whole experience of dealing with the company was really good. I have used them before. Conscientious and friendly I would definitely use again.",
  "postcode": null,
  "date": "2013-04-01"
 },
 {
  "title": "Drainage works.",
  "text": "Very good and happy with service.",
  "postcode": null,
  "date": "2013-04-01"
 },
 {
  "title": "Drain clearance and root removal.",
  "text": "Very friendly and efficient service. Harvey did a very good job and would definitely recommend.",
  "postcode": null,
  "date": "2013-03-01"
 },
 {
  "title": "Drains test for building inspector.",
  "text": "Harvey arrived early and tackled the fiddly job of removing heavy drains covers and working out how the system worked prior to the arrival of the building inspector. He was polite, knowledgeable and arrived in plenty of time. He charged me exactly what he had quoted.",
  "postcode": null,
  "date": "2013-03-01"
 },
 {
  "title": "Landlord's gas certificate.",
  "text": "Harvey was on time and kept me informed of every check being carried out. Gave a good advice how to fix a minor radiator leak instead of replacing it. Overall, good service.",
  "postcode": null,
  "date": "2013-03-01"
 },
 {
  "title": "Replaced kitchen taps.",
  "text": "Very satisfied. Great customer service and quality of work. Highly recommend.",
  "postcode": null,
  "date": "2013-03-01"
 },
 {
  "title": "Drain clearance and survey.",
  "text": "Harvey very punctual and very nice manner. Am asking to do repeat work next week. Excellent service.",
  "postcode": null,
  "date": "2013-03-01"
 },
 {
  "title": "Replaced pan connector in toilet.",
  "text": "I am very satisfied with the service provided. Harvey was very quick to arrive at such short notice, fixed the problem without issue and tidied up afterward. I would not hesitate to recommend this company.",
  "postcode": null,
  "date": "2013-03-01"
 },
 {
  "title": "Change ball valve and stop leaking tap.",
  "text": "Excellent, efficient service. Prompt response to problem.",
  "postcode": null,
  "date": "2013-03-01"
 },
 {
  "title": "Diagnosis of boiler fault.",
  "text": "Harvey was quick to respond to a boiler emergency. He was professional, incredibly helpful and reasonably and fairly priced. Overall we were very impressed and would certainly use his company again.",
  "postcode": null,
  "date": "2013-03-01"
 },
 {
  "title": "Cleared blocked drain and replace radiator valve.",
  "text": "Delighted with the quality of work. A very friendly service. Would strongly recommend and would use again.",
  "postcode": null,
  "date": "2013-03-01"
 },
 {
  "title": "Plumbed toilet.",
  "text": "I would recommend this company.",
  "postcode": null,
  "date": "2013-02-01"
 },
 {
  "title": "Overflowing toilet and flooding to kitchen.",
  "text": "Speedy, efficient and polite. Highly recommend - would use again.",
  "postcode": null,
  "date": "2013-02-01"
 },
 {
  "title": "Investigation.",
  "text": "Harvey was quick to response and checked the problem I had. All I had was air in the system which was resolved at no cost. Will use Harvey again if needed and recommend him.",
  "postcode": null,
  "date": "2013-02-01"
 },
 {
  "title": "Install gas hob",
  "text": "Very friendly, professional and reasonable cost.",
  "postcode": null,
  "date": "2013-02-01"
 },
 {
  "title": "Unblocking of bathroom sink.",
  "text": "Came out very promptly, very helpful, friendly, sorted problem out quickly and very efficient.",
  "postcode": null,
  "date": "2013-02-01"
 },
 {
  "title": "Unblocking outside kitchen drain.",
  "text": "Very satisfied, very helpful on phone. Honest and reliable.",
  "postcode": null,
  "date": "2013-02-01"
 },
 {
  "title": "Boiler repair.",
  "text": "Very fast, professional and friendly.",
  "postcode": null,
  "date": "2013-02-01"
 },
 {
  "title": "Disconnected dish washer.",
  "text": "Jolly person and did a really good job. Very friendly and helpful.",
  "postcode": null,
  "date": "2013-02-01"
 },
 {
  "title": "Boiler service investigate possible CO leak.",
  "text": "Excellent service and good communication. Harvey was very reassuring and I feel safe that I don't have faulty boiler. I have an old worn out carbon monoxide detector.",
  "postcode": null,
  "date": "2013-02-01"
 },
 {
  "title": "Replace shower with new one.",
  "text": "Work carried out professionally, on time and on budget. General impressed with work.",
  "postcode": null,
  "date": "2013-02-01"
 },
 {
  "title": "Fit new radiator and upgrade two existing ones.",
  "text": "Harvey was punctual, tidy and efficient. His quality of workmanship was very high and he ensured that the whole heating system was working properly before leaving. Would recommend.",
  "postcode": null,
  "date": "2013-02-01"
 },
 {
  "title": "Call out to leaking shower",
  "text": "I would recommend this company.",
  "postcode": null,
  "date": "2013-02-01"
 },
 {
  "title": "External drain unblocked.",
  "text": "Very polite, good communication, clear pricing and job carried out efficiently.",
  "postcode": null,
  "date": "2013-01-01"
 },
 {
  "title": "Installation of gas hob and gas pipe work.",
  "text": "Arrived on time, Harvey was very helpful and went out of his way to complete the job. Very recommended!",
  "postcode": null,
  "date": "2013-01-01"
 },
 {
  "title": "Correction of poor water flow following previous replacement of cold water tank.",
  "text": "Very good service to find cause of problem and correct it. No effort spared to get things right.",
  "postcode": null,
  "date": "2013-01-01"
 },
 {
  "title": "Gas safety repair.",
  "text": "Very happy with the service provided. Would recommend!",
  "postcode": null,
  "date": "2013-01-01"
 },
 {
  "title": "Change shower cartridge.",
  "text": "Very good! Brilliant!",
  "postcode": null,
  "date": "2013-01-01"
 },
 {
  "title": "Replacement of leaking water tank in roof space.",
  "text": "Very friendly and efficient service. Location of tank in area difficult to access but problems thought and solved.",
  "postcode": null,
  "date": "2013-01-01"
 },
 {
  "title": "Leak in pipe work to bathroom.",
  "text": "Very good - contacted me swiftly after requesting help and was here within the hour and repair done well and quickly.",
  "postcode": null,
  "date": "2013-01-01"
 },
 {
  "title": "Sorted out drainage problem.",
  "text": "Cleared patio of sewage backing up. Clean and tidy job done.",
  "postcode": null,
  "date": "2013-01-01"
 },
 {
  "title": "Shower installation.",
  "text": "Work done to specification, very good, tidy and helpful.",
  "postcode": null,
  "date": "2013-01-01"
 },
 {
  "title": "Installation of dishwasher.",
  "text": "Excellent, fast service. Faultless and overly helpful.",
  "postcode": null,
  "date": "2013-01-01"
 },
 {
  "title": "Gas leak investigation.",
  "text": "Arrived on time, very helpful and thorough. Had been informed by another company, we had a gas leak. Carried out tightness test that other company said had failed, and it passed. Test carried over a much longer period than necessary. Very happy with service received. Would recommend, with no reservation.",
  "postcode": null,
  "date": "2013-01-01"
 },
 {
  "title": "Fitting of a new gas connection and cooker installation.",
  "text": "I found Mr Harvey Turtle very polite and friendly. He explained exactly what he was doing and why. I found him very safety and regulations conscious. He had quoted a reasonable price to draw piping from the mains for the cooker. We discovered an existing pipe closer to the cooker which potentially reduced some labour and material. He voluntarily reduced the price by 25%. He did a very neat job. He also answered umpteen number of other questions I had patiently which we're not related to this work. I would certainly use him again and recommend his services to others.",
  "postcode": null,
  "date": "2013-01-01"
 },
 {
  "title": "Fixing leaking toilet.",
  "text": "Very polite, keen to do a good job efficiently.",
  "postcode": null,
  "date": "2013-01-01"
 },
 {
  "title": "Replace taps, remove radiators, boiler gas check",
  "text": "Reliable, kept me informed, kept the original price quoted, worked well, clean and tidy, great attitude.",
  "postcode": null,
  "date": "2013-01-01"
 },
 {
  "title": "Shower cubicle re-sealed and leak fixed.",
  "text": "Very prompt and efficient, did a really good job and very friendly.",
  "postcode": null,
  "date": "2013-01-01"
 },
 {
  "title": "Brilliant.",
  "text": "Excellent.",
  "postcode": null,
  "date": "2013-01-01"
 },
 {
  "title": "Replacement of cracked toilet basin.",
  "text": "Determined to get the job done for Christmas. Harvey was polite, professional and efficient.",
  "postcode": null,
  "date": "2013-01-01"
 },
 {
  "title": "Boiler problems",
  "text": "The engineer was very helpful and knowledgeable and sorted out the problem efficiently.",
  "postcode": null,
  "date": "2013-01-01"
 },
 {
  "title": "Boiler service and other plumbing estimates.",
  "text": "A no nonsense plumber who is polite, prompt and very professional. If he can't do something, he will say so without the hard sell. He genuinely makes the customer feel in control. A true gentleman in the trade.",
  "postcode": null,
  "date": "2013-01-01"
 },
 {
  "title": "Replaced ball valve",
  "text": "I would recommend this company.",
  "postcode": null,
  "date": "2012-12-01"
 },
 {
  "title": "Boiler service and general plumbing.",
  "text": "Excellent.",
  "postcode": null,
  "date": "2012-12-01"
 },
 {
  "title": "Fit new radiator new taps on sink.",
  "text": "Very pleasant, polite, quick and efficient, no cigarette breaks which was good. I would recommend this company.",
  "postcode": null,
  "date": "2012-12-01"
 },
 {
  "title": "Clear sink blockage.",
  "text": "Came at short notice after being let down by other company. Very pleasant man. Very reasonable price.",
  "postcode": null,
  "date": "2012-12-01"
 },
 {
  "title": "Replace hot water cylinder.",
  "text": "Very neat and tidy. Job done quickly and with no fuss. Very happy with service.",
  "postcode": null,
  "date": "2012-12-01"
 },
 {
  "title": "Blocked drain.",
  "text": "Quick call out within a couple of hours! Friendly service.",
  "postcode": null,
  "date": "2012-12-01"
 },
 {
  "title": "Drains checked.",
  "text": "Polite, helpful man.",
  "postcode": null,
  "date": "2012-12-01"
 },
 {
  "title": "Repair busted pipe in kitchen.",
  "text": "I would recommend this company.",
  "postcode": null,
  "date": "2012-12-01"
 },
 {
  "title": "Central heating.",
  "text": "A very good job. I would recommend this company.",
  "postcode": null,
  "date": "2012-11-01"
 },
 {
  "title": "Replaced an expansion vessel.",
  "text": "Came to the house when they said they would. A tough job but completed it well.",
  "postcode": null,
  "date": "2012-11-01"
 },
 {
  "title": "Fix leak in bathroom.",
  "text": "Explained work required, carried out work then showed the completed work.",
  "postcode": null,
  "date": "2012-11-01"
 },
 {
  "title": "Fix bath leak and changed taps.",
  "text": "Fantastic service, on time, definitely use again.",
  "postcode": null,
  "date": "2012-11-01"
 },
 {
  "title": "Fit stop cock.",
  "text": "Excellent.",
  "postcode": null,
  "date": "2012-11-01"
 },
 {
  "title": "New tap fitted and replace faulty one",
  "text": "Excellent, very fast service, perfect job.",
  "postcode": null,
  "date": "2012-11-01"
 },
 {
  "title": "Replaced toilet.",
  "text": "Professional friendly and tidy.",
  "postcode": null,
  "date": "2012-11-01"
 },
 {
  "title": "Kitchen mixer tap replacement.",
  "text": "Very satisfactory.",
  "postcode": null,
  "date": "2012-11-01"
 },
 {
  "title": "Change Tap",
  "text": "I would recommend this company. Good job very happy.",
  "postcode": null,
  "date": "2012-11-01"
 },
 {
  "title": "Change tap workings.",
  "text": "Very good on more than one occasion, excellent.",
  "postcode": null,
  "date": "2012-11-01"
 },
 {
  "title": "Block kitchen sink due block in pipes connected to washing machine.",
  "text": "I would recommend this company.",
  "postcode": null,
  "date": "2012-11-01"
 },
 {
  "title": "Installed gas hob.",
  "text": "Prompt, good service.",
  "postcode": null,
  "date": "2012-11-01"
 },
 {
  "title": "Replacing pipe work and installing new rads.",
  "text": "Everything that has been said about Paul I thoroughly agree with. I am very pleased with the work carried out and would certainly recommend Drain Away.",
  "postcode": null,
  "date": "2012-10-01"
 },
 {
  "title": "Drainage.",
  "text": "Excellent.",
  "postcode": null,
  "date": "2012-10-01"
 },
 {
  "title": "Swap gas cooker, take out old pipe work and replace with new.",
  "text": "The job was carried out in an efficient and tidy way. An urgent task a problem was resolved quickly.",
  "postcode": null,
  "date": "2012-10-01"
 },
 {
  "title": "Toilet bowl not flushing.",
  "text": "Excellent and speedy service.",
  "postcode": null,
  "date": "2012-10-01"
 },
 {
  "title": "Cleaned blocked drain.",
  "text": "Paul Cooke was very pleasant and professional and kept me informed all the way through the drain investigation. He found the problem and cleared the block. I would use this company again and would recommend them.",
  "postcode": null,
  "date": "2012-10-01"
 },
 {
  "title": "Clear blocked drains and two manholes",
  "text": "Operative telephoned and came on time, assessed the work and planned. Carried out inspection and worked hard to clear out blockages, drains and manholes.",
  "postcode": null,
  "date": "2012-10-01"
 },
 {
  "title": "Replacement cylinder.",
  "text": "This plumber was very competent and extremely friendly, hard worker.",
  "postcode": null,
  "date": "2012-10-01"
 },
 {
  "title": "Leaking toilet system",
  "text": "Very efficient plumber. Rectified problem quickly and effectively. Very pleasant man.",
  "postcode": null,
  "date": "2012-10-01"
 },
 {
  "title": "Washing machine repair",
  "text": "Thorough, professional and friendly.",
  "postcode": null,
  "date": "2012-10-01"
 },
 {
  "title": "Free up stop valve and replace ball valve.",
  "text": "The company has provided a most excellent service, I would strongly recommend them.",
  "postcode": null,
  "date": "2012-10-01"
 },
 {
  "title": "Severe leak in bathroom. Repair to waste pipe.",
  "text": "Can not speak highly enough of this company. Came out on an emergency call out, after being let down by another company. Reliable, reasonably priced and totally professional. Would definitely use them again and highly recommend.",
  "postcode": null,
  "date": "2012-10-01"
 },
 {
  "title": "Unblock main house foul",
  "text": "Excellent office reaction and perfect on site works and attitude.",
  "postcode": null,
  "date": "2012-10-01"
 },
 {
  "title": "Blocked drain",
  "text": "Very pleased with service.",
  "postcode": null,
  "date": "2012-10-01"
 },
 {
  "title": "New siphon.",
  "text": "Very good. Came within 14 hours of request. Punctual 09:00hrs. Request was made in the evening at 19:00hrs.",
  "postcode": null,
  "date": "2012-09-01"
 },
 {
  "title": "Plumbing repair to leak.",
  "text": "Efficient fast service.",
  "postcode": null,
  "date": "2012-09-01"
 },
 {
  "title": "Leak and pipe replacement.",
  "text": "Knowledgeable, friendly, efficient and reasonable.",
  "postcode": null,
  "date": "2012-09-01"
 },
 {
  "title": "Fixing leaking water hose.",
  "text": "Very good and quick service.",
  "postcode": null,
  "date": "2012-09-01"
 },
 {
  "title": "Fitting new shower unit.",
  "text": "Very prompt and efficient. They have solved a real problem and done an excellent job.",
  "postcode": null,
  "date": "2012-09-01"
 },
 {
  "title": "Unblock drain.",
  "text": "Excellent and prompt service.",
  "postcode": null,
  "date": "2012-09-01"
 },
 {
  "title": "Replaced economy immersion heater.",
  "text": "Quick and efficient service. Polite as well, happy to recommend.",
  "postcode": null,
  "date": "2012-09-01"
 },
 {
  "title": "Toilet system flow valve.",
  "text": "On time, good job.",
  "postcode": null,
  "date": "2012-09-01"
 },
 {
  "title": "Cleared blocked drain in the road.",
  "text": "Very friendly and efficient and thorough job done. Ensured problem was resolved. Very happy with service given.",
  "postcode": null,
  "date": "2012-09-01"
 },
 {
  "title": "Shower valve cartridge replaced",
  "text": "Polite and efficient.",
  "postcode": null,
  "date": "2012-09-01"
 },
 {
  "title": "CCTV survey.",
  "text": "Punctual, friendly, informative and efficient.",
  "postcode": null,
  "date": "2012-08-01"
 },
 {
  "title": "Replace leaking soil pipe",
  "text": "Very happy, prompt and helpful service. Paul was very friendly and professional, very tidy and conscientious.",
  "postcode": null,
  "date": "2012-08-01"
 },
 {
  "title": "Plumbing work.",
  "text": "Good service and workmanship.",
  "postcode": null,
  "date": "2012-08-01"
 },
 {
  "title": "Recommended loose speed fit 90 water connection.",
  "text": "Good professional service and very helpful.",
  "postcode": null,
  "date": "2012-08-01"
 },
 {
  "title": "Fit new taps in kitchen.",
  "text": "Good service, pleasant operator.",
  "postcode": null,
  "date": "2012-08-01"
 },
 {
  "title": "Cleared blocked toilet.",
  "text": "Speedy, excellent and friendly service, very pleased.",
  "postcode": null,
  "date": "2012-08-01"
 },
 {
  "title": "Replacement of Saniflow unit.",
  "text": "Prompt, efficient, tidied up afterwards, competitively priced.",
  "postcode": null,
  "date": "2012-08-01"
 },
 {
  "title": "Fixed a toilet and leaking tap.",
  "text": "He arrived on time, gave a fixed quote for all the work and completed it all quickly and well.",
  "postcode": null,
  "date": "2012-08-01"
 },
 {
  "title": "Emersion replaced.",
  "text": "Came out the same day at the time quoted, gave an estimate for the work and got straight to it. Very friendly polite and approachable giving good advice as the work was being carried out. Would recommend to friends and family.",
  "postcode": null,
  "date": "2012-08-01"
 },
 {
  "title": "Clearance of blocked gulley drain",
  "text": "Came promptly at time promised. Cleared immediate problem and gave advice on future management of the situation.",
  "postcode": null,
  "date": "2012-08-01"
 },
 {
  "title": "Leaking toilet which caused water damage to lower floor and ceiling.",
  "text": "Good. Arrived in good time, helpful and capable. Fixed problem.",
  "postcode": null,
  "date": "2012-08-01"
 },
 {
  "title": "Fitted radiator and fixed valve on toilet",
  "text": "Wonderful.",
  "postcode": null,
  "date": "2012-08-01"
 },
 {
  "title": "Replace hot water cylinder.",
  "text": "Very good, professional.",
  "postcode": null,
  "date": "2012-08-01"
 },
 {
  "title": "Clearing a blocked soak away.",
  "text": "Very happy with standard of work.",
  "postcode": null,
  "date": "2012-08-01"
 },
 {
  "title": "Clearing blocked basin.",
  "text": "Excellent service and advice.",
  "postcode": null,
  "date": "2012-08-01"
 },
 {
  "title": "Emergency leaking feed pipe toilet.",
  "text": "Quick call out less than 45 minutes on Saturday night. Very quick and efficient work.",
  "postcode": null,
  "date": "2012-08-01"
 },
 {
  "title": "Down drain.",
  "text": "Very good, polite.",
  "postcode": null,
  "date": "2012-08-01"
 },
 {
  "title": "Replacement of valve and ball cock in water tank.",
  "text": "Fast response.",
  "postcode": null,
  "date": "2012-08-01"
 },
 {
  "title": "Float - valve replace.",
  "text": "Excellent service, very speedy response.",
  "postcode": null,
  "date": "2012-08-01"
 },
 {
  "title": "Replaced valve in toilet.",
  "text": "Very good, fast and efficient.",
  "postcode": null,
  "date": "2012-07-01"
 },
 {
  "title": "Drain unblock",
  "text": "I would recommend this company.",
  "postcode": null,
  "date": "2012-07-01"
 },
 {
  "title": "Final connections of kitchen sink and washer",
  "text": "On time, helpful advice given during installation work, tidy, clean work completed.",
  "postcode": null,
  "date": "2012-07-01"
 },
 {
  "title": "Investigate of pipes in drains",
  "text": "Friendly, helpful service.",
  "postcode": null,
  "date": "2012-07-01"
 },
 {
  "title": "Blocked drain",
  "text": "Superb service.",
  "postcode": null,
  "date": "2012-07-01"
 },
 {
  "title": "Cylinder replacement",
  "text": "Very efficient.",
  "postcode": null,
  "date": "2012-07-01"
 },
 {
  "title": "Drain pressure washed cleaned and tested",
  "text": "Arrived on time, polite and friendly, work completed without fuss, very happy with the service received.",
  "postcode": null,
  "date": "2012-07-01"
 },
 { "title": "CCTV", "text": "Happy.", "postcode": null, "date": "2012-07-01" },
 {
  "title": "Blocked gully.",
  "text": "Prompt service and cheerfully carried out by Paul.",
  "postcode": null,
  "date": "2012-07-01"
 },
 {
  "title": "Replacement of a tap.",
  "text": "I would recommend this company.",
  "postcode": null,
  "date": "2012-07-01"
 },
 {
  "title": "Block drain.",
  "text": "Quick work.",
  "postcode": null,
  "date": "2012-07-01"
 },
 {
  "title": "Drains.",
  "text": "Very friendly staff, good manners, happy with the service.",
  "postcode": null,
  "date": "2012-07-01"
 },
 {
  "title": "Boiler repair and toilet repair.",
  "text": "Paul went the extra mile to source the parts required and complete the job. He was polite and friendly.",
  "postcode": null,
  "date": "2012-07-01"
 },
 {
  "title": "Blocked gully",
  "text": "I would recommend this company.",
  "postcode": null,
  "date": "2012-07-01"
 },
 {
  "title": "Blocked drain.",
  "text": "Very good at his work. I would recommend this company.",
  "postcode": null,
  "date": "2012-06-01"
 },
 {
  "title": "Drains cleared and checked with camera",
  "text": "I would recommend this company.",
  "postcode": null,
  "date": "2012-06-01"
 },
 {
  "title": "Two dripping taps repaired, advice on one more.",
  "text": "Quick and courteous, honest advice given, would recommend.",
  "postcode": null,
  "date": "2012-06-01"
 },
 {
  "title": "Re-build gully surround.",
  "text": "Very professional and helpful. Also attended quickly. All operatives nicely polite.",
  "postcode": null,
  "date": "2012-06-01"
 },
 {
  "title": "Blocked outside drain.",
  "text": "Quick response to call and given advice for future work.",
  "postcode": null,
  "date": "2012-06-01"
 },
 {
  "title": "Boiler leaking etc.",
  "text": "Very good service.",
  "postcode": null,
  "date": "2012-06-01"
 },
 {
  "title": "Shower fixed.",
  "text": "Quick, efficient, thoroughly explained the job.",
  "postcode": null,
  "date": "2012-06-01"
 },
 {
  "title": "Leak in bathroom.",
  "text": "Very polite from start - helpful and pleasant. Job done quickly and with minimum fuss.",
  "postcode": null,
  "date": "2012-06-01"
 },
 {
  "title": "Clearing drain and blockage from kitchen sink.",
  "text": "Very helpful.",
  "postcode": null,
  "date": "2012-06-01"
 },
 {
  "title": "Gully clean and maintenance.",
  "text": "I thought the service was first class, the problem was explained fully.",
  "postcode": null,
  "date": "2012-06-01"
 },
 {
  "title": "Drain.",
  "text": "Such care and concern - excellent job.",
  "postcode": null,
  "date": "2012-06-01"
 },
 {
  "title": "Replacing sink taps.",
  "text": "Very efficient and helpful plumber.",
  "postcode": null,
  "date": "2012-06-01"
 },
 {
  "title": "Repair leaking shower.",
  "text": "The work was excellent and I was updated on progress.",
  "postcode": null,
  "date": "2012-06-01"
 },
 {
  "title": "Fixed Immersion boiler",
  "text": "Very good work, managed to fix the problem and \r had the parts to hand. Even when the heating element was stuck the plumber \r kept trying and succeeded to avoid me having to pay for a new tank. Communication \r was also good with the office telling me when the plumber would arrive and \r calling me 30 min before he arrived.",
  "postcode": null,
  "date": "2012-06-01"
 },
 {
  "title": "Replacement of kitchen sink waste pipe.",
  "text": "Information on work necessary to stop leak and we accept advice on work to be done which was very satisfactory.",
  "postcode": null,
  "date": "2012-06-01"
 },
 {
  "title": "CCTV drain survey and clear blockage",
  "text": "Couldn't fault service etc. Best of all gave advice and estimate should any further work be necessary.",
  "postcode": null,
  "date": "2012-06-01"
 },
 {
  "title": "Fixed broken toilet.",
  "text": "Very helpful and efficient.",
  "postcode": null,
  "date": "2012-06-01"
 },
 {
  "title": "Fitting of new isolation valve to water leak.",
  "text": "Very quick to arrive efficient service. I would recommend this company.",
  "postcode": null,
  "date": "2012-06-01"
 },
 {
  "title": "Replacement drain urinals, make good old drain.",
  "text": "Excellent service,",
  "postcode": null,
  "date": "2012-06-01"
 },
 {
  "title": "Repair to pipe and tap replacement.",
  "text": "I would recommend this company.",
  "postcode": null,
  "date": "2012-06-01"
 },
 {
  "title": "Estimate for poor pressure but engineer diagnosed problem.",
  "text": "Good call centre. Engineer very friendly and helpful. Gave quote incase further work needed.",
  "postcode": null,
  "date": "2012-06-01"
 },
 {
  "title": "Unblock toilet.",
  "text": "Very good pleasant man.",
  "postcode": null,
  "date": "2012-05-01"
 },
 {
  "title": "Replace valves on cws system.",
  "text": "First class.",
  "postcode": null,
  "date": "2012-05-01"
 },
 {
  "title": "Gas safety cert",
  "text": "Reliable and efficient service.",
  "postcode": null,
  "date": "2012-05-01"
 },
 {
  "title": "Shower drain blockage cleared.",
  "text": "Very good, excellent.",
  "postcode": null,
  "date": "2012-05-01"
 },
 {
  "title": "Repaired broken toilet.",
  "text": "This was an emergency call-out. My call was answered immediately and work completed on the same day. Paul was polite, worked swiftly and completed the job within the estimated timeframe.",
  "postcode": null,
  "date": "2012-05-01"
 },
 {
  "title": "Clearing a blocked drain",
  "text": "Very high level of service, pleasant attitude, helpful. Work done efficiently.",
  "postcode": null,
  "date": "2012-05-01"
 },
 {
  "title": "Supply and install replacement immersion",
  "text": "I would recommend this company.",
  "postcode": null,
  "date": "2012-05-01"
 },
 {
  "title": "Cleared blocked soil pipes manholes",
  "text": "Really efficient work, completed within 20 minutes.",
  "postcode": null,
  "date": "2012-04-01"
 },
 {
  "title": "Unblocked downstairs loo.",
  "text": "Courteous, professional manner from initial phone call to the receptionist and then from the engineer who undertook the job. Fast, efficient, effective.",
  "postcode": null,
  "date": "2012-04-01"
 },
 {
  "title": "New float valve to cistern.",
  "text": "Very prompt and good.",
  "postcode": null,
  "date": "2012-04-01"
 },
 {
  "title": "Cleared blocked drain.",
  "text": "Harvey was very capable. Identified where the problem was, and dealt with it well.",
  "postcode": null,
  "date": "2012-04-01"
 },
 {
  "title": "Serviced an Ariston boiler",
  "text": "This was the 3rd time i'd used this company for different things. Work was done thoroughly by a very pleasant man who was happy to answer all of my questions.",
  "postcode": null,
  "date": "2012-03-01"
 },
 {
  "title": "Internal overflow fitted, toilet re-mounted.",
  "text": "Engineer polite, efficient and discreet.",
  "postcode": null,
  "date": "2012-03-01"
 },
 {
  "title": "Cleared blocked toilet and drain",
  "text": "A very well run company, giving, excellent service and very reliable.",
  "postcode": null,
  "date": "2012-03-01"
 },
 {
  "title": "Fixed leak in pipe.",
  "text": "The plumber was courteous, efficient and expert at his job. Highly recommended.",
  "postcode": null,
  "date": "2012-03-01"
 },
 {
  "title": "Repair to water pipe.",
  "text": "Very good. Arrived when they said he would. Fixed problem with minimal damage.",
  "postcode": null,
  "date": "2012-03-01"
 },
 {
  "title": "Cleared blocked kitchen drain",
  "text": "They came round and cleared our drain which the kitchen sink runs into - very efficient, job done quickly, would use again.",
  "postcode": null,
  "date": "2012-02-01"
 },
 {
  "title": "Clearance of blocked drains.",
  "text": "Paul cleared our blocked drains blocked drains very efficiently at a reasonable price. I would recommend this company.",
  "postcode": null,
  "date": "2012-02-01"
 },
 {
  "title": "Frozen water meter.",
  "text": "Excellent work thank you. I would recommend this company.",
  "postcode": null,
  "date": "2012-02-01"
 },
 {
  "title": "Water pipes in bathroom had been drilled into by a drain.",
  "text": "Justin completed his work swiftly and courteous and explained the problem. I trust the new piping will remain watertight. I would recommend this company.",
  "postcode": null,
  "date": "2012-02-01"
 },
 {
  "title": "Replaced faulty tap and basin was leaking.",
  "text": "Lovely lad! Great attitude. I would recommend this company.",
  "postcode": null,
  "date": "2012-02-01"
 },
 {
  "title": "Fixed broken and leaking pipe.",
  "text": "Prompt and knowledgeable. Easy job and a great chap.",
  "postcode": null,
  "date": "2012-02-01"
 },
 {
  "title": "Investigation of blockage",
  "text": "Very helpful.",
  "postcode": null,
  "date": "2012-02-01"
 }
]
